[
  {
    "id": 3,
    "letterID": 3,
    "text": "my career is in jeopardy, and i need advice fast. i am a sales representative for a giftware distributor, and i attend many trade shows. lots of hanky-panky goes on among my colleagues, but i don't express my outrage because it's so accepted.\nrecently, mr. x, my company's biggest account, made a pass at me, and when i refused, he threatened to stop buying from my company. he has not carried out his threat as yet, but i'm sure he will. i feel terrible for my boss, but i can't quit and go to another company because i'll be up against mr. x again.\nif i report mr. x to his boss, whom i know, he will laugh me right out of his office. what can i do?\nlikes my job.",
    "title": "FOR THE TUNES IN YOUR HEAD, WHISTLE UP A MUSIC SCHOOL",
    "topic": "Inappropriate behavior",
    "year": 1985,
    "month": 6,
    "day": 23
  },
  {
    "id": 8,
    "letterID": 8,
    "text": "i am a 19-year-old girl. at the age of 17, i had my first sexual experience with my boss, whom i thought i loved. the problem is, i already wasn't a virgin. what could have caused this?\ni wonder if my horseback riding could have caused it. or maybe it was my dancing. i took professional dance for three years. is it possible to lose your virginity without knowing it?\nanyway, i now have a boyfriend. he is 25 years old and we plan to get married. what am i going to do when he finds out i am not a virgin? i have heard a plastic surgeon can make virgins out of non-virgins. is that true? please help me. i can't ask my parents. troubled near chicago",
    "title": "GIRL WANTS TO REGAIN LOST VIRGINITY",
    "topic": "Romance",
    "year": 1987,
    "month": 6,
    "day": 12
  },
  {
    "id": 16,
    "letterID": 16,
    "text": "i am a secretary and have been for some years now. but recently, i started working with a new company, and i have one major problem with one of the higher authorities (who isn't my boss/supervisor) who uses me as her personal secretary -- and i do mean personal. she has me doing her income taxes, her daughter's income taxes, her lease, etc., and making coffee. the last duty is extremely irksome.\nyes, i am supposed to assist her, as directed by my boss. but he means as an aide, not a maid. i do not like coffee, therefore i don't drink it -- so why do i have to make it? i really don't think coffee-making is in any secretarial job description.\ni really would like to tell her to do her own personal things and make her own coffee, but she's very sneaky and i fear she might go behind my back and tell my boss some off-the-wall story. how do i handle this without jeopardizing my job or any future references i may need when i decide to change jobs in the future? -- no personal secretary",
    "title": "Making Coffee Leaves Bitter Taste in Secretary's Mouth",
    "topic": "Irrelevant duties",
    "year": 1991,
    "month": 9,
    "day": 28
  },
  {
    "id": 18,
    "letterID": 18,
    "text": "i am a female, working for a cable television company as a computer operator. lately, every morning when i sign in on the computer, i find suggestive messages of a sexual nature from the man i relieve from the night shift.\none message: \"darling, i dreamed about you last night ...\" he also had flowers delivered to me at work on valentine's day.\ni am a single mother and this is starting to get out of hand. i am dating another man and have no interest in this co-worker.\nshould i report him to my supervisor? someone in the office suggested that i file sexual harassment charges. what if i do, and the guy gets canned from work and tries to hurt me or get even? -- harassed in denver",
    "title": "Office Baby Showers Dry Up When Woman Adopts Toddler",
    "topic": "Romance",
    "year": 1991,
    "month": 6,
    "day": 26
  },
  {
    "id": 19,
    "letterID": 19,
    "text": "please help me. my desk at work is 10 feet away from a person who whistles constantly. i get so irritated that i cannot concentrate on the task at hand. this is beginning to have a great effect on my work, and i don't like it. the problem is that this person is my boss, and i don't want to run the risk of seeming insubordinate. on the other hand, if this whistling does not stop, i will go crazy. what should i do? -- soon-to-be-bonkers",
    "title": "Office Baby Showers Dry Up When Woman Adopts Toddler",
    "topic": "Personal habits",
    "year": 1991,
    "month": 6,
    "day": 26
  },
  {
    "id": 21,
    "letterID": 21,
    "text": "i am 19 and was a virgin until april 1991. since then, i have been with three men, all of whom were one-night stands. one was married and away from his wife at the time. i'm sorry i gave in to temptation and have asked god to forgive me, and i feel like he has.\nthen it happened again with my manager at work. i was always attracted to him and knew that he was to me, too. he told me that he was getting a divorce, so we got together.\nwill god forgive me for the second time? i really do want to serve the lord more than anything else. i pray that god will give me the strength to resist temptation. i am not even going to tell you about the third guy. i don't even know his last name. it happened so fast and i am ashamed.\nabby, please remember me in your prayers. any advice you can give me will be appreciated. ashamed to sign my name",
    "title": "Japan's a scapegoat for a world of woes",
    "topic": "Inappropriate behavior",
    "year": 1992,
    "month": 2,
    "day": 19
  },
  {
    "id": 25,
    "letterID": 25,
    "text": "i am a happily married 29-year-old woman. i recently changed jobs, and my problem is my supervisor. he's a conceited, middle-aged married man who fancies himself to be quite a fox. he keeps asking me to go out with him. i told him no from the start, but he kids me about it every day, and i go along with the kidding, pretending it's all in fun, but i know he is serious.\ni don't want him for an enemy, so how can i get him to leave me alone without insulting him?\nredhead",
    "title": "EVEN WITH DIRECTIONS, DRIVER GETS LOST",
    "topic": "Inappropriate behavior",
    "year": 1995,
    "month": 8,
    "day": 27
  },
  {
    "id": 26,
    "letterID": 26,
    "text": "i am a secretary who qualifies in the \"i never thought i'd be writing to dear abby\" club, but i really need help with this problem:\nwhen someone calls to talk to my boss and i tell the caller that he is engaged in a telephone conversation, the caller invariably says, \"how long do you think he'll be?\"\nnow really, abby, i am not a mind reader, and there is virtually no way of knowing whether he will be tied up on the phone for an hour or only two minutes.\ni always say politely, \"i'm sorry, but i have no way of knowing.\" then i am made to feel like a dummy.\nabby, you're quick on your feet. please give us secretaries a quippy reply to this asinine question.\na.f.",
    "title": "HOW TO PUT STUPID QUESTIONS ON HOLD",
    "topic": "Secretarial duties",
    "year": 1995,
    "month": 9,
    "day": 2
  },
  {
    "id": 30,
    "letterID": 30,
    "text": "i am in love with a 44-year-old man i'll call \"mark.\" he was a guest for about five months here at the hotel where i work. mark would stay here monday through friday and go home every weekend. his job transfer was the reason he was staying here. after he sold his home, he planned to move closer to here.\nwell, a few days ago mark got promoted, and now he has to work in detroit. he lives only a couple of hours from detroit, so he might not have to sell his house after all. the bad thing is, not only is mark working in detroit, he also has a wife.\ni know this whole thing is wrong, but i love him. he promised to leave me his pager and cell phone numbers when he left, but he didn't. in fact, my boss was the one who told me that he got the new job and would never be back again. mark and i saw each other for most of his stay here, and i miss him so much. i don't know why he left the way he did or why he hasn't even called. i have a boyfriend, and he happens to like mark. (he doesn't know about us.)\ni have mark's address and telephone number at home, but i can't call because of his wife. i'm in the process of making plans to move to detroit just so i can be near him. abby, i love mark and will do anything just to see his face and hear his voice -- even if it's for the last time. what should i do? -- missing mark in michigan",
    "title": "Distraught Ex Boyfriend Shows Signs of a Stalker",
    "topic": "Romance",
    "year": 1999,
    "month": 12,
    "day": 19
  },
  {
    "id": 33,
    "letterID": 33,
    "text": "i am 34 and divorced for three years. i met a very nice man i'll call jim at my boss's christmas party. we hit it off very well (at least i thought we did). he is about 20 years older than i and in the process of getting a divorce. also, he is a friend of my boss. they play racquetball every week.\nat the party, he told me i was \"too young.\" i felt i met a nice person to be friends with, and the age difference doesn't bother me. i have been through a six-year relationship, live on my own and pay my own bills.\nit's been two weeks, and i would like to know how i can see him without jeopardizing my job or a friendship. he didn't ask for my phone number, but he knows where i work. should i sit back and wait, or should i call him? i don't want to embarrass him or myself, but i don't see why a younger woman can't date an older man. i will abide by your advice. -- interested in illinois",
    "title": "Younger Woman Seeks Older Man for Friendship and Maybe More",
    "topic": "Romance",
    "year": 1999,
    "month": 1,
    "day": 28
  },
  {
    "id": 37,
    "letterID": 37,
    "text": "last january, my boss promised to give me a raise for taking on a new responsibility at work. this responsibility involved taking a class away from home, which i completed.\nnow that i've taken the class and am doing the work, he tells me there is no money in the budget for the promised raise (even though he just bought a new vehicle for the office) and says i'm doing the work anyway -- so why should i get the raise?\nshould i refuse to do any more work associated with this added responsibility, or just keep doing it and hope for the best later on? -- taken advantage of in kansas",
    "title": "Don't Leave Kids in Cars Not Even for a Minute",
    "topic": "Unfair treatment",
    "year": 2000,
    "month": 8,
    "day": 14
  },
  {
    "id": 40,
    "letterID": 40,
    "text": "my boss gave me diamond earrings for christmas. i am a married woman and he is a married man.\ni know his wife thinks this was an inappropriate present. i am torn. what should i do? -- working woman in pennsylvania",
    "title": "Kind Words for Unhappy Child Came When They Were Needed",
    "topic": "Inappropriate behavior",
    "year": 2000,
    "month": 2,
    "day": 24
  },
  {
    "id": 42,
    "letterID": 42,
    "text": "for the past five years, i have been friends with a man i'll call harry. we met while we were working for the same company. i was dating someone else at the time, but the chemistry between harry and me was apparent.\nhe eventually became my boss, so dating was out of the question. both of us ended up leaving the company and getting involved with other people, but we always remained friends. nothing romantic ever occurred between us -- even though people always assumed we were a couple and would ask us how long we had been married!\nrecently we both became unattached again. my question: can two people who have been good friends for such a long time become lovers and make it work? or was \"when harry met sally\" merely a movie? -- a \"sally\" in new jersey",
    "title": "Longtime Friends Pause Before Becoming Lovers",
    "topic": "Romance",
    "year": 2002,
    "month": 11,
    "day": 30
  },
  {
    "id": 43,
    "letterID": 43,
    "text": "i work in an office that's made up of cubicles, so there is little privacy. after two years at this job, i have, for the most part, learned to block out background noise. however, my co-worker \"gina,\" who sits in the cubicle next to mine, talks to herself constantly.\nthis woman provides me with a running diatribe of every single task she does all day long: \"hit enter, file-save -- ok, done!\" \"open new file,\" \"delete,\" etc. her monologue goes on and on. it's extremely distracting and annoying. i have talked to my bosses more than once about it, and they've talked to gina, but still she continues.\ni feel like i'm slowly going insane. and now that i'm pregnant, my nerves are even more on edge. her constant verbalizing has become too much to bear. what's the answer, abby? -- going nuts at work in redding, calif.",
    "title": "Woman's Play by Play Account at Work Drives Co Worker Nuts",
    "topic": "Personal habits",
    "year": 2002,
    "month": 11,
    "day": 6
  },
  {
    "id": 44,
    "letterID": 44,
    "text": "i have been working for the same company for more than three years. i have a good relationship with my boss, \"al.\" however, i think he has fallen in love with me. i don't know how to handle this delicate situation since he is married. al says he and his wife no longer have anything in common -- including sex.\nal and i are good friends, but he has mentioned several times that he wants to take our relationship \"further.\" he gets moody because my feelings toward him are not the same. i am not physically attracted to al. i don't like to see him depressed, so i tell him things to make him feel good about himself. the problem is, i'm beginning to think i am leading him on. al's been there for me through some tough personal times and has helped me financially as well. i feel as though i need to stop letting him do things for me since it makes me feel obligated.\nabby, how can i deal with this without losing al's friendship? -- jennifer in mississippi",
    "title": "Boss Who Pushes for More May Be Guilty of Harassment",
    "topic": "Inappropriate behavior",
    "year": 2002,
    "month": 5,
    "day": 27
  },
  {
    "id": 45,
    "letterID": 45,
    "text": "i am a 30-year-old female and have been repairing computers for two years. i thoroughly enjoy it. however, the field is dominated by men, and i have a problem.\nmy boss doesn't take me seriously. he will put a malfunctioning computer in front of me; i will test it and tell him what i think is wrong with it. abby, he always disagrees with me.\nwhen he puts the same computer in front of one of his male techs and they will tell him the same thing, he always agrees with them.\ni think it's time he gave me credit where credit is due. is there anything i can do to change my boss's behavior, or should i consider moving on? -- frustrated georgia tech",
    "title": "Woman Reluctant to Lose Man Who Keeps Too Many Secrets",
    "topic": "Unfair treatment",
    "year": 2002,
    "month": 3,
    "day": 6
  },
  {
    "id": 46,
    "letterID": 46,
    "text": "my boss, \"adam,\" is 43. i am 50. we are both divorced. we have become very close during the three years we have worked together. i have two adult children. he has none.\nadam and i spend a great deal of time together -- at work and socially -- but always on a platonic basis. the problem is, i have fallen in love with him. i realize that an on-the-job romance -- especially between a boss and a subordinate -- would be a big mistake. however, i know he cares a great deal for me, although he does not share my romantic feelings.\nabby, i am having a hard time hiding my emotions when he dates other women. it impacts my work performance. i feel it would be best for me to look for another job. he told me that if i were a true friend i would want him to be happy and to marry someone who could be the mother of his children. i do want adam to be happy, and i love my job, but i have deep feelings for him. he thinks it is selfish of me to want to leave. do you? -- it's tough to be in love by myself",
    "title": "Special Smoke Detectors Send Alarm to the Hard of Hearing",
    "topic": "Romance",
    "year": 2002,
    "month": 1,
    "day": 14
  },
  {
    "id": 49,
    "letterID": 49,
    "text": "i have finally met the man i have been waiting for. i began working here 10 months ago, and from the day i walked in and saw my boss, i knew he and i were meant to be together.\nwe began an intense physical relationship two weeks after i was hired. we had lunch and talked on the phone every day. then suddenly, about a month later, he stopped having anything to do with me personally and started keeping his distance at work.\ni still believed with all my heart that he was the man for me. i waited and waited. i knew he would come back to me -- and after six months he did! for the last four months he has been showering me with attention. i am completely in love with this man, but there are days at work when he doesn't speak to me. he contends that all is still good between us.\ni am an attractive woman and almost every man at work has asked me out. could my boss be stringing me along just to have bragging rights with the guys? am i just a toy for him? a trophy, if you will. could he be using me?\nplease don't print my name or location. this is a small town, and anyone who sees my letter would know it is me. -- jane doe, anywhere, u.s.a.",
    "title": "Woman in Affair With Boss Wonders if She's Being Used",
    "topic": "Romance",
    "year": 2003,
    "month": 9,
    "day": 6
  },
  {
    "id": 51,
    "letterID": 51,
    "text": "i'm kinda involved with this guy at work. he's my boss and he's really hot. \"rod\" and i started sleeping together almost a year ago, and he's told me all along that he cares a lot for me. my problem is he says he can't \"be\" with me, because he can't give me what i deserve emotionally -- he can only fulfill my physical needs.\nso, in my head i'm saying, \"ok, that's better than nothing.\" rod bought me a car and has been generous in the money department. but a couple of months ago, he started seeing this other girl. i refer to her as the \"sexless unwilling virgin.\"\nrod says he loves her, but he still wants to sleep with me. i don't understand why he doesn't love me, and i can't figure out why he's never taken me out on a real date. lately he only stays overnight when he doesn't have anything else to do.\ni know he cares for me, and that we have a history he doesn't have with the \"s.u.v.\" should i keep sticking it out? i can't stop hoping that one day we'll end up being a real couple. rod means the world to me. i'd do almost anything for him. what do you think? -- in love with the hot rod",
    "title": "Woman Hopes Fling With Boss Will Become Steady Commitment",
    "topic": "Romance",
    "year": 2003,
    "month": 3,
    "day": 26
  },
  {
    "id": 52,
    "letterID": 52,
    "text": "in two months i will be quitting my place of employment and moving to the west coast. even though i dislike my job, i love the people i work with and feel bad about leaving them.\nthe boss holds regular staff meetings and assigns me duties. my stomach churns each time i accept a project i know i will not be around to complete.\nis it immoral to keep secret the fact that i will be resigning in two months? i plan on giving three weeks' notice, which i think is fair --- and all i can afford. if i give more than that, i know my boss would find my replacement right away. what should i do? -- caught in a bind in knoxville, tenn.",
    "title": "Mom's Nudity Around the House Is More Than Son Can Handle",
    "topic": "Obliged to boss",
    "year": 2003,
    "month": 3,
    "day": 1
  },
  {
    "id": 53,
    "letterID": 53,
    "text": "i am a 19-year-old female college student who just started a part-time job at a pizza parlor. the one problem i'm facing is my boss keeps staring at my breasts every time we talk. it's very unsettling. how do you suggest i handle this, abby? i really need to keep my job. -- co-ed with a gawking boss in minnesota",
    "title": "Unacknowledged Dad Is Eager to Reclaim His Parental Rights",
    "topic": "Inappropriate behavior",
    "year": 2003,
    "month": 2,
    "day": 16
  },
  {
    "id": 54,
    "letterID": 54,
    "text": "my new boss is a nervy man who barks orders at everyone, and has a huge belly. i'll call him ralph. every few weeks on a whim, ralph schedules office potlucks on company time and orders his employees to bring homemade dishes as a \"team-building\" exercise.\nralph frequently reminds us that each dish must be homemade. as late as the day before a potluck, he'll post a sign-up sheet in the lunchroom that dictates food categories and limits. (for example, only two people may bring salads, etc.)\ni e-mailed my boss asking if i could bring a high-quality store-bought item, because between working full time and my long commute, spending time in the kitchen isn't something i care to do. ralph never bothered to answer. with great resentment, i ended up making a large tuna casserole at midnight for the potluck the next day.\nabby, are employees like me powerless in these circumstances? how can i avoid participating in the potlucks without being labeled insubordinate or getting punished? no one else in our office has spoken up, but each time that sign-up sheet is posted, the tension is so thick you could cut it with a knife. -- resentful in new york city",
    "title": "Resentful Worker's Full Plate Includes Cooking for the Boss",
    "topic": "Irrelevant duties",
    "year": 2003,
    "month": 2,
    "day": 9
  },
  {
    "id": 55,
    "letterID": 55,
    "text": "i'm employed as a legal assistant in a law office with two other people: my boss, \"jerry,\" and my co-worker, \"evelyn.\" before reading further, please understand they are not having an affair.\nmy problem is that jerry shows extreme favoritism to evelyn. some examples:\n(1) jerry threw an elaborate party for evelyn on her birthday and did nothing for mine, even though he was aware of the date.\n(2) he purchased an \"employee incentive\" package from an airline to reward \"deserving employees\" with air miles. within six months, he awarded all of them to evelyn.\n(3) he ordered business cards for my co-worker and none for me, even though we are both his assistants with the same title.\n(4) i suspect jerry gives bonuses to evelyn and not to me -- that are based upon the \"good work\" that both she and i do for the firm.\n(5) he's flying evelyn and her boyfriend first-class to cancun to attend a seminar with him.\n(6) evelyn and i both exceeded our allotted vacation time last year. jerry made me pay back the extra vacation days i took, but didn't make the same request of her.\ni realize that evelyn has been a legal assistant for many more years than i have. however, it's obvious that our boss out-and-out favors her. what should i do about it, abby? -- treated unfairly in denton, texas",
    "title": "Woman Becomes a Shut in to Shut Out Her Neighbor",
    "topic": "Favoritism",
    "year": 2003,
    "month": 1,
    "day": 25
  },
  {
    "id": 56,
    "letterID": 56,
    "text": "how do i tell my boss that her incessant talking keeps me from getting my job done? i am currently a week behind because i was out sick for several days last week, and my boss won't stop talking and let me catch up.\nshe isn't married and doesn't have many friends, so i know her need for friendship carries over to work -- but it's starting to make me very stressed. then again, she's my boss. how do i deal with this? -- falling behind in alabama",
    "title": "Holiday Greetings to Troops Ease Their Burden of Duty",
    "topic": "Personal habits",
    "year": 2004,
    "month": 12,
    "day": 22
  },
  {
    "id": 58,
    "letterID": 58,
    "text": "i am a receptionist in a law firm. there are times when i am very busy, but there are long stretches when there is nothing to do.\nis it proper for me to read during the downtime? i feel awkward when my boss sees me reading. -- bored on the job",
    "title": "Wife's Resentment of Husband Grows as He Mows Her Plants",
    "topic": "Etiquette",
    "year": 2004,
    "month": 9,
    "day": 27
  },
  {
    "id": 59,
    "letterID": 59,
    "text": "an outside vendor came to the place where i worked and made lewd comments to me.\nwhen i learned that he would be the person training me on the new software i'd be using for the promotion i had just received -- my second promotion in two years -- i reported the incident to my immediate supervisor. within four working days, i was demoted, publicly humiliated, and felt forced to turn in my resignation.\ni had signed a sexual harassment agreement with my bosses that i would report any incident to them. should i have kept my mouth shut? do i have any recourse? -- humiliated in birmingham, ala.",
    "title": "Pregnant Teen Is Terrified by Husband's Threats to Kill",
    "topic": "Inappropriate behavior",
    "year": 2004,
    "month": 8,
    "day": 28
  },
  {
    "id": 60,
    "letterID": 60,
    "text": "my boyfriend, \"ron,\" and i have been together for six years and have lived together for two. we are planning to be married.\ni work close to home and sometimes ron meets me for lunch nearby. when he drops me off, he insists on kissing me in the car in front of the building, a long, lingering tongue kiss. i think it is inappropriate, because my bosses and co-workers have windows right there, and there are often clients outside.\nwhen i try to pull away, or explain why it makes me uncomfortable, ron gets upset and says i must be ashamed of him or something. that's not true! i would simply rather keep such displays of affection confined to our house, or at least away from my workplace. am i wrong? -- embarrassed in boston",
    "title": "Boyfriend's Lunchtime Ardor Is Not for Public Consumption",
    "topic": "Personal habits",
    "year": 2004,
    "month": 8,
    "day": 18
  },
  {
    "id": 62,
    "letterID": 62,
    "text": "i have a dilemma. i work as a nanny for a single father. my boss has been hitting on me, even though he knows i have a boyfriend. i try to avoid my boss at all costs, which is pretty easy since he works until late at night and i'm usually in bed when he comes home.\nbut when i can't avoid him, he flirts with me and rubs my shoulders.\ni love this job and don't know what to do. how should i handle this? should i tell my boyfriend what's going on? -- a nanny in texas",
    "title": "Nanny Grows Tired of Playing Hide and Seek With Single Dad",
    "topic": "Inappropriate behavior",
    "year": 2004,
    "month": 4,
    "day": 9
  },
  {
    "id": 64,
    "letterID": 64,
    "text": "i have been in a new clerical job for only a few weeks. i type a lot of handwritten drafts for my computer-illiterate boss. while typing, i have noticed that the grammar he uses for in-house correspondence is less than stellar. i correct small mistakes where necessary, but i'm uncomfortable with changing sentence structure or reshaping paragraphs, although my boss's writing could benefit from it. if i could edit as i please, his correspondence would be more concise and easier to read.\nshould i bother to correct his mistakes, aside from spelling and verb tense? the public doesn't see any of this, and everyone here is already aware of his writing style. what will make him look worse -- poor grammar, or a sudden, inexplicable improvement that seemed to arrive with his new secretary? what will make me look worse -- letting this slide, or appearing uppity?\nalso, if i should be reworking his drafts, how should i broach the subject of asking permission to do so? he's very casual as far as bosses go, but i don't want to cause embarrassment by pointing out that i have stronger writing skills. -- grammatically correct in pennsylvania",
    "title": "Wife Stays by Sick Husband's Side Despite Threats and Abuse",
    "topic": "Secretarial duties",
    "year": 2005,
    "month": 5,
    "day": 6
  },
  {
    "id": 69,
    "letterID": 69,
    "text": "i am a security officer. i started this job only three weeks ago. yesterday was pretty stressful. i kept my cool because i was dealing with explosives. after three attempts to find out what building they belonged in, this one employee told me \"not to get my panties in a bunch.\"\ni told my boss what happened and demanded an apology. it has yet to happen. i am a contract worker. do i have a right to report this on my own? i know the name of the person who said it.\ni had to go to the hospital because my blood pressure was 166/109, and i had pain in my chest and dizziness. then i had to go back to the doctor the next day for a checkup. what are my rights? -- unsure of what to do",
    "title": "Tables Turn When Jilted Wife Now Could Be 'Other Woman'",
    "topic": "Inappropriate behavior",
    "year": 2006,
    "month": 7,
    "day": 13
  },
  {
    "id": 70,
    "letterID": 70,
    "text": "my boss's mother passed away recently and the funeral is this weekend. i had spoken to \"mrs. white\" on several occasions and met her twice. my question is, should i attend the visitation, as it is my boss's mother who passed away? i don't want to commit \"career suicide\" by not attending -- but on the other hand, i don't think i'd feel comfortable being there. -- mississippi maiden",
    "title": "Illiterate School Custodian Resists Going Back to Class",
    "topic": "Condolences",
    "year": 2006,
    "month": 4,
    "day": 26
  },
  {
    "id": 72,
    "letterID": 72,
    "text": "i have worked at my present job a little over a year. when i make a mistake, my supervisor comes over to my desk, leans very close to me and tells me loudly what i have done wrong.\nthe office is very large, and i find her behavior threatening. i feel like i am backed into a corner. my way of dealing with it is just to say anything to get her out of \"my space.\" it's also embarrassing that everyone in the office can hear everything we say. i'm about ready to file a harassment suit.\nhow can i get her to back off a little or take it to a private office? -- intimidated in wichita, kan.",
    "title": "Woman Searches for Reason to End Her Guiltless Affair",
    "topic": "Unfair treatment",
    "year": 2007,
    "month": 12,
    "day": 15
  },
  {
    "id": 73,
    "letterID": 73,
    "text": "i was the other woman for seven years, involved with a man i thought was perfect. his wife knew about me. it was never an issue until he fell in love with me. after that, things changed. he began making promises and told me as soon as his wife got herself together and found a job and a place to live, he'd divorce her and be with me forever.\ntwo years became three, three became five. finally i realized he'd never do what he promised, so i ended it. the problem is, he's my boss. he was my best friend, and i still had some hope. we see each other every day because of work, although i am considered an independent contractor.\na year after i called it quits he finally filed for divorce. a few months later he met this new woman. he says he loves her, but i still hurt. every day is another day of holding back my tears, another day to hide my pain.\ntoday i met a woman who is a member of a group i belong to. she mentioned she knows a man who would be \"perfect\" for me. she said they had dated a few times over the years. abby, the number she gave me was his. while we were together he was seeing this other woman! i am devastated.\ni am still in love with him. how can i make myself forget him when we still work together? please advise. -- weeping in chico, calif.",
    "title": "Perfect' Man Cheats Both on His Wife and Mistress",
    "topic": "Romance",
    "year": 2007,
    "month": 12,
    "day": 9
  },
  {
    "id": 76,
    "letterID": 76,
    "text": "i just got out of college and have a part-time job in my field. the hours are horrible, but my job has been pretty easy and laid-back, so i had no problems.\nwell, my job just got \"upgraded,\" which means more responsibilities but no pay raise, and i am now being assigned more tasks than i can handle that early in the morning. i keep nodding off because no matter how much sleep i get, i just can't function that early.\nthere are other shifts that are open later in the day, and i have been thinking about asking my boss if he could put me on those, but my parents say it would be a huge mistake, and it will get me fired.\ni want to keep my job, but i am just not a morning person (for the record, i tried doing the extra-caffeine thing for a while, and it literally made me sick and bedridden for two days). any advice? -- too tired in parkville, mo.",
    "title": "Mama's Change of Heart Provokes Family Dispute",
    "topic": "Irrelevant duties",
    "year": 2007,
    "month": 4,
    "day": 27
  },
  {
    "id": 77,
    "letterID": 77,
    "text": "i'm an administrative assistant and often take calls for my boss. he usually asks me to tell the caller he is not in the office or to send them to his voice mail.\ni'm a terrible liar and not very good at making up excuses for him. i usually stammer or stutter when i'm lying. what can i tell these people and still stay true to myself? -- s-s-s-stuck in garland, texas",
    "title": "Husband Shares Mom's Secrets With Wife Who Hears Them All",
    "topic": "Secretarial duties",
    "year": 2007,
    "month": 2,
    "day": 25
  },
  {
    "id": 78,
    "letterID": 78,
    "text": "i am a 43-year-old woman with a lot of experience in my field of expertise. my problem is, my boss hired a student intern full time. i have been working here four years and, basically, run the store -- opening up, etc. -- but the student is making more money than i do.\nwhat would you do? move on, or stay and feel unfairly treated? -- the old shoe",
    "title": "Neighbors' Spotlight Puts Resentful Couple on Stage",
    "topic": "Unfair treatment",
    "year": 2007,
    "month": 1,
    "day": 26
  },
  {
    "id": 80,
    "letterID": 80,
    "text": "a group of us from work go out for drinks a few times a week. my boss's husband hits on me in front of her, and she doesn't say anything. a few of my co-workers are lesbians, and they hit on me, too. i don't have a boyfriend, but i have never been attracted to people of the same sex. i enjoy going out, but feel uncomfortable, and they are my only friends. how do i stop all this nonsense? -- brenda on the east coast",
    "title": "Daughter Can't Convince Her Parents to Change Their Diet",
    "topic": "Inappropriate behavior",
    "year": 2008,
    "month": 5,
    "day": 28
  },
  {
    "id": 83,
    "letterID": 83,
    "text": "most people complain about their jobs because they feel they don't make enough money. my problem is the opposite. i love my job, but i think i make too much money.\nmy job is mostly simple work that could be done by anybody -- yet i earn almost as much as my husband, who is a supervisor in a technical field. my boss always gives me excellent reviews and doesn't seem concerned.\nit's nice to have the kind of job that isn't stressful. but i feel guilty that a lot of people with more difficult jobs make less than i do. should i tell my boss to give me a pay cut, or take the money and run? -- cut or run in wisconsin",
    "title": "Keeping Track of Passwords Is Word to the Wise Online",
    "topic": "Unfair treatment",
    "year": 2008,
    "month": 3,
    "day": 4
  },
  {
    "id": 85,
    "letterID": 85,
    "text": "how do you handle someone who needs to constantly flaunt his money? that person is my boss. he makes a lot of money, and he enjoys rubbing it in my face. he never fails to tell me how much he pays for purchases -- from cars to clothing, even to how much he paid for his mother's funeral. he literally approaches my desk with his checkbook open and points out the amount.\nthis man spends more on clothes in a month than i earn in a year. he takes his cash out of his pocket and counts it in front of me. i feel like he's waiting for some kind of reaction from me, but i don't give in.\ncan you think of a way for me to stop him in his tracks when he starts regaling me with his next shopping spree? -- frugal office worker in the midwest",
    "title": "Wife Is Betrayed by Man's Repeated Internet Infidelity",
    "topic": "Personal habits",
    "year": 2009,
    "month": 11,
    "day": 22
  },
  {
    "id": 86,
    "letterID": 86,
    "text": "a year ago, my boss was diagnosed with cancer. she had major surgery and a round of radiation therapy. last week, her doctor discovered a mass, and after biopsy, she may be going in for more surgery.\ni am finding it difficult to show much empathy for my boss. despite having had the disease she continues to live an unhealthy lifestyle. she still smokes, has a couple of drinks a day and eats a lot of red meat. i don't drink or smoke and i'm a vegetarian, so i can't understand why a person would risk her health by doing these things.\nwe have received several newsletters at work from our insurance provider on how to prevent cancer, but she hasn't taken any of the advice. abby, it's not like i have come right out and said, \"it's your own fault,\" but it's frustrating to listen to her problems when she won't try to live a healthy lifestyle. she's generally whiny to begin with, and now she seems to want everyone to feel sorry for her.\nwhat do i need to do to be more sympathetic? -- trying in tempe",
    "title": "Woman's Size Is No Deterrent in Her Search for Lasting Love",
    "topic": "Personal habits",
    "year": 2009,
    "month": 11,
    "day": 20
  },
  {
    "id": 87,
    "letterID": 87,
    "text": "my boss wants my cell phone number for \"work purposes.\" he has trouble with limits, and i am reluctant to give it to him. i don't want to receive text messages, unsolicited calls or contact outside of work. my private life is just that -- private.\ni have kept an unlisted cell number for many years for good reason. i have a home phone and will answer it when the boss calls. i arrive promptly at work, but leave the job there.\nmy privacy is important. i had a bad marriage, and there was stalking and invasion by my ex-husband. those individuals who need my cell number have access to it.\nam i out of line? i realize that many people use their cell phones as their only phones and others don't mind receiving calls, but am i required to do so?\ni think this has upset my boss even though i have explained my reason. i don't use my cell phone on the job; it's in my purse except during personal time (lunch, etc.). must i give up my privacy to keep my job? -- wants privacy",
    "title": "Woman Objects to Giving Cell Phone Number to Her Boss",
    "topic": "Personal habits",
    "year": 2009,
    "month": 11,
    "day": 6
  },
  {
    "id": 88,
    "letterID": 88,
    "text": "i work for a small company where i'm one of 12 employees under one manager. my boss, \"debbie,\" is having problems at home. almost daily, she brings her not-so-sunny outlook to the office and proceeds to drag everyone else down.\nany time a colleague has something positive to share, debbie finds a way to negate it. if someone mentions it's nice weather, she'll complain about how much yard work she needs to do and the disastrous effects of global warming. she even complained that a pregnant co-worker's impending maternity leave will be \"inconvenient.\"\nthe woman thrives on negativity, chaos and stress. she even complains about happy times of the year like summer vacations and holidays because we tend to be busier. (isn't that a good thing considering the economic climate?)\nour office is small, so there's no escaping her. if she's not complaining to us, she's telling the same sob stories to a client on the phone. what can my co-workers and i do to keep from being dragged down with her? -- working for \"debbie downer inc.\"",
    "title": "Friend Involved With Married Man Will Have to Go It Alone",
    "topic": "Personal habits",
    "year": 2009,
    "month": 10,
    "day": 21
  },
  {
    "id": 92,
    "letterID": 92,
    "text": "i am a happily single 22-year-old male. my boss, who is happily married, is extremely enthusiastic about finding me a woman. he is aware that i am ok with being single, but he feels it is his duty to find me a girlfriend.\nat first, it was only slightly irritating. however, this matchmaker game has gotten out of hand. it has escalated into him printing up fliers with my photo on them, inviting women to sign up for a date with me. what should i do about this? -- content bachelor in missouri",
    "title": "Senior Still Enjoying Sex Feels No Desire to Brag",
    "topic": "Inappropriate behavior",
    "year": 2010,
    "month": 12,
    "day": 8
  },
  {
    "id": 94,
    "letterID": 94,
    "text": "my supervisor \"valerie\" is smart and beautiful. however she is a few pounds overweight. the problem is she thinks she can still squeeze into a size 8. you can tell she's interested in looking professional and stylish by the clothes she picks out, but she still looks terrible. she is obviously in denial about her appearance, and her co-workers and underlings talk about her behind her back.\nbecause valerie is my supervisor, i do not feel comfortable telling her how unprofessional she really looks. i am surprised that none of her friends has told her (tactfully), or that her supervisor hasn't told her how unprofessional it is that we all can see the outline of her underwear.\nthe shame of it is that it's hard to take valerie seriously in her professional capacity when all one can think about is her clothes don't fit. how does one approach such a subject with someone who isn't really a friend? -- grossed out at work",
    "title": "Dog Left Home Alone Causes Concern for Worried Owners",
    "topic": "Personal habits",
    "year": 2010,
    "month": 9,
    "day": 26
  },
  {
    "id": 95,
    "letterID": 95,
    "text": "i work six days a week at a minimum-wage job. my boss is constantly finding reasons to hug or touch me. last week he even tried to kiss me. i left work that night feeling violated and upset.\nit's really hard to find jobs right now. i can't afford to quit or get fired. what do i do to get this man to leave me alone and still keep my job? please help! -- grossed out in texas",
    "title": "Harassed Worker Won't Make Waves in Tough Job Market",
    "topic": "Inappropriate behavior",
    "year": 2010,
    "month": 9,
    "day": 12
  },
  {
    "id": 96,
    "letterID": 96,
    "text": "i am 23 years old and i adore my job and my boss. there is only one problem -- i must commute more than an hour each way, and the drive (especially with gas prices these days) is killing me.\ni have been with the company for more than a year, and i recently heard that the parent corporation is hiring for a position similar to mine in the town that i live in. i desperately want to apply for the transfer, but i have no idea how to approach the subject with my boss, since i feel i owe her so much. she hired me for the position when i was fresh out of college with absolutely no experience.\nabby, help me! how do i ask to leave a job that i love? -- satisfied employee in valdosta, ga.",
    "title": "Reluctant Commuter Feels Torn Between Great Boss, Closer Job",
    "topic": "Obliged to boss",
    "year": 2010,
    "month": 6,
    "day": 11
  },
  {
    "id": 99,
    "letterID": 99,
    "text": "i am not gay or bisexual, but i'm in love with my boss, who is a female like me. she's 27 and i am 17. she is married and doesn't know how i feel about her.\ni looked up her address on the internet and got directions to her house. i drive by every day -- don't ask me why. i told her i have a friend who lives on the same street that she does, and that i saw her car in the driveway.\nabout a month ago, she caught me driving by as she was pulling out of her driveway. two days ago, she called my mother -- they have been friends for years -- and asked, \"what's wrong with 'janie'? she pulled my address up from a computer. i saw her driving past my house.\"\nthat's all my mom told me, but how in the heck did she find out? i still have the printout in my bedroom, and it's still in the same position it was, so i don't think my mom saw it and told her about it. only three of my closest friends know, and i don't think they repeated anything because they have no reason to -- and they don't know my boss. what's going on here? am i going crazy? -- found out in florida",
    "title": "Woman Is Weary of Hosting Every Time in Laws Visit",
    "topic": "Romance",
    "year": 2010,
    "month": 4,
    "day": 15
  },
  {
    "id": 100,
    "letterID": 100,
    "text": "i have a great job working with people i enjoy, and probably the coolest boss in the world. there is just one little problem. he keeps asking me to go out with his daughter.\nshe is a wonderful person, smart and absolutely beautiful -- but she is also recently divorced. i'm afraid i would just be the \"in-between\" guy for her -- a stepping-stone to her recovery. in other words, whatever happens would be at my expense.\nhow can i politely tell my boss that i cannot date his daughter? -- realist in utah",
    "title": "Daughter of Murdered Man Rejoices in Holiday Miracle",
    "topic": "Inappropriate behavior",
    "year": 2010,
    "month": 1,
    "day": 22
  },
  {
    "id": 101,
    "letterID": 101,
    "text": "one of my bosses insists on using his speakerphone for conversations -- business and personal -- with his office door wide open. he speaks loudly, and both sides of the conversation can be clearly heard throughout the office. he also walks through the hallways with his cell on speakerphone.\neveryone who works here finds his behavior annoying and boorish. no one says anything, and he doesn't get the message when a chorus of doors slam shut each time he begins one of these calls or walks by with his cell phone blasting. any ideas on how to address this issue? -- unwilling third party in the northwest",
    "title": "Boyfriend's Bedside Manner Gives Woman Little Comfort",
    "topic": "Personal habits",
    "year": 2010,
    "month": 1,
    "day": 19
  },
  {
    "id": 103,
    "letterID": 103,
    "text": "it has recently come to my attention that at work i am considered \"bossy.\" it came as a shock to me. i'm hurt that my co-workers and department manager think of me this way.\ni know i come on strong sometimes when it comes to helping customers, but i view it as helping. when i suggest to co-workers that they keep their areas clean and orderly, it is perceived as bossy. i'm just trying to help them not get fired for slacking off.\ni'm older than some of my co-workers and my manager. i tried for the manager position, and was initially angry when someone else got it. but now i see she does a good job, and i respect her. it seems, however, that my actions have sent the wrong message. what can i do to mend fences? or, should i just forget about it and look for something else? -- misjudged in albuquerque",
    "title": "Woman's Helping Hand at Work Comes Across as Interference",
    "topic": "Personal habits",
    "year": 2011,
    "month": 6,
    "day": 10
  },
  {
    "id": 105,
    "letterID": 105,
    "text": "i have received several invitations to parties recently in which i was asked to do part of the work or participate in some of the expenses.\nthe one that really took the cake was to a party hosted by my boss. she had decided to celebrate her birthday at her house, and when i and my co-workers rsvp'd, we were asked what type of dish we planned to bring. we also discovered that only invited employees were asked to bring food. her \"real friends\" weren't asked to bring anything. needless to say, all but one employee remembered they had a \"conflict.\"\nif someone doesn't have the time or money to host a party, there are plenty of inexpensive foods, disposable tableware, etc., that can be used in a pleasant, cost-effective event without burdening -- financially or otherwise -- invited guests. what matters is getting together to celebrate and socialize and have a good time with friends and family. abby, your thoughts? -- unhappy \"guest\" in missouri",
    "title": "Employees Expected To Cater Boss's Party",
    "topic": "Irrelevant duties",
    "year": 2012,
    "month": 12,
    "day": 17
  },
  {
    "id": 106,
    "letterID": 106,
    "text": "i recently began a new job, and although i love what i do, i have only one problem. my boss, \"harold,\" does not like eating lunch by himself. every day, he asks me what i'm doing for lunch. if i say i brought my lunch, he wants me to eat it in his office with him. if i tell him i'm going out, he wants us to go out together.\ni don't think he's attracted to me; i just think he hates being alone. he's entirely too clingy, and i feel my lunch break is supposed to be a time to do whatever i want to do.\ni don't believe the last lady who worked for him had a problem with this, but i do. how do i tell him \"no\" without offending him or hurting his feelings? -- lunch buddy in south carolina",
    "title": "Set Boundaries For Lunch Break",
    "topic": "Personal habits",
    "year": 2012,
    "month": 11,
    "day": 11
  },
  {
    "id": 107,
    "letterID": 107,
    "text": "i have a manners dilemma. i was raised in a home where \"yes, ma'am\" and, \"no, sir\" were expected, and i have used that respectful form of address throughout my life. yes, i grew up in the south.\nsix months ago, my husband and i moved north with our two children for job relocation. my co-workers are giving me a hard time about my constant use of \"ma'am\" and \"sir.\" they feel offended!\ni have tried to respect their request not to say it to them. some are my age, younger or older, but i'm used to saying it to everyone, all the time. it simply rolls off my tongue.\ni sense that upper management and my supervisor like being addressed that way. but what do you suggest i do with the rest of my co-workers? -- ol'-fashioned in ohio",
    "title": "Daughter Demands Widowed Dad Spend His Life Alone",
    "topic": "Etiquette",
    "year": 2012,
    "month": 11,
    "day": 9
  },
  {
    "id": 109,
    "letterID": 109,
    "text": "about a year ago, i began a part-time job for extra cash. my manager and i developed an attraction for each other that soon led to a sexual relationship. the problem is that he's married with two children, and he is significantly older than me.\ni know now that this has to end. i have no emotional ties to him, but i think he is starting to care for me. i can't quit the job because a family member got it for me, and it would seem suspicious if i quit.\nplease respond soon because i am trying desperately to avoid being alone with him, and it's becoming more and more difficult. how do i end the affair and remain on decent terms with this man? -- needs a quick out",
    "title": "When to Bury Dad's Ashes Causes Family Flare Up",
    "topic": "Romance",
    "year": 2012,
    "month": 8,
    "day": 31
  },
  {
    "id": 110,
    "letterID": 110,
    "text": "my boss, \"ms. m.,\" knows her stuff. she's supportive, flexible and communicates well about what's happening within the organization. however, she spends most of her time in my cubicle. she'll start out in her office and, 15 minutes later, slide into my cubicle to show me her kids' latest photos or insist my colleagues and i watch youtube videos of her favorite entertainers.\nthis happens continually throughout the day. i have to work from home in the evenings to get anything done. i have actually used vacation time so i could finish a project without ms. m.'s constant interruptions. i thought it was just me until i got sick last year and was out for several days. i got \"hate\" email from my colleagues because the boss was spending all her time in their cubicles!\nmeanwhile, contracts don't get finalized, deadlines are missed, phone calls go unanswered and complaints pile up. when she gets heat from higher-ups, she'll work on the weekend to make things right. then on monday morning she'll call a staff meeting that lasts over an hour, and we must listen to her sour complaints and more youtube videos from the weekend. it's maddening.\nms. m. is like a female nero fiddling while the department burns. i want to do my job during working hours. any suggestions? -- treading water in ohio",
    "title": "Chatty Boss's Interruptions Prevent Work From Being Done",
    "topic": "Personal habits",
    "year": 2012,
    "month": 2,
    "day": 12
  },
  {
    "id": 111,
    "letterID": 111,
    "text": "i work in a small, quiet office. my boss sits at the desk across from me and spends a great deal of time biting his nails. the noise drives me crazy and turns an otherwise pleasant work experience into a stressful one. i've tried turning up the radio, to no avail. do you have any suggestions on how to tell my boss that he has a loud and nasty habit? -- trapped with a nail-biter",
    "title": "Desk Placement Turns Into A Nail-Biter For One Employee",
    "topic": "Personal habits",
    "year": 2012,
    "month": 1,
    "day": 8
  },
  {
    "id": 114,
    "letterID": 114,
    "text": "while riding with my new boss to a sales appointment, he needed some information from his company-issued ipad. he asked me to turn it on and gave me the passcode. when i did, up popped a porn site. he almost wrecked the car grabbing the ipad from me.\nnot another word was said until we arrived at the appointment and he looked up the item prior to going in. nothing has been said about this incident since.\nevery time i think about my boss having gone to that porn site before i touched the ipad, i get sick to my stomach. he makes me sick. do i resign or stay? -- grossed out in ohio",
    "title": "Boss's Porn Habits Make Reader Question Employment",
    "topic": "Inappropriate behavior",
    "year": 2013,
    "month": 7,
    "day": 10
  },
  {
    "id": 115,
    "letterID": 115,
    "text": "i have been dating a married man for more than a year. he's my boss. \"gerry\" has two kids with his wife and two more outside the marriage.\ni have never been the type to date someone else's man, nor do i approve of it. i know that what i'm doing is wrong, but at times it just feels so right. we do everything together and enjoy each other's company.\nis it possible for him to be in love with us both? why do men cheat? -- the other woman in alabama",
    "title": "Mistress Wonders If Man Can Love Both Her And His Wife",
    "topic": "Romance",
    "year": 2013,
    "month": 6,
    "day": 26
  },
  {
    "id": 119,
    "letterID": 119,
    "text": "i am a male in the training department at my office. a lot of times, because the people i train are new hires, there are dress code violations from people who appear to be testing the limits. most of the violations involve women who wear clothing that's too revealing, in spite of the fact they receive a document at the start of training explaining what is and is not appropriate attire.\ni feel uncomfortable addressing dress code issues with the opposite sex. i have always asked a female in the department to do it for me. my problem is, my manager has told me i need to be able to deal with issues like this if i want to move forward in my career.\nmy question to you and your readers is, as a woman, would you feel more uncomfortable with a male boss addressing a \"too much cleavage\" or \"skirt too short\" issue than you would with another female? and have you any suggestions for wording in these situations? -- dressed for success in virginia",
    "title": "Office Trainer Seeks Right Way to Dress-Down Code Violators",
    "topic": "Inappropriate behavior",
    "year": 2014,
    "month": 10,
    "day": 6
  },
  {
    "id": 120,
    "letterID": 120,
    "text": "i have a very hard time expressing my condolences. i panic and avoid sadness at all costs. i'll give you two examples: my boss's husband died. (i worked for him, too.) because i couldn't talk to her, i avoided her like she had the plague.\nanother time, a close friend's son tried to commit suicide and severely injured himself. instead of hugging my friend's wife and asking how she was, i waved and went on like i was late for something.\ni'm ashamed of my behavior. how can i stop myself from acting like this? -- embarrassed in california",
    "title": "Loss for Words of Sympathy Is Embarrassing for Woman",
    "topic": "Condolences",
    "year": 2014,
    "month": 5,
    "day": 25
  },
  {
    "id": 123,
    "letterID": 123,
    "text": "should i or shouldn't i tell my boss that more than a few people have come to me asking if he is fooling around with a young woman here in the office?\nhe is married; she is not. they spend a lot of time together \"just visiting,\" laughing and obviously flirting. they have also been seen coming and going together, having lunch together every day, etc.\nmy reaction is that whether they are or aren't, it isn't my business. a little voice keeps telling me that, as his personal secretary, he may want to be made aware that people are talking about him behind his back, and i do feel protective and a sense of loyalty to him. understand that i do not want to discuss it with him, have verification, denial or anything else -- only to give him the information. -- vacillating in ohio",
    "title": "Boss Who's Object of Gossip Needs a Word to the Wise",
    "topic": "Romance",
    "year": 2014,
    "month": 2,
    "day": 27
  },
  {
    "id": 126,
    "letterID": 126,
    "text": "what can i do about my boss? i have worked at a bus company for 23 years. my new boss started six months ago. he jokes and laughs with all the other ladies in the office, but when it comes to me, he's all business. he talks to me only about things that are work-related, and when i try to talk to him about anything else, he gives me a forced grin and walks away. any suggestions? -- feeling left out",
    "title": "New Boss Leaves Longtime Employee Feeling Out Of The Loop",
    "topic": "Favoritism",
    "year": 2015,
    "month": 11,
    "day": 2
  },
  {
    "id": 127,
    "letterID": 127,
    "text": "a few days before my boss's wife gave birth, her father was tragically killed in an airplane accident. i want to congratulate my boss and his wife on the birth of their daughter, but i also want to pay respects to her father's passing. what is the etiquette in this case? -- happy and sad in italy",
    "title": "Joy Of Baby's Birth Is Clouded By Tragedy",
    "topic": "Condolences",
    "year": 2015,
    "month": 10,
    "day": 5
  },
  {
    "id": 131,
    "letterID": 131,
    "text": "i am 28 and engaged to marry a wonderful man, \"ryan.\" before i met him, i was involved in an affair with my married boss and was deeply in love with him. (i still am.) we continued our affair even after i met ryan, and now i think i'm pregnant. i told my boss and, naturally, he's not happy about it.\ni don't know how to tell ryan or if i even want to. i have always wanted to be a mother, and now i have the chance. but i may end up doing it alone in poor financial shape. i also won't have a home to live in once my old-fashioned mother finds out i've gotten myself pregnant before marriage. any advice? -- scared stupid in new jersey",
    "title": "Woman Debates Fessing Up To Fiance About Her Pregnancy",
    "topic": "Romance",
    "year": 2015,
    "month": 3,
    "day": 17
  },
  {
    "id": 136,
    "letterID": 136,
    "text": "i was just offered a huge promotion at my company. it will mean more than a 40 percent increase in pay, which is unheard of in my company, which has more than 10,000 employees. people in my department are not taking it well. even my director did not congratulate me.\ntaking on this new endeavor kind of scares me. i have had a tough year in my current position, and this new job is seriously tailored to me. my current manager -- who is new to the department -- feels this job was meant for me. she says i need a fresh start, and she has faith in me.\nwhat's awkward is, the position involves working with some of the same people i worked with previously, although in a different capacity. am i taking on too much? i know the team i will be working with, and i have a feeling i will love it. i'm just scared of setting myself up for failure. my boss and new manager are giving me a great opportunity, and i don't want to let anyone down. -- unsure in the midwest",
    "title": "Fear of Failure Plagues Rise up Corporate Ladder\n",
    "topic": "Treated too well",
    "year": 2016,
    "month": 11,
    "day": 30
  },
  {
    "id": 137,
    "letterID": 137,
    "text": "i'm currently interning with a government-contracted group. part of my job involves working with lgbt rights organizations. recently, at a meeting with my boss and several representatives of these organizations, the topic of fairness in the workplace was mentioned. i was asked what my experience was, and i shared that i thought the workplace was fair, and my experience was fine.\ni didn't think about it at the time, but i now realize i was being asked how my experience was as an lgbt person. in light of this, my boss has nominated me for a diversity award. the problem is i'm a heterosexual female, and i think he promoted me for the honor because he thinks i am gay.\nhow should i handle this? do i need to go on record to my boss that i am straight, that i have a boyfriend, and he misunderstood me? i don't want this to come back to haunt me, but i'm afraid addressing it may ruin my credibility because it has taken so long for me to address it. my sexual orientation is obviously not something of great interest at work, but i feel i am living a terrible lie, and i don't know how to fix this. -- ashamed in d.c.",
    "title": "Woman Receiving Diversity Award Knows She's Undeserving",
    "topic": "LGBT",
    "year": 2016,
    "month": 9,
    "day": 19
  },
  {
    "id": 140,
    "letterID": 140,
    "text": "about six months ago, i started a new job i really enjoy. a handyman who does odd jobs around the building was working on the floor in my area. he was chatty and i made polite conversation, but now things have escalated.\nhe has started contacting me on social media to the point where i had to block him. he tries to talk to me daily and i am feeling very uncomfortable. he's twice my age and i have no interest in him, romantically or otherwise.\nit has reached the point where i have a great deal of anxiety about going to work. i feel uncomfortable and intimidated. it's especially difficult because i work alone most of the day, so i am nervous he might try to harm me.\nhow should i approach this without it turning into a huge deal at work? i want to let my manager know, but i'm afraid it'll only cause more issues and make things worse. i'm afraid to make him mad, and afraid about what he might do. any advice would be great. -- afraid he'll harm me",
    "title": "Handyman's Unwanted Attention Ruins Excitement of New Job",
    "topic": "Inappropriate behavior",
    "year": 2016,
    "month": 8,
    "day": 11
  },
  {
    "id": 143,
    "letterID": 143,
    "text": "i am a 40-year-old man. i have worked at my current job for two years and love it, even though i earn only two-thirds what i did at my prior position.\nmy problem is, i think i'm in love with my boss. she's an amazing person -- very sexy -- and i can't stop thinking about her. the woman i loved died two weeks before i took this job, and i'm still not ready to date again. oh, my boss is married, so there's no way i can hook up with her.\nhow can i stop having feelings for my boss? should i just quit? i attempted to a month ago, but she gave me a raise. -- crushing in minnesota",
    "title": "Man Loves His Job as Well as His Boss",
    "topic": "Romance",
    "year": 2017,
    "month": 7,
    "day": 29
  },
  {
    "id": 145,
    "letterID": 145,
    "text": "my boss wants to do a day of community service with the staff to help others and improve relationships in the workplace. i thought it was a great idea; a lot of my co-workers were unsure and wanted more information about what specifically we would do. my boss said she would get more information and send it out to us. however, a few of my co-workers are outright opposed to the idea and think they shouldn't be required to do it.\na year ago when this came up, one of them said they shouldn't have to give up their free time. i think it's wrong to turn down a chance to help others when they are able. what should i do to make sure my boss's intentions are understood while not being off-putting or appearing holier-than-thou? -- bleeding heart",
    "title": "A Day of Service Is One Too Many for Reluctant Employees",
    "topic": "Irrelevant duties",
    "year": 2017,
    "month": 2,
    "day": 13
  }
]
