[
  {
    "FIELD1": 0,
    "id": 0,
    "letterID": 0,
    "text": "like a lot of other people, the only time i write to some of my friends is during the holidays. my problem is that my husband and i are in the process of getting a divorce. we have been married for a number of years and have no children (which makes it easier), but it's still hard.\nhow do i tell our friends? would it be proper to give them the news on a christmas card while wishing them a happy holiday? or should i just send a normal holiday card like all is well and write a separate note later? our divorce will not be final until february.\nhow to tell",
    "title": "IT'S WISE TO BE WARY WHEN A STRANGER COMES TO THE DOOR",
    "topic": "Communication",
    "year": 1985,
    "month": 1,
    "day": 4
  },
  {
    "FIELD1": 1,
    "id": 1,
    "letterID": 1,
    "text": "my best friend of almost 15 years was married for the third time about a year ago.\ntwo months ago, she asked me if i was interested in \"swapping\" husbands. i immediately said \"no\" because: (1) i think it's immoral; (2) i value my marriage; (3) i do not want to have sex with another man . . . especially with my best friend's husband. (she said it was her husband's idea.)\nsince then, my best friend has been cool to me, but she has been coming on to my husband . . . flirting, pressing against him, etc. also, her husband has been coming on to me. he told me he has been dreaming about me, and ever since he heard i refused to go to bed with him, it makes him want me all the more.\ni asked my husband what he thought about the swapping idea just to see what he'd say, and he said, \"i'll think about it.\" i was angry because he didn't say no right off the bat like i did.\ni still value my friendship with my best friend, and i feel sorry for her because she married that jerk.\nhow can we stay friends with this couple without agreeing to swap, which i think is what everybody wants, except me?\nno names, small town",
    "title": "LOSING A FRIEND COULD SAVE MARRIAGE",
    "topic": "Odd",
    "year": 1985,
    "month": 1,
    "day": 18
  },
  {
    "FIELD1": 2,
    "id": 6,
    "letterID": 6,
    "text": "my wife of 44 years has alzheimer's disease, and i finally have placed her in a nursing home where i know she is getting better care than i can give her.\nmy problem is loneliness. i have many friends who say, \"come over anytime; you're always welcome.\" then they tell me how much they admire me for caring for my wife the way i did these last few years.\ni don't need admiration--i need companionship. why can't people be more specific, and say, \"come over next sunday\" or wednesday or whatever?\nmaybe it would help if you put in a plug for those who are widowed, or in a situation like mine. after all, some of your readers may find themselves alone someday. sign me . . .\nlonely.",
    "title": "WHERE'S THE BEEF? IT'S A PUBLIC POOL",
    "topic": "Loneliness",
    "year": 1985,
    "month": 5,
    "day": 5
  },
  {
    "FIELD1": 3,
    "id": 9,
    "letterID": 9,
    "text": "recently a friend of mine (whom i'll call john) bought four theater tickets--one for himself, one as a birthday gift for me, and two for friends of his. it was my understanding that john's friends were going to pay him for their own tickets.\nabout two hours before the performance, john called and asked if i knew anyone who would like to come along because one of his friends had canceled at the last moment.\ni found a friend who was glad to go, and we all enjoyed the evening. afterward, i was astonished to learn that john expected payment for the ticket! it was my impression that the ticket would have gone to waste if it hadn't been used.\nwho should pay for the ticket? john? the friend who canceled? or my friend who came along at the last moment?\nsticky situation",
    "title": "THANK BAR-HOPPING PAL FOR CLUE TO LIVE-IN BOYFRIEND'S TRUE COLORS",
    "topic": "Etiquette",
    "year": 1985,
    "month": 6,
    "day": 25
  },
  {
    "FIELD1": 4,
    "id": 13,
    "letterID": 13,
    "text": "i heard on the news that a 12-year-old boy was kicked out of the boy scouts because he didn't believe in god. i really got upset because i am a 12-year-old boy and i don't believe in god either.\nmy friends don't respect me when they find out i don't believe in god. then they try to convince me that i am wrong. why can't they accept me the way i am? i don't go around telling people not to believe in god just because i don't.\ni don't think the boy scouts have the right to kick people out for their beliefs, do you? ticked in iowa",
    "title": "BRAGGING ABOUT PRICES CAN BE A COSTLY MISTAKE",
    "topic": "Religion",
    "year": 1985,
    "month": 8,
    "day": 21
  },
  {
    "FIELD1": 5,
    "id": 14,
    "letterID": 14,
    "text": "i invited a friend and her husband to my home for dinner. i also invited this friend's best friend and her husband. they all accepted the invitation, and i bought all the necessary food, wine, etc., which came to quite a lot of money.\ni started to prepare the dinner at 9 a.m. as they were expected at 5 p.m. at 2 p.m. my friend called to say that the other couple couldn't make it. i said, \"i'm very sorry, but i'm still expecting you and your husband.\" then she said, \"no, we'll take a raincheck for some other time when my friend and her husband are free.\"\ni was hurt and very angry and said, \"i have never heard of such a thing! what does your friends' canceling have to do with you?\"\nshe replied, \"nothing, really. i hate to do this to you, and if i were in your shoes, i would kill me!\"\ndo i have the right to be offended? this is the tackiest thing that has ever happened to me. your comment, please. speechless in santa ana",
    "title": "IT'S TIME TO DUMP TWO-TIMING CAD",
    "topic": "Etiquette",
    "year": 1985,
    "month": 9,
    "day": 3
  },
  {
    "FIELD1": 6,
    "id": 15,
    "letterID": 15,
    "text": "i use the bus to get around town. often a person will come along and sit beside me.\ni am by nature a very friendly person, and i enjoy visiting with people. it makes the time pass, and i have met a lot of nice people on buses.\ni usually begin the conversation by asking, \"how far are you going?\" you would not believe how many people say, \"it's none of your business!\" this hurts my feelings.\ni never thought i was out of line to strike up a friendly conversation with a stranger on the bus. why are people so rude? often hurt",
    "title": "A POINTED REMINDER ABOUT HOW CROWDED IT'S GETTING",
    "topic": "Rudeness",
    "year": 1985,
    "month": 9,
    "day": 12
  },
  {
    "FIELD1": 7,
    "id": 16,
    "letterID": 16,
    "text": "a very dear friend of mine is having an affair with a married man. she divorced her husband of 14 years to be free for \"joe.\" joe lived with my friend for a few months, then moved back home because his children \"needed\" him. joe goes to my friend's place three or four mornings a week for coffee and sex. the rest of the time he is with his wife. joe has given my friend some expensive gifts and takes her on some business trips, which is all she lives for. she's beautiful and smart and has everything going for her. i've tried to tell her she's wasting her time, but she says she loves joe and he's worth waiting for.\ni know you get lots of letters from women who are waiting for married men to leave their wives. can you send me a few dozen? if i show them to my friend, she may see the light. thanks.\nall talked out in dallas",
    "title": "LETTERS WOULD NOT SPELL END TO FRIEND'S AFFAIR",
    "topic": "Misbehavior",
    "year": 1985,
    "month": 9,
    "day": 18
  },
  {
    "FIELD1": 8,
    "id": 18,
    "letterID": 18,
    "text": "a long-time friend, whom i love dearly, is due to come soon for her annual two-week visit.\nin the past, we have learned to live with each other's idiosyncrasies in order to preserve our friendship, but something occurred on her last stay that i don't think i can put up with again. i love cats, and wish i had a dozen, but i have only one, \"whiskers,\" whom i adore. my friend (i'll call her carolyn) hates cats. on her last visit, i saw her actually kick whiskers out of her way.\nafter i had told her that whiskers was not allowed to go outside because coyotes had killed several small pets in my neighborhood, she deliberately left my back door wide open several times!\ni was so shocked by carolyn's behavior, i couldn't even confront her about it. i feel guilty letting her come again, because i really don't want her here knowing she might abuse whiskers while my back is turned. worse yet, leave the door open. how should i handle this sticky problem? whiskers' mama",
    "title": "LETTERS FROM HOME WOULD BE WELCOME GIFT FOR MARINES IN FOREIGN LAND",
    "topic": "Rudeness",
    "year": 1985,
    "month": 9,
    "day": 27
  },
  {
    "FIELD1": 9,
    "id": 52,
    "letterID": 52,
    "text": "i am a 14-year-old girl. i have a great family and i love them dearly. the thing i want most is to have my parents trust me. one incident made me feel i lost their trust completely. here it is:\nmy parents went out one evening and told me i could have three friends over (my best girlfriend and two boys). i agreed to stay in the house with my guests. later when my friends arrived and my parents were gone, the incident happened.\nwhile my girlfriend and i were talking in my bedroom, the two boys got into my parents' liquor cabinet. they were having some drinks when my parents walked in.\ndad handled it very well. he took me aside and said, \"i think it's time for your friends to leave.\" as i looked at my dad i could see on his face how very disappointed he was in me. i felt just awful! later we talked about what happened very briefly.\nthe next weekend my parents had planned to go out of town, but they canceled the trip, saying, \"we don't think we can trust you to be by yourself.\"\ni quickly reminded them that it wasn't me who got into the liquor cabinet. then they said (unconvincingly), \"well, we can't trust your friends, then.\"\nabby, why should my parents make me feel like they don't trust me? it was my so-called friends they couldn't trust. please tell moms and dads to trust their children until they prove to you that they can't be trusted. trustworthy daughter",
    "title": "IF GUESTS DRAIN CREDIBILITY IT'S THE TEEN HOST'S ERROR",
    "topic": "Misbehavior ",
    "year": 1986,
    "month": 8,
    "day": 28
  },
  {
    "FIELD1": 10,
    "id": 62,
    "letterID": 62,
    "text": "i have a friend whose dog is sick and growing feeble, and will soon have to be put to sleep.\nhe has had the dog for 13 years and is very attached to her. when his pet dies, what expression of my sympathy would be appropriate?\nthis truly concerns me. i want to show my friend how much i care about his loss, but i don't want to come across as foolish or overreacting. his friend of many years",
    "title": "FLOWERS OR A CARD FOR PET'S MOURNER",
    "topic": "Death",
    "year": 1987,
    "month": 2,
    "day": 20
  },
  {
    "FIELD1": 11,
    "id": 64,
    "letterID": 64,
    "text": "three days before christmas the daughter of a very close friend died suddenly. my friend (i'll call her mary) and her husband have always gone to florida between christmas and new year's, so i assumed that they had gone there. imagine my shock when i heard the terrible news 10 days after their daughter's funeral!\nseveral of mary's very close friends are also my friends, and not one of them called to tell me about the death or the funeral! i was totally shocked when i learned too late to help and comfort mary during her tragic ordeal.\nshe is such a giving person herself that i feel cheated for not having been notified.\ni could have carried meals to her and helped out in many ways had i only known.\ni am furious with our mutual friends for not calling me. i suppose each one assumed someone else had told me, but when i didn't show up at the funeral, wouldn't you think someone would have called to find out why i wasn't there?\nplease tell your readers that if they hear of a death or illness in a family, to call everyone they think would want to know.\nso what if they already knew? they'd thank you for thinking about them.\ni'm sure i'm not the first person this has happened to.\nwe don't have to get out the horse and buggy and travel 20 miles to reach our friends--let's use that wonderful invention, the telephone.\nhurt and angry",
    "title": "BAD NEWS DOESN'T ALWAYS TRAVEL FAST",
    "topic": "Misbehavior",
    "year": 1987,
    "month": 3,
    "day": 8
  },
  {
    "FIELD1": 12,
    "id": 69,
    "letterID": 69,
    "text": "after 15 years, i am ending a friendship. why? because when i go out with my \"friend,\" she is always short of cash, and i end up paying part or all the tab.\nyesterday, my friend was short again. would i buy the tickets for the movie so she (who had skipped dinner) could buy some food at the concession stand? i paid. then, short of money at the concession stand, would i give her a couple of dollars so she could eat? i paid. afterward, her car needed gas. she just sat there waiting for me to offer. i didn't. her checkbook was in her \"other\" purse. i was outraged.\nabby, this scenario has repeated itself innumerable times. yes, i have reminded my friend of how much she owes me, but never, never has she repaid me one cent over the years.\nlast night was the last straw. i just made up my mind that i could not afford to treat her every time we were together. she earns as much as i, but she's always \"short.\" i have lost all respect for her. and from now on when she calls and asks if we can \"get together\" for a movie, lunch, dinner or a night out, i am going to be \"busy.\" am i wrong? fed up in minneapolis",
    "title": "CASH SHORTAGE' ENDS FRIENDSHIP",
    "topic": "Misbehavior",
    "year": 1987,
    "month": 5,
    "day": 15
  },
  {
    "FIELD1": 13,
    "id": 70,
    "letterID": 70,
    "text": "i have never smoked, and i am very sensitive to cigarette smoke. many of my friends are smokers, but i don't allow anyone to smoke in my car or house.\ni'm planning a party in my home for about 20 people. it will be wintertime, and i do not have a separate room that could be set aside for smoking. abby, i cannot bear the thought of my house, draperies, rugs and furniture smelling of smoke for days afterward!\nsome of my friends have indicated that they would not attend my party if they weren't permitted to smoke.\nis it unreasonable of me to maintain my long-standing no-smoking rule? red-eyed in indiana",
    "title": "SPELL OUT RULES FOR BABY-SITTER",
    "topic": "Rudeness",
    "year": 1987,
    "month": 5,
    "day": 23
  },
  {
    "FIELD1": 14,
    "id": 84,
    "letterID": 84,
    "text": "two years ago i decided to change my last name-legally. now i have a last name that is easy to spell, pronounce and remember. it cost me $60. i appeared before the judge, and it didn't take five minutes. i changed my name for business reasons because every day i had a hassle with people who couldn't spell, pronounce or remember it.\nanyway, i have a friend who has known me for several years, and every time i see her she brings up the fact that i changed my name. but she's not satisfied to just mention it-she wants to discuss it. out of the blue she will say, \"i can't believe you changed your name.\" i have told her several times why i changed it, but she refuses to drop the subject.\nlast evening, in front of a lot of people, she asked, \"what did your father think about your changing your name?\" i told her that my father thought it was a good idea because he had had the same problems with the name that i had, and he didn't blame me.\nwhat do you think of my friend and people like her who cannot get over the fact that a lot of people change their names? new name, fewer hassles",
    "title": "WHAT'S IN A NAME CHANGE? A LOT OF EXPLAINING",
    "topic": "Rudeness",
    "year": 1987,
    "month": 12,
    "day": 13
  },
  {
    "FIELD1": 15,
    "id": 88,
    "letterID": 88,
    "text": "i recently went on a short trip and asked a good friend and neighbor to water my plants. naturally, i gave her a key to my house. when i returned from my trip, someone told me that in my absence, this friend had taken several people through my house on a \"cook's tour,\" made coffee and entertained them in my home!\nneedless to say, i feel disappointed and betrayed that my \"friend\" would invade my privacy in this manner.\nam i being too sensitive about this unscheduled \"tour\"? it's weighing on my mind and has affected my friendship with her. how would you handle it? betrayed",
    "title": "WIFE'S INNER BEAUTY WAS SPECIAL",
    "topic": "Misbehavior",
    "year": 1988,
    "month": 1,
    "day": 4
  },
  {
    "FIELD1": 16,
    "id": 90,
    "letterID": 90,
    "text": "what should a hostess do when she has her dinner all prepared and set to go, and one of her guests greets her at the front door with: \"i brought the dessert for tonight. everyone just loves my lemon icebox cake.\"\nabby, i made your chocolate mousse and it was ready to serve in individual parfait glasses. i won't tell you how i handled it. how do you think i should have handled it? don't tell me my friend meant well and should have asked in advance if she could bring the dessert. i know she should have- but she didn't. frosted in phoenix",
    "title": "ATHEIST OBJECTS TO RELIGION FOR KIDS",
    "topic": "Rudeness",
    "year": 1988,
    "month": 1,
    "day": 29
  },
  {
    "FIELD1": 17,
    "id": 92,
    "letterID": 92,
    "text": "i'm 19 years old and have dated this one guy for three years. since that time, we've done nothing but fight over stupid things. i'm naturally very outgoing and i enjoy being around people, but in the last two years, all that's changed. my boyfriend is four years older than me and he hates to be around people. he's jealous and forbids me even to look at other guys in public. he accuses me of seeing other guys behind his back, even though we're together seven nights a week. he gets mad if i wear clothes that show my legs because he doesn't want any other guys to see them except him.\nhe doesn't have any friends, and doesn't want any. he has bruised my arms, torn my clothes and called me every dirty name in the book. when he gets upset about anything, he takes it out on me, but for some crazy reason, i love him.\nwe are supposed to get married in march, but my friends tell me i'll make the biggest mistake of my life if i marry this guy. what do you think? second thoughts in moline, ill.",
    "title": "1-CENT PHONE BILL SEEMS RIDICULOUS",
    "topic": "Jealous partner",
    "year": 1988,
    "month": 2,
    "day": 10
  },
  {
    "FIELD1": 18,
    "id": 97,
    "letterID": 97,
    "text": "i just finished reading the letter from the 19-year-old girl who signed herself \"second thoughts in moline, ill.\" abby, i could have written that letter myself. i'm also 19, have gone with a guy for nearly three years and we plan to be married soon, but i, too, have second thoughts for the same reasons. he's jealous, doesn't trust me, accuses me of going out with other guys, and we fight a lot about stupid things. i like people and enjoy having friends, but he always wants to be with me alone. lately he has cursed me, accused me of going out on him and has hit me. then he cries, begs me to give him another chance and swears he'll never do it again, but he does.\nmy friends tell me i'll be sorry if i marry him, but, abby, i truly love him. can you tell me why women go right on loving guys who treat them like dogs? second thoughts in texas",
    "title": "A SECOND LOOK AT ABUSIVE FIANCE",
    "topic": "Jealous partner",
    "year": 1988,
    "month": 4,
    "day": 18
  },
  {
    "FIELD1": 19,
    "id": 98,
    "letterID": 98,
    "text": "my fifth high school reunion is coming up soon and i want very much to go, but here's the problem: i met \"bob\" years ago while i was on vacation and we were married a year later.\nwe now live in a small town 600 miles from my hometown. bob grew up here, where the boys and girls never mixed much, and he is outrageously jealous if i as much as smile at another man.\nwe have had incidents already where he had no reason to be jealous, but he has been. i know that if i were to hug a male classmate, or even touch him, bob would make a scene. (he could not understand our graduation pictures-with boys and girls holding hands in a semicircle. \"touching\" to him is off- limits.)\nwe have a good marriage, but i must be on my guard constantly so bob won't get the wrong idea. he won't let me go to the reunion without him, but the first \"do you remember?\" is sure to send him into a jealous rage that could even end in divorce! he is no. 1 in my life, but how can i make him understand that these schoolmates are only friends? torn in two",
    "title": "HUSBAND'S JEALOUSY PERILS REUNION",
    "topic": "Jealous partner",
    "year": 1988,
    "month": 5,
    "day": 2
  },
  {
    "FIELD1": 20,
    "id": 102,
    "letterID": 102,
    "text": "this is not a terribly serious problem, but i would like an opinion from you, and maybe some of your readers would like to comment.\nseveral of my friends have the \"call-waiting\" service on their telephones. (i have not.)\nrecently, my friend \"joyce\" (not her real name) called me. all she said was, \"hello. how are you?\" then, before i could even answer her, i heard her \"call waiting\" signal beep. she immediately said, \"oh, somebody is trying to get me-i'll call you right back.\" then she hung up on me.\nabout 15 minutes later when joyce called back, i told her i thought she was extremely rude to have cut me off and taken the call from the other party. i said, \"since you called me, you could have put me on 'hold' for two seconds while you told the other party you were talking to someone and would get back to him.\" i also told her she made me feel like i was second choice-that she was hoping someone more interesting was on the other line.\nto my surprise, joyce wasn't angry with me for telling her off. she agreed with me and apologized.\nwhat are your thoughts on this, abby?\nsecond choice",
    "title": "CALL-WAITING LEADS TO FRIENDLY STATIC",
    "topic": "Rudeness",
    "year": 1988,
    "month": 6,
    "day": 17
  },
  {
    "FIELD1": 21,
    "id": 105,
    "letterID": 105,
    "text": "when i go out to eat, i never know how much to tip. when i ask my friends, they become annoyed. one said, \"why don't you write to dear abby?\" embarrassed in pittsburgh",
    "title": "EXPLOITED WOMAN IS TIRED OF BEING THE 'NICE GUY'",
    "topic": "Etiquette",
    "year": 1988,
    "month": 8,
    "day": 14
  },
  {
    "FIELD1": 22,
    "id": 112,
    "letterID": 112,
    "text": "i am a 15-year-old boy and a sophomore in high school. i have many friends and i recently heard a rumor about one i care for. someone told me that he is homosexual. i really don't want to be swayed by rumors, but i don't know how to ask him if it's true.\ni have nothing against gay men, but i don't want to make the mistake of giving him the idea that i am interested. what should i do? troubled in tucson",
    "title": "POEM DISARMS LONGTIME BIRD HUNTER",
    "topic": "LGBT",
    "year": 1988,
    "month": 10,
    "day": 1
  },
  {
    "FIELD1": 23,
    "id": 121,
    "letterID": 121,
    "text": "every year for the last several years i have asked my friend \"zelda\" to join my family and a few close friends for thanksgiving dinner. zelda is a kind, considerate, unmarried woman who is treated rather coolly by the women and is ogled by their husbands. she doesn't understand the problem-but i do. as my husband puts it, \"she dresses like a streetwalker.\" her clothes are too tight and her necklines are too low. i have seen her in more modest attire-but not often.\nabby, what do you make of her behavior? she is quite defensive when advice is proffered (on any subject). she is a wonderful friend and i don't want to hurt her feelings, but i wish i could tell her how others perceive her manner of dress.\ndo you have any ideas? maybe one of your readers has had this problem and knows how to handle it. stumped in texas",
    "title": "It's hard to set friend straight",
    "topic": "Etiquette",
    "year": 1989,
    "month": 1,
    "day": 4
  },
  {
    "FIELD1": 24,
    "id": 124,
    "letterID": 124,
    "text": "i am beside myself with guilt. on the last night of my visit to a childhood friend who now lives in another city, her live-in boyfriend woke me in the middle of the night, and i let him make love to me. as far as i can tell, my friend had no idea (he left her sleeping in their room). i don't know why i didn't stop him-especially since we used no protection and i could have even gotten pregnant! maybe i was lonely or resented her having someone since i've been unlucky in love.\nthe next evening, when we were alone for a minute or two, i told him i felt guilty over what had happened. he seemed to feel the same, and told me that he liked me and he enjoyed it, but we should not repeat it.\ni tried to act normal with my friend, but felt miserable inside. i've betrayed her trust and don't deserve her friendship. also, i am aware that the man she loves and hopes to marry would cheat on her in such a low way-with her friend, in her house!\nshould i tell her? what if he tells her later? what if they decide to marry-shouldn't she know the truth about this man? he played the field earlier in their relationship, but she believes he's true to her now. what if i'm pregnant?\nabby, i am ashamed to admit that i was flattered by his coming to me-but i am more ashamed of having betrayed a friend. i don't want to tell her to hurt her, but i don't want to lose her friendship if she finds out later. what should i do? feeling rotten",
    "title": "Straying boyfriend creates problem",
    "topic": "Misbehavior",
    "year": 1989,
    "month": 1,
    "day": 30
  },
  {
    "FIELD1": 25,
    "id": 126,
    "letterID": 126,
    "text": "i have a big problem that is getting worse with time. i have a friend i've known for four years. within the last year, her husband has been making advances toward me. this is not just my imagination. i know when a man is coming on to me. (i am not married.)\nif i stay away, my friend is going to ask me why i don't come over anymore. what should i do? friendship in danger",
    "title": "Battered husband tells his story",
    "topic": "Misbehavior",
    "year": 1989,
    "month": 3,
    "day": 8
  },
  {
    "FIELD1": 26,
    "id": 133,
    "letterID": 133,
    "text": "i recently lost my beloved husband after 42 years of marriage. this was difficult enough, but some of my friends and neighbors act as though i not only lost my husband, but my mind as well.\nthey are constantly giving me advice about what to do with my husband's business and my large home. i know they mean well, but i have two wonderful grown children who are sensible and intelligent. i also have a good lawyer, and if i feel i need advice on how to take care of my business, i'll go to these people.\nso far, i have listened patiently to all this unasked-for advice, but my patience is wearing thinner and thinner. is there a diplomatic way to handle this? a sad widow, not a stupid one",
    "title": "Silence is the best policy",
    "topic": "Communication",
    "year": 1989,
    "month": 5,
    "day": 25
  },
  {
    "FIELD1": 27,
    "id": 134,
    "letterID": 134,
    "text": "i recently had an interesting discussion with a friend concerning this question: would it be in poor taste to take a friend out for dinner on her birthday and use a two-for-one coupon? (buy one dinner, get the second dinner free.)\ni said i thought it would be extremely tacky because the hostess would not really be treating her friend to dinner if she got the dinner for free.\nmy friend says, \"it doesn't matter that a two-for-one coupon was used. it's the thought that counts.\"\nwhat do you say, abby? confused in cleveland",
    "title": "Friendship screeches to a halt",
    "topic": "Etiquette",
    "year": 1989,
    "month": 6,
    "day": 14
  },
  {
    "FIELD1": 28,
    "id": 137,
    "letterID": 137,
    "text": "i need your advice on how i (a mother-in-law) should handle the following problem: our son and daughter-in-law were married in august 1988. to this date, my friends have been calling me to inquire as to whether their wedding gift was received.\nthis is very embarrassing. i have questioned our son on a couple of occasions where money was the gift, and he told me those gifts have been acknowledged.\nhow should i answer my friends? embarrassed parents",
    "title": "Mate's",
    "topic": "Etiquette",
    "year": 1989,
    "month": 7,
    "day": 17
  },
  {
    "FIELD1": 29,
    "id": 139,
    "letterID": 139,
    "text": "i can't believe i'm writing this, but i'm really upset and need your help. when we had finals at school, i did one of the dumbest things ever: i gave a lot of the answers to a friend i'll call lisa.\nmy friend knew how uncomfortable i felt doing this, but she kept pressuring me until i gave in. that wasn't the first time she pushed me into doing something i really didn't want to do.\nwell, the next day, our teacher called us both in and told us that he knew what we had done, so he was giving us both f's, which brought my hard-earned a down to a c!\nhe then asked lisa if she had pressured me into giving her the answers, and she lied, saying, \"no, i just asked for a little help, and she gave me some.\"\nbefore this happened, all my grades were mostly a's and a few b's. this f is really going to bring down my grade-point average.\nalso, the man who teaches this class is my favorite teacher, and he said i really let him down. how can i earn back his respect? sorry, sorry, sorry",
    "title": "Giving away exam answers teaches student a hard lesson about honesty_and `friends'",
    "topic": "Misbehavior",
    "year": 1989,
    "month": 8,
    "day": 13
  },
  {
    "FIELD1": 30,
    "id": 140,
    "letterID": 140,
    "text": "this problem may seem insignificant to you, but it's important to me. when i was in byrd high school in shreveport, la., in the '60s, i loved to dance the \"twist.\" i spent every weekend at dances, and as soon as the music began, i couldn't control my feet. toes tapping, fingers snapping-up and away onto the dance floor to twist the night away.\nmy friends tolerated this compulsive behavior and nicknamed me \"louie the twister.\" it was laughable when i was in high school, but what would they say now, knowing that i still can't stop twisting when the music starts?\nmy 25th high school reunion is coming up, and i want to go to the dance and see my old classmates. however, i'm embarrassed to say that i haven't changed my style of dancing; i still love to do the twist. should i go and risk humiliation? or stay in pensacola in the safety of my home? louie the twister",
    "title": "Korean",
    "topic": "Odd",
    "year": 1989,
    "month": 8,
    "day": 14
  },
  {
    "FIELD1": 31,
    "id": 143,
    "letterID": 143,
    "text": "my husband has a terminal illness. the doctor said they don't know how long he'll last. would it be proper for me to wear a large black picture hat with a wide brim and a black sheer veil over it for his funeral? my friend says veils are worn only with small hats, but i am a large woman and don't look good in small hats. also, could i wear a black tailored gabardine suit with a green and blue flowered blouse? or must i wear all black? if i wear all black, would it be all right to wear one large piece of costume jewelry? and if i wore black hose and black gloves, would people think i was overdoing it? preparing ahead",
    "title": "Child's birth deserves best wishes",
    "topic": "Etiquette",
    "year": 1989,
    "month": 8,
    "day": 23
  },
  {
    "FIELD1": 32,
    "id": 146,
    "letterID": 146,
    "text": "when i call my friend on the phone, one of his children (ages 15 and 17) usually answers. in answer to my request to speak to their father, i am always asked, \"may i ask who is calling, please?\"\nthis really rubs me the wrong way because i figure the child has no business knowing who is calling. it comes across as being rude and nosy.\ni know this is not intended, so i asked my friend if his children have been instructed to do this as a form of \"screening\" his calls. he said, \"no. it's because callers often do not leave messages; therefore i've instructed my children to get their names right away.\"\nabby, i think this is faulty reasoning, because callers have every right not to leave a message if they choose.\nin answer to the question, \"is your dad in?\" i think the appropriate answer should be either, \"yes. just a minute, i'll get him,\" or, \"no, would you care to leave a message?\"\ni've explained to my friend twice that i find his present answering procedure offensive, but nothing has changed. it is so upsetting to me that i now hesitate to call him at home. am i justified in being upset? and how would you suggest i resolve this? troubled in ontario",
    "title": "Senator attacks smelly magazines",
    "topic": "Rudeness",
    "year": 1989,
    "month": 10,
    "day": 17
  },
  {
    "FIELD1": 33,
    "id": 151,
    "letterID": 151,
    "text": "i was visiting at the home of an old friend yesterday afternoon when her teen-age granddaughter ran in-not to say, \"hello, grandma, how are you?\" or, \"what can i do for you?\" instead, she said, \"sorry i can't stay; i'm meeting some friends at the mall-i just came by to drop off my list.\" (it seems that \"sandra\" was disappointed with grandma's choice of gifts last christmas, so she made up a list of things she wanted-and didn't want-this year.)\nmy friend said: \"just a minute, dear. before you give me your list, i'd like to give you my list so you will know what i want and don't want for christmas.\"\nsandra looked shocked. then she said, \"gram, you know i don't have any extra money to spend on gifts for you, but if that's the way you're going to be, you can just forget that you ever had a granddaughter!\" and with that, she exited in a huff, slamming the door behind her!\nmy friend looked at me, smiling, and said: \"well, how did i do? i'm sorry you had to witness that, but i'm fed up with these grasping kids. i just had to put her in her place.\"\nany comment, abby? park avenue neighbor.",
    "title": "Two grandchildren, like day and night",
    "topic": "Rudeness",
    "year": 1989,
    "month": 12,
    "day": 24
  },
  {
    "FIELD1": 34,
    "id": 158,
    "letterID": 158,
    "text": "i did a terrible thing. i got mad at a friend and accused him of raping me. i didn't mean for it to go as far as it did, but my father got into the act and there was no backing down.\nmy friend is now serving time because he was too stubborn to plead guilty. if he had, he could have gotten out of it with a suspended sentence, but he refused.\nnow i can't sleep at night. i know i should have admitted that i lied, but i didn't have the guts. is there a solution to my problem? sick of lying.",
    "title": "Girl who cried rape in fact cried wolf",
    "topic": "Misbehavior",
    "year": 1990,
    "month": 6,
    "day": 15
  },
  {
    "FIELD1": 35,
    "id": 162,
    "letterID": 162,
    "text": "i want to clear up a common misconception that has resulted in many painful feelings.\nmy best friend is 17 years old. she's pretty and popular, and she's worn a pacemaker for two years that i know of. until people get to know her, they make rude comments like, \"my grandfather has one of those-what's wrong with you? i thought they were only for old people.\"\nthis has caused a great deal of pain for my friend. i just wish you'd tell people that pacemakers aren't such a horrible thing. my friend is able to run, dance, swim and do everything i can do. a friend in pittsburgh",
    "title": "Sowers of good deeds reap better health",
    "topic": "Rudeness",
    "year": 1990,
    "month": 10,
    "day": 4
  },
  {
    "FIELD1": 36,
    "id": 163,
    "letterID": 163,
    "text": "recently at an amusement park, i noticed a group of people waiting in the middle of a line, when one of them broke in. by the time we were even with them (it was a double, divided line), they had all broken in at that spot. when the lines merged, my group was in front of them. then, one of them crowded in ahead of us. soon all of them tried to push in.\nthinking they did not understand that this is rude, i began to politely explain, asking if they felt that we had crowded in front. \"no, but one of our party is ahead of you,\" was the reply, \"so we can all go.\" any further explanation from me was met with anger and insults.\nabby, i always thought that latecomers should go to the end of the line and wait their turn. if i am joined by a friend, instead of causing hostility by letting my friend in, i give up my place in line and join my friend at the end.\nwas i out of line?",
    "title": "Faltering dieter heeds word to wise",
    "topic": "Rudeness",
    "year": 1990,
    "month": 11,
    "day": 18
  },
  {
    "FIELD1": 37,
    "id": 169,
    "letterID": 169,
    "text": "maybe you can shed some light on a problem that has been bothering me. can you tell me why my husband, who is nearly 70 (but in excellent health), has in recent years become more and more \"allergic\" to soap and water?\nmany of my friends of approximately the same age have confided to me that they have the same problem with their husbands. is there a psychological or physiological explanation for this behavior -- or is it just another way men have of aggravating their wives? -- columbus, ga.",
    "title": "Wife Says 'Cut' to Husband's Insistence That He Film Sex",
    "topic": "Odd",
    "year": 1991,
    "month": 10,
    "day": 13
  },
  {
    "FIELD1": 38,
    "id": 1170,
    "letterID": 1170,
    "text": "one of my dear friends is pregnant with her first child, and she couldn't be more excited. even though she's only in her second trimester, her \"baby bump\" is conspicuous, and it seems people (friends, family and complete strangers) can't help but comment that she seems \"ready to pop.\" when they learn she still has many weeks to go, invariably people ask if she's having twins (she's not). her grandmother went so far as to ask for ultrasound photos to prove she's carrying only one baby.\nit has made my friend very self-conscious. even though she's in perfect health, the comments are really getting to her. any advice on how to graciously deflect these unwanted comments? -- no twins in the twin cities",
    "title": "Expectant Mom Is Startled by Invasive Questions",
    "topic": "Rudeness",
    "year": 2016,
    "month": 9,
    "day": 7
  },
  {
    "FIELD1": 39,
    "id": 1171,
    "letterID": 1171,
    "text": "my friend \"virginia\" and i have known each other for 11 years. five years ago she went into renal failure and was on dialysis for three years. it was hard on her and she needed a kidney transplant. her three healthy siblings refused to be tested as a possible match.\nvirginia is on the young side, and she was in such a bad way i agreed to be tested. after several procedures it was determined i was a \"close enough\" match, so we decided to go for it. she was scared to death right before the surgery. i convinced her that even though things might be rough for a while, she would be glad she went through with it.\nit has been 18 months now, and i have not seen or heard from virginia since the day after the surgery. i called her a few times to make sure she was doing well. she never returned my calls and has completely dropped out of my life. she lives only four blocks away, so i know things are going ok for her. i figured i'd give her some space, but that space has turned into forever. i haven't heard from her family either. they visited virginia at the hospital, but didn't stop in to see me just three rooms away.\nhow could i have been so wrong about someone i knew for so long? my husband says virginia is an idiot and i should let it go. my therapist says i'll have to \"adjust to the injustice.\" i would have donated to a complete stranger without hesitation. but virginia wasn't a stranger. i never expected to lose my friend along with my kidney. can you please help me handle this? -- blindsided in new york",
    "title": "Donation of Kidney Ends With Loss of a Friendship",
    "topic": "Betrayal",
    "year": 2016,
    "month": 8,
    "day": 26
  },
  {
    "FIELD1": 40,
    "id": 1174,
    "letterID": 1174,
    "text": "i live in a city. many of my friends live in the suburbs within commuting distance. several of them commute daily, and there are many mass transit options running throughout the night. on a few occasions we have planned an outing in the city and, after the tickets are purchased, etc., one of them (\"carla\") has casually stated, \"i may need to spend the night at your house since it'll be late when we get back.\"\nabby, carla knows the schedule of mass transit and knows what we've planned. how do i respond when she invites herself to spend the night? i have the room, but it's still a hassle having someone stay overnight. -- city girl with country friends",
    "title": "Friend Invites Herself for an Overnight",
    "topic": "Rudeness",
    "year": 2016,
    "month": 8,
    "day": 2
  },
  {
    "FIELD1": 41,
    "id": 1179,
    "letterID": 1179,
    "text": "if i am standing in line waiting for a friend to arrive at a store that's about to open for a sale, when my friend arrives, is it ok for her to join me where i've been holding the spot, or should we move to the back of the line so customers behind us don't feel like she is butting in? -- no butts about it",
    "title": "Is Saving a Spot the Same As Cutting in Line?",
    "topic": "Etiquette",
    "year": 2016,
    "month": 6,
    "day": 14
  },
  {
    "FIELD1": 42,
    "id": 1180,
    "letterID": 1180,
    "text": "my friend \"sara\" invites herself and her two children over to play with mine from time to time. when it's time to have a snack or eat, she and her kids make themselves at home -- especially with the milk.\nabby, i work 70 hours a week. my children eat cereal often and love milk, but because of my schedule, i don't get a chance to go grocery shopping as often as i should. (i am a single parent.) how do i politely tell my friend that it's fine to make herself at home, but getting both of her children refills of milk without asking me is taking it too far? she knows i can afford it, but i'm uncomfortable asking because i don't know how to draw the line. -- working mom out west",
    "title": "Mom Short on Time Feels 'Milked' by Friend",
    "topic": "Rudeness",
    "year": 2016,
    "month": 6,
    "day": 5
  },
  {
    "FIELD1": 43,
    "id": 1181,
    "letterID": 1181,
    "text": "a friend of mine and his wife invited me out to dinner and i graciously thanked them. they are both employed. i live strictly on social security and pay 30 percent of my income for rent, barely making ends meet.\ni wanted to reciprocate, so i invited them over for a home-cooked meal. my friend came, but his wife is shy and didn't come. (i had a couple of other friends over.)\nif someone wants to reciprocate being taken out for dinner, isn't it acceptable to invite them over for a home-cooked meal or must they be taken out? -- tentative host in massachusetts",
    "title": "Home-Cooked Meal Is Perfect Payback for a Dinner Out",
    "topic": "Etiquette",
    "year": 2016,
    "month": 5,
    "day": 28
  },
  {
    "FIELD1": 44,
    "id": 1183,
    "letterID": 1183,
    "text": "i am sometimes invited to friends' birthday parties and, while i enjoy the celebration, i have one hang-up. when it's time to blow out the candles, sometimes my friends will blow real hard or even need more than one breath. (we're not exactly spring chickens.) to me, this is the equivalent of spitting all over the cake, and i can't bring myself to eat any after this display.\nwhat is a \"nice\" way of saying, \"i don't want any cake,\" without falling back on the old, \"i'm trying to lose weight,\" especially since other snacks and drinks are also being served? i don't want to be a ... party pooper",
    "title": "Birthday Cake Blowout Dampens Mood for Healthy-Minded Guest",
    "topic": "Etiquette",
    "year": 2016,
    "month": 5,
    "day": 8
  },
  {
    "FIELD1": 45,
    "id": 1194,
    "letterID": 1194,
    "text": "my friend \"steve\" is in his mid-20s and became a father a few months ago. he's happy and excited about it, and he's good with the baby. he has been living with the mother, \"nina,\" who is a few years older, for a while now. nina is also a friend of mine, and this is her second child.\nmy problem is that steve told me some time before his son was born that he thinks he is gay. he wants to wait until nina recovers from the pregnancy and finds a job before he tells her. i know he intends on being as big a part of the child's life as possible.\nas much as i don't want nina to be a single mother twice over, it doesn't seem good for her, steve or the children to stay in a sham relationship. how can he break the news to her in a way that won't jeopardize his chance to be a father to his son? -- concerned in west virginia",
    "title": "Gay Father Must Find Way to Share Son's Parenting",
    "topic": "LGBT",
    "year": 2016,
    "month": 2,
    "day": 1
  },
  {
    "FIELD1": 46,
    "id": 1195,
    "letterID": 1195,
    "text": "my friend of 25 years, \"violet,\" moved back to town a few months ago after living far away for the last 10 years. whereas we've always called and confided in each other often, now that she's here, i rarely see her, never talk with her and receive polite but curt refusals to do anything together.\ni know the move was stressful for her, and i suspect the problem is more about her than me. but i am really hurt, and i miss her. my last request to get together and talk was met with, \"i'm only doing what i feel i can enjoy and manage.\" it seems like that doesn't include our friendship.\nshould i simply leave my old friend alone, or is there something you can suggest? -- just plain sad",
    "title": "Old Friend Keeps Her Distance After Moving Back to Town",
    "topic": "Loneliness",
    "year": 2016,
    "month": 1,
    "day": 22
  },
  {
    "FIELD1": 47,
    "id": 1197,
    "letterID": 1197,
    "text": "i'm 14, starting my freshman year in high school and, of course, will be joining lots of clubs to prepare for college.\nmy best friend is gay, and when i asked her if she wanted to join any clubs together, she suggested the gay-straight alliance club. as a saved christian, i am unsure how to answer.\ni believe christians should treat homosexuals with kindness and respect. i believe also in same-sex marriage because of the legal protection it gives a couple. i respect my friend's decision, and i'm happy she's happy with her life. my family doesn't know how to respond either, though they have similar beliefs.\ni am afraid if my church found out, they would dislike me for joining, as well as question where i really stand as a christian. i feel conflicted about how to address both sides of my beliefs. can you help? -- caught in the middle in kentucky",
    "title": "Teen Weighs Impact of Joining School Gay-Straight Alliance",
    "topic": "LGBT",
    "year": 2017,
    "month": 8,
    "day": 19
  },
  {
    "FIELD1": 48,
    "id": 1199,
    "letterID": 1199,
    "text": "i am a gay man. my friend \"brian\" and i have known each other for 10 years. we dated for a while, but realized we are better off as friends. we have lived together for the past several years and are now considering getting married because my job has better benefits. my question is, is a marriage of convenience legal? -- going to the chapel?",
    "title": "Marriage of Convenience Would Come With Better Benefits",
    "topic": "LGBT",
    "year": 2017,
    "month": 8,
    "day": 4
  },
  {
    "FIELD1": 49,
    "id": 1201,
    "letterID": 1201,
    "text": "my fiancee and i had a party. a very good friend of mine came with her 4-year-old daughter, \"emma.\" it grew late and my friend wanted to stay for a while, so we put emma in our bed to sleep (the guest room was unavailable).\nafter going upstairs to get emma later in the evening, my friend came downstairs with emma and told us that the child had wet our bed. not wanting to make emma feel bad, we said it was no problem.\nmy friend did not strip the bed, offer to wash the sheets, or anything. she hasn't mentioned it since, and didn't follow up to make sure we were able to get the urine out of our bedding and the mattress. i find this to be incredibly rude and inconsiderate, but at the same time, what's done is done and there was no lasting damage. should i say something to my friend, or let it go? -- accident in the bedroom",
    "title": "Bed-Wetting Accident Gets Short Shrift From Child's Mom",
    "topic": "Rudeness",
    "year": 2017,
    "month": 7,
    "day": 11
  },
  {
    "FIELD1": 50,
    "id": 1204,
    "letterID": 1204,
    "text": "i've been in an extramarital relationship for 10 years. my husband knows, and so do my close friends.\ni love this man dearly, but neither of us want it to be full-time. i have children at home and don't want to disrupt anything. we meet once or twice a week. he touches base with me several times a day, and is attentive where my husband never was.\nmy husband isn't bitter about the relationship anymore. however, my two closest friends continually say, \"well, why lie to yourself? you know you just say you don't want things full-time so you don't drive him away,\" which isn't true. we have a great thing -- we travel, we have long discussions, and i can open up to him without any repercussions, bouncing ideas and thoughts off of each other without judgment or criticism.\nbut i really don't want this to be full-time. i enjoy it like i enjoy a good book and a glass of wine -- not every day, but an indulgence and a pleasure. it also feels good to hear \"i'm thinking of you\" first thing every morning and the last thing every night. i am flattered.\nit feels horrible that my two best friends can't understand that i give of myself to my community and my family and need something that is just for me. i have reached the point where i don't want to have these discussions with my friends anymore, so i avoid them. how can i get across to them that i'm fine and happy and content? -- just for me",
    "title": "Gal Pals Can't See Positives in Woman's Open Marriage",
    "topic": "Rudeness",
    "year": 2017,
    "month": 6,
    "day": 21
  },
  {
    "FIELD1": 51,
    "id": 1205,
    "letterID": 1205,
    "text": "hi. i have a problem. my best friend is moving away to a different state this summer. school is ending soon. she is my only friend, and i'm currently dating her brother. he's the only boy i like, and she is my only friend. i don't know what to do.\ni'll be in ninth grade in a couple of months, which means i'll have to start high school without a best friend or a boyfriend. what should i do? i'll be all alone. -- savannah in colorado",
    "title": "Teen Faces Starting High School Without Her Best Friend",
    "topic": "Loneliness",
    "year": 2017,
    "month": 6,
    "day": 1
  },
  {
    "FIELD1": 52,
    "id": 1207,
    "letterID": 1207,
    "text": "my friend has decided she can no longer tolerate my husband. she feels he doesn't \"respect\" her. this is far from the truth, in my mind.\nwe have supported her emotionally and financially from time to time for many years. my husband does have a habit of making clunky jokes (anything for a laugh or to fill the void). but a real friend should see beyond that to the loving, supportive person he is at his core, in his heart, and forgive.\nwe are now banned from her social group. i find this very harsh -- cruel even. i guess my friendship doesn't count, as i'm being thrown out with the perceived trash as well. i'm depressed and angry, and i want some kind of revenge and to hurt her back. i was so happy with our little group. now it's been taken away from me. advice? -- tossed aside in new york",
    "title": "Ex-Friend Cast Out of Social Circle Dreams of Vengeance",
    "topic": "Betrayal",
    "year": 2017,
    "month": 5,
    "day": 15
  },
  {
    "FIELD1": 53,
    "id": 1208,
    "letterID": 1208,
    "text": "i recently had a baby. two of my friends became mothers five and nine months ago. we are all first-time stay-at-home moms, which has been great except they constantly offer unwanted advice every time i see them and try to come off like they're experts. i agree that they sometimes offer helpful advice, but it's getting old because i'm becoming confident in my parenting skills and judgment. how do i politely let them know that if i want advice, i'll ask for it? -- unwanted advice in tennessee",
    "title": "Friends' Advice to New Mom Grows Old",
    "topic": "Communication",
    "year": 2017,
    "month": 4,
    "day": 29
  },
  {
    "FIELD1": 54,
    "id": 1211,
    "letterID": 1211,
    "text": "my ex-husband had an affair with a woman who was one of my dearest friends. my heart is broken; my marriage is over. i have lost my home and my friend. it has been a struggle for me to recover.\nmy daughter, with whom i am very close, continues to have a relationship with this woman. while i know it's not my place to tell her who to be friends with (she's 22), i can't help but feel betrayed.\nmy daughter is pregnant, and this woman seems to be attempting to play mother and push her way into every detail of my daughter's pregnancy. it's extremely upsetting to me to have to share one more thing with her. she already took my home and husband; i would like to keep my daughter and grandbaby. what to do? -- the real grandma-to-be",
    "title": "Ex-Wife's Anger at Her Friend's Betrayal Spills Over to Daughter",
    "topic": "Betrayal",
    "year": 2017,
    "month": 4,
    "day": 20
  },
  {
    "FIELD1": 55,
    "id": 1217,
    "letterID": 1217,
    "text": "i read your column all the time. my husband and i have been married for 35 years. my husband has good friends who are women, and i have never objected when he stayed with them when he traveled from our home to michigan.\none of the women he stays with called and they talked for hours. that's not right is it? my husband says she's just a good friend and it's only conversation.\nlike i said, i didn't mind him staying with her because i trusted him. but now i'm leery and suspicious. i don't believe it's a sexual thing, but a long conversation hurts me more because i thought i was his best friend.\ni told him, \"let's get counseling. if it doesn't work, we can divorce.\" he said, \"you're not going to stop me from talking to my friends.\"\nabby, i need your opinion. -- leery in florida",
    "title": "Gab Session With Gal Pal Leaves Wife Feeling Hurt",
    "topic": "Jealous partner",
    "year": 2017,
    "month": 3,
    "day": 8
  },
  {
    "FIELD1": 56,
    "id": 1218,
    "letterID": 1218,
    "text": "i have a friend in her mid-40s who has naturally dark hair she keeps cut short. it looked fine.\na few months ago, she bleached her hair platinum blond. she said she was going for a look that will include dark roots, but she has kept the roots platinum, so now her hair just looks white -- especially in pictures. she posted photos of herself with her boyfriend on facebook, and while i was scrolling down, my initial reaction was, \"who is that elderly woman he's sitting with?\"\na mutual friend commented to me how bad my friend's hair looks and how aging it is. should i mention to her that her hair color makes her look 20 years older? telling someone her hair doesn't look good can be hurtful, but if it were me, i'd want to know. -- helpful in hawaii",
    "title": "Friend Going for New Look Now Looks 20 Years Older",
    "topic": "Etiquette",
    "year": 2017,
    "month": 3,
    "day": 5
  },
  {
    "FIELD1": 57,
    "id": 1220,
    "letterID": 1220,
    "text": "my fiance and i are getting married in a year. we have some very close gay friends, and i have gay family members on my mom's side. the majority of our family is gay-friendly, but a few of them on my father's side are very open about their dislike of the lgbt community.\nour ceremony will be at a unitarian universalist church because we love that they are supportive of the lgbt community and want everyone to feel comfortable and accepted on our big day. i'm terrified that my family members will do or say something to hurt or offend guests at our wedding who have same-sex partners.\ni am considering putting a note on my wedding website that our wedding will be a celebration of love, and to please set aside political and personal beliefs and accept every one of our guests during this happy occasion. would this be appropriate? i don't know how else to convey the message that we will not tolerate any hateful or offensive remarks or actions against our loved ones. -- bride for marriage equality",
    "title": "Bride Wants Wedding Guests to Check Politics at the Door",
    "topic": "LGBT",
    "year": 2017,
    "month": 2,
    "day": 18
  },
  {
    "FIELD1": 58,
    "id": 1221,
    "letterID": 1221,
    "text": "one of my best friends just got engaged and i'm invited to the wedding. my problem is, my ex-best friend is in the bridal party, and i don't know how to act if i see her and have to talk to her. she terminated our friendship without giving me a reason. not only that, she has been spreading lies about me to mutual friends, some of whom now refuse to talk to me.\ni have no idea what i did or didn't do. no one knows why she is spreading rumors, and i don't want there to be drama at my friend's wedding and bachelorette party. what can i do? -- unsure in the west",
    "title": "Wedding Is Not the Stage for Ex-Best Friends' Drama",
    "topic": "Betrayal",
    "year": 2017,
    "month": 2,
    "day": 6
  },
  {
    "FIELD1": 59,
    "id": 1225,
    "letterID": 1225,
    "text": "i have had a best friend for more than 20 years. we met when we were 18 and have been inseparable ever since. i was best man in his wedding, and when his first child was born, i traveled six hours to be at the hospital when \"sara\" was born. i have never missed a birthday or christmas.\nwhen my friend announced they were moving from ohio to arizona, i knew i couldn't be away from him and his family, so i moved as well. i have no family of my own, and i adore his two girls.\nwell, sara turned 13 this year and like most teenagers, she's distancing herself from her family and even more so from me. when her mom and dad invite me for dinner or a family get-together, she barely acknowledges me when i say hi or ask how she's doing. she wants nothing to do with me. it breaks my heart. i love her and i consider her to be family.\nmy question is, should i continue to go and support her with her sporting events at school? (i have never missed a game.) do i continue to shower her with birthday and christmas gifts?\non one hand, i tell myself this is just a phase she is going through and to change nothing, hoping one day she realizes that i'm her biggest cheerleader and recognizes the love i have for her. on the other hand, i think she's acting like a spoiled brat, and if she doesn't know how to treat people, then i want nothing to do with her. how should i handle this? -- un-uncle in arizona",
    "title": "Longtime Family Friend Feels Hurt by Sulky Teen's Attitude",
    "topic": "Odd",
    "year": 2017,
    "month": 1,
    "day": 23
  },
  {
    "FIELD1": 60,
    "id": 1226,
    "letterID": 1226,
    "text": "i have an unusual problem. i'm very accident-prone. over the past several years i have been in a cast many times, sometimes for long periods. my friends constantly tease me about it when what i'd really appreciate is a little compassion and maybe a little help while i am recovering. how do i let these people know that their teasing is hurtful? -- wendy in california",
    "title": "Admitted Klutz Could Use More Sympathy From Friends",
    "topic": "Rudeness",
    "year": 2017,
    "month": 1,
    "day": 17
  },
  {
    "FIELD1": 61,
    "id": 1228,
    "letterID": 1228,
    "text": "my friend \"russ\" is a sweet, quiet, reserved guy with a goofy side. he's in his mid-20s, but has never kissed a girl or gone out on a date. (he is the kind of person girls regard as a brother figure.) he has no confidence and doesn't drink, dance or let loose. i have seen his dating profiles, and they are brutally unappealing.\ni want to help russ find someone before it's too late. i hate seeing him lonely. he needs someone to give him a chance and help him learn to be more confident. i know it's wrong to try to change someone, but i feel if he doesn't get some help, no one will ever give him the time of day. he needs a sense of adventure and, frankly, a change of wardrobe.\nhow can i help this \"good boy\" get the attention of the ladies? -- amanda in wyoming",
    "title": "Shy Guy Needs Some Help Putting Best Foot Forward",
    "topic": "Lovelife",
    "year": 2017,
    "month": 1,
    "day": 14
  }
]
