[
  {
    "id": 0,
    "answer_only": "",
    "day": 16,
    "month": 4,
    "q_and_a": "I am a young divorcee with three children. A very lonely professional man lives across the street from me. He is married to a woman who stays on drugs most of the time. We have been seeing each other almost every night. He says his wife is an addict of her own free will, and it is a  nightmare living with her. Sometimes she doesn't comb her hair for days. He's lost all respect for her. He wants to marry me. He deserves a full life and so do I. We decided to let the majority of your readers vote on what we  should do. %uFFFDGoldie Locks",
    "question_only": "I am a young divorcee with three children. A very lonely professional man lives across the street from me. He is married to a woman who stays on drugs most of the time. We have been seeing each other almost every night. He says his wife is an addict of her own free will, and it is a  nightmare living with her. Sometimes she doesn't comb her hair for days. He's lost all respect for her. He wants to marry me. He deserves a full life and so do I. We decided to let the majority of your readers vote on what we  should do. %uFFFDGoldie Locks",
    "source": "",
    "theme": "",
    "title": "I WANT TO MARRY MY NEIGHBOR BECAUSE HIS WIFE IS ON DRUGS",
    "year": 1962
  },
  {
    "id": 1,
    "answer_only": "Wait another 15 years. When she is 30 and you are 60, you will be only twice as old as she is.",
    "day": 16,
    "month": 4,
    "q_and_a": "I am a man who is 45 years old. I am thinking about marrying the girl who keeps house for me, but she is only 15. Do you think I am crazy to think of marrying a girl when I am three times older than she is? Wiley.  Dear Wiley: Wait another 15 years. When she is 30 and you are 60, you will be only twice as old as she is.",
    "question_only": "I am a man who is 45 years old. I am thinking about marrying the girl who keeps house for me, but she is only 15. Do you think I am crazy to think of marrying a girl when I am three times older than she is? Wiley.",
    "source": "",
    "theme": "",
    "title": "I WANT TO MARRY A 15 YEAR OLD GIRL",
    "year": 1962
  },
  {
    "id": 1,
    "answer_only": "",
    "day": 16,
    "month": 4,
    "q_and_a": "Will you please say something in defense of we women who always seem to get in on the ticket-selling part of club work? I personally have been stuck with tickets to sell for my church group, scouts, shrine doings%uFFFDjust name it and I've sold tickets for it. When my friends see me coming, they say, %uFFFDWell, Betty. How much is it this time?%uFFFD Don't people realize that I sell tickets for worthy causes and not for my own benefit?  --Tickets to Sell",
    "question_only": "Will you please say something in defense of we women who always seem to get in on the ticket-selling part of club work? I personally have been stuck with tickets to sell for my church group, scouts, shrine doings%uFFFDjust name it and I've sold tickets for it. When my friends see me coming, they say, %uFFFDWell, Betty. How much is it this time?%uFFFD Don't people realize that I sell tickets for worthy causes and not for my own benefit?  --Tickets to Sell",
    "source": "",
    "theme": "",
    "title": "WHY DO WOMEN ALWAYS HAVE TO SELL CHURCH TICKETS?",
    "year": 1962
  }
]
