[
 {
   "letterID": 326,
   "topic": "Anniversaries",
   "title": "Isolated Woman in Apartment Is Itching to Get Small Dog",
   "text": "my wife and i just celebrated our 10th anniversary. our problem is that most people -- including our families -- think it was our sixth anniversary. we were married quietly because we were short of money. when we had enough saved up to have the wedding we wanted, we got \"married\" again, and didn't mention the first one. we felt that if people knew we were already husband and wife, they wouldn't view our ceremony and reception as special and might not attend.\nwe didn't really lie. we just never discussed our quiet marriage ceremony, and no one ever asked how long we've been married. when someone does ask, we don't hide the facts.\nabby, should we come clean? -- not quite truthful in georgia",
   "year": 1998,
   "month": 12,
   "day": 25
 },
 {
   "letterID": 459,
   "topic": "Anniversaries",
   "title": "Family Anniversary Party Is Grand Slam Celebration",
   "text": "my wife and i married on dec. 10, 1961. nineteen years later, our first daughter was married on dec. 10. three years after that, my son was married on dec. 10, and two years after that, our second daughter married on dec. 10. we think it's great. my wife and i are honored.\nthe most enjoyable thing about it is when we go out for our anniversary dinner together. the server asks, \"whose anniversary is it?\" and we all raise our hands! -- happy charlie in connecticut",
   "year": 2002,
   "month": 4,
   "day": 11
 },
 {
   "letterID": 854,
   "topic": "Anniversaries",
   "title": "Separated Husband Uncertain About Anniversary",
   "text": "next month will be our 25th anniversary. my wife and i are permanently separated, but will not divorce because she would lose health coverage under my employer's plan. how do i acknowledge this \"landmark\" -- or should i just ignore it, since it isn't really a celebratory event? -- not quite an ex in the south",
   "year": 2013,
   "month": 11,
   "day": 21
 },
 {
   "letterID": 623,
   "topic": "Anniversaries",
   "title": "Neglect Costs Dearly When Car Engine Goes Up in Smoke",
   "text": "please help my wife and me settle a dispute we have been having for the past few years. we have been married to each other twice. the first time was for six years. we divorced for three years, but eventually realized we were better off with each other and have now been happily remarried for 22 years.\nwhen we celebrate our anniversary, we cannot agree on the number of years to celebrate. in the case of our current anniversary, do we say we're celebrating 28 years (the total number of years we've been married) or just from the last wedding date, which would be 22 years? -- still confused after all these years",
   "year": 2008,
   "month": 9,
   "day": 21
 },
 {
   "letterID": 269,
   "topic": "Anniversaries",
   "title": "TOPLESS SWIM MAY COST HER A NEW CAR",
   "text": "how does one calculate a wedding anniversary? is it the number of years two people have been married to each other? or can it be the total number of years a person has been married to one, two and possibly three mates?\nthis is not a gag, abby. let me explain: my wife and i are both in our 70s, and neither of us is in the best of health. my wife was widowed twice. i lost only one mate after having been married to her for 21 years.\nmy wife recently realized that with more than 48 years of being married, she has never celebrated a 25th anniversary. to reach that point together, we have several years to go--and may not make it. however, if we add up all her married time, we will reach 50 years of marriage in 1996. is this an anniversary? can we celebrate with a party?\ngoing for the gold",
   "year": 1995,
   "month": 6,
   "day": 16
 },
 {
   "letterID": 173,
   "topic": "Divorce",
   "title": "Homeless People Are More in Need Than Homeless Pets",
   "text": "i have decided to end our marriage. the reason for our divorce is my wife's marital indiscretions. we are well known in town, and our family and close friends were utterly shocked when they heard the news.\nmy problem: i do not want anyone thinking that i have been a less-than-decent, caring husband and father. there was no wrongdoing on my part. my wife, although appearing to be a very decent, moral woman, chose to ignore her vows to \"forsake all others,\" if you get my drift -- and i think you do.\ni do not wish publicly to slander her, but mutual friends are treating me somewhat coldly because i initiated the divorce.\nat the present time, i am not speaking to my wife, which is perceived as being cruel; however, i feel that this is appropriate in light of her indiscretions.\nso, should i remain silent and try to ignore my friends' cold shoulders? -- mr. x",
   "year": 1991,
   "month": 8,
   "day": 9
 },
 {
   "letterID": 36,
   "topic": "Divorce",
   "title": "HIGH SCHOOL DROPOUT CAN COME OUT OF CLOSET",
   "text": "my wife and i want a divorce and see no reason why we should hire a lawyer. there are no children involved, and we have no property or money to fight over. so what do we need a lawyer for? or can't we get a divorce without one? enough is enough in maryland",
   "year": 1986,
   "month": 2,
   "day": 23
 },
 {
   "letterID": 704,
   "topic": "Driving",
   "title": "Back Seat Driver Is Turning Husband Into Nervous Wreck",
   "text": "my wife is a back-seat driver who seems to get more anxious every time we go anywhere together. she tells me to slow down, which lights to watch, which lane i should be in, which cars are braking, which ones are speeding, where the semi-trucks are if she thinks they're getting too close, and how to drive in various weather conditions. she'll move her foot to an imaginary brake on the passenger side, squirm in her seat and hang onto the handle above the passenger door while i'm doing my best to concentrate on my driving. it's very distracting.\nmy wife is not willing to drive when we're going somewhere, although i have offered to let her. she also refuses to sit back and relax because you can't control another person's driving. if i ignore her, she becomes irritated and says i'm not paying attention to her concerns. i have never had a serious accident and have had none in the past 15 years. what can i do about this? -- driven crazy in wisconsin",
   "year": 2010,
   "month": 11,
   "day": 28
 },
 {
   "letterID": 56,
   "topic": "Driving",
   "title": "NO PANTS' POLICY JUST SKIRTS THE ISSUE",
   "text": "my wife flashed your article on the aggressive male driver under my nose, and you played judge and jury after hearing only her side of it.\nsuppose i tell you that my wife is a backseat driver, and for 40 years she has been a nervous wreck in every car she rides in. she claims she is a better driver than me, but she refuses to drive because she's afraid of criticism.\nshe tells me how fast to drive, what lane to use and when to turn. she always asks me questions such as, \"why is that motorcycle so close to us?\" and, \"why is that truck in our lane?\" also, \"why are you speeding?\" (i am doing 56 miles an hour in a 55-mile zone.) she keeps turning the air conditioning on and off, while making the windows go up and down.\nshe's always yelling, \"look out!\" \"be careful!\" \"watch it!\" \"did you see that car?\" she is driving me bananas!\nnow i ask you, who needs counseling? hassled husband",
   "year": 1986,
   "month": 12,
   "day": 21
 },
 {
   "letterID": 357,
   "topic": "Driving",
   "title": "Complaint About Women Who Don't Drive Touches Raw Nerve",
   "text": "in my 66 years of life, i have never written to you, but i have to respond to the letter from \"widow driver,\" who complained about chauffeuring older women who don't drive.\nshe seems to think that a driver's license is obtainable by anyone who can guide an automobile without hitting too many obstacles.\nmy wife can drive a car to some extent. i taught her the basics in case of emergency. but when we went to the dmv to see about making it legal, she passed only the written test. when the eye test was administered, the examiner said, \"lady, you should not even walk on the road -- much less drive on it!\"\nso, while she can \"paddle her own canoe\" -- to use your phrase -- she cannot see where it is going. does \"widow driver\" want my wife approaching her grandkids' school crosswalk? i doubt it. -- lone driver, hillsborough, n.c.",
   "year": 1999,
   "month": 12,
   "day": 29
 },
 {
   "letterID": 399,
   "topic": "Driving",
   "title": "Message Sent by Car Ads Is Offensive to Safe Drivers",
   "text": "my wife and i are professional freight truck drivers. when a new auto ad comes on the air, we know we will see that kind of driving within 24 to 48 hours. people seem to think that if the driver in an ad can drive that way, they can, too. because it didn't happen in the commercial, they fail to take into account that their reckless driving could cause a crash! we see it all the time.\none ad showed a car pushing through three big rigs as it came on the highway, cutting off at least one of them and almost sideswiping another. the driver in the ad gets away with it! what kind of example does that set for teen-agers and new drivers?\nplease, everyone: drive in a defensive, courteous, legal, professional manner. the result will be safe and happy roads for all. -- henry a. pascoe, harp transport inc., snohomish, wash.",
   "year": 2000,
   "month": 6,
   "day": 12
 },
 {
   "letterID": 167,
   "topic": "Cards",
   "title": "Luggage Left Behind Is Lost for Good if I.D. Is Lacking",
   "text": "we have lived in this neighborhood for 35 years and we know almost all of our neighbors very well. as a retired man, i pass these homes two or three times a week on my walks. at christmastime, i drop off our christmas cards at the homes of our neighbors rather than go through the postal system.\nmy wife doesn't like that idea. one of our neighbors told another neighbor she thought we were cheap delivering our christmas cards that way. what we save in postage we give to the salvation army. i see nothing wrong with our means of distribution. the wife says, \"write to abby and ask her.\"\nso, i'm asking. -- cheap, or not?",
   "year": 1991,
   "month": 12,
   "day": 7
 },
 {
   "letterID": 702,
   "topic": "Cards",
   "title": "Man Sends Heartfelt Thank You to Mother He May Never Find",
   "text": "before she died last may, my wife ordered christmas cards with both of our names printed on them. should i send those cards, abby? it would comfort me to still have our names linked together. -- widowed in arkansas",
   "year": 2010,
   "month": 12,
   "day": 12
 },
 {
   "letterID": 809,
   "topic": "Cards",
   "title": "Wife Wants Son Out Of Grandparents' Holiday Photos",
   "text": "my wife thinks it's improper for my parents to include their grandson -- our 8-year-old son -- in their christmas card photo. he's their only grandchild.\ni have seen people include pictures of their pets, cars, boats and all sorts of other things in their photo cards. so why not grandchildren? my parents have pointed out that this is the only opportunity for their friends to see their grandchild, but my wife thinks he should be included only in our christmas card. what do you think? --pulled in two directions",
   "year": 2012,
   "month": 11,
   "day": 17
 },
 {
   "letterID": 224,
   "topic": "Cards",
   "title": "SENTIMENTAL HE IS NOT, THOUGHTLESS HE IS",
   "text": "this is in regard to the unhappy wife whose husband always gives her unsigned greeting cards on special occasions.\nhe sounds like my husband. one year, he gave me a birthday card with a $10 check in it. on the card he wrote, \"put this away for us to use on our vacation.\"\ncan anybody top this for cheapness?\nwondering",
   "year": 1993,
   "month": 8,
   "day": 22
 },
 {
   "letterID": 1080,
   "topic": "Parties",
   "title": "Party Guests Are Overwhelmed by Embarrassing Odor",
   "text": "my wife and i attended a party hosted by a well-respected couple who love to entertain. they have a spotless, beautiful home and are the essence of what you would hope to find in party hosts. upon our arrival, we were greeted at the door, but before we could step inside, the stench of cat urine overpowered us. it was overwhelming, and we have to assume that everyone else smelled it, too.\nmy wife and i are torn about what to do. we have great respect for this couple. they are pillars of our community.\ni say, to save future embarrassment, that an anonymous, carefully written note alerting them to this odor should be sent to them, saying that a problem \"may\" exist and providing them the opportunity to resolve the smell. my wife says absolutely not. your thoughts? -- feline blues in the midwest",
   "year": 2017,
   "month": 1,
   "day": 8
 },
 {
   "letterID": 294,
   "topic": "Parties",
   "title": "Couple on Party's 'B' List Have a First-Class Beef",
   "text": "my wife and i were invited to a party at the home of some old friends. they are very social, always attending parties -- but we have never entertained them, so we were surprised to receive their invitation.\nthe invitation read \"4 to 6 p.m.\" my wife and i arrived around 5 o'clock. we thought we'd see many of our old friends who are also friends of theirs. they have a huge home, and we were surprised to find only 10 other guests. they served hot cider and non-alcoholic punch -- that's all.\nwell, the next day i ran into one of those old friends who told me that he had attended the party and wondered where we were. i told him that we were there and had been one of the last to leave around 6 p.m. my friend said, \"we didn't get there until 7:30,\" and went on to describe the open bar, the fine wine, etc. -- none of which was offered when my wife and i were there.\ncan you believe how tacky? there were two different party lists, and my wife and i were placed on the dull and, yes, \"cheap\" one.\ni'd like to let the hosts know that we know about their slight and did not appreciate it, but we don't know how to do it without totally ruining the friendship. we'd appreciate your thoughts on this. -- ticked off in georgia",
   "year": 1996,
   "month": 2,
   "day": 25
 },
 {
   "letterID": 821,
   "topic": "Parties",
   "title": "Host Wants to Trim Tiny Terror From His Barbecue Guest List",
   "text": "my wife and i have thrown a barbecue for all our friends every summer since we were first married. over the last couple of years, our little party has morphed into a family-friendly event. our problem is one of our good friends is now the mother of an insufferable 3-year-old boy.\n\"fenton's\" behavior has been awful for two years. at the last party, he managed to throw our ipod, slam our stereo to the ground, pick up and throw another child and terrorize a gentle dog. he barged in on a nursing mother and refused to leave when asked. we also suspect he was the one who tore our baby gate off its hinges.\nthe mom is preoccupied with a new baby and deals with the situation by making idle threats. the dad makes jokes about how \"it sucks to be a parent\" and tells his kid to stop annoying him.\nwe're pretty sure if fenton returns for this year's party, many of our other guests won't. we want to remain friends with the mom, so not inviting her isn't an option. would it be out of line to ask her to leave her husband and the little terror at home? -- smokin' mad in pennsylvania",
   "year": 2012,
   "month": 8,
   "day": 14
 },
 {
   "letterID": 653,
   "topic": "Parties",
   "title": "Mom's Retirement Puts an End to Sons' Free Ride at Home",
   "text": "my wife and i recently attended a lovely party at a home with two baby grand pianos. one of the guests -- i'll call her \"sophie\" -- is an accomplished pianist, and she dearly wanted to sit down and play.\nwe encouraged her but she refused, stating that the host and hostess might not appreciate having their party interrupted. should sophie have asked permission, or would that have created undue pressure on the hostess? -- david in cupertino, calif.",
   "year": 2008,
   "month": 1,
   "day": 7
 },
 {
   "letterID": 739,
   "topic": "Parties",
   "title": "Teen With Diabetes Can Have an Occasional Treat",
   "text": "my wife and i threw a party for which we hired a bartender, so we could spend more time with our guests.\nwe figured that, in addition to his hourly rate, we would tip him at the end of the night. without consulting us, the man placed a plastic cup out for our guests to tip him. my wife was appalled and demanded that he remove it. he actually argued with her, but finally put the tip cup away.\nmy wife and i asked friends to weigh in on the subject. the men had no problem with the practice, while every woman found it offensive. were we too harsh? should a bartender at a private, in-home party be allowed to solicit tips from the guests? -- bar none in southern california",
   "year": 2010,
   "month": 2,
   "day": 22
 },
 {
   "letterID": 214,
   "topic": "Parties",
   "title": "Rudeness overshadows very real problem",
   "text": "the letter you published about \"ricardo\" and his wife, who was hurt because her husband attended a dinner party to which she was not invited because she did not speak fluent spanish (the hosts were bilingual and had enjoyed her hospitality), brought to mind a story about will rogers:\nit seems that a society matron gave a big party and invited will but not his wife. will went to the party alone and entertained the guests with his witty, humorous stories, after which he sent his hostess a bill for his services!\nthe society matron complained to will, saying hers was a social invitation, and he had been invited as a guest. will responded, \"oh? when i am invited to a social affair, my wife is also invited.\"\nricardo should learn such loyalty. j.b. in portland",
   "year": 1992,
   "month": 12,
   "day": 13
 },
 {
   "letterID": 452,
   "topic": "Parties",
   "title": "Caregiving Daughter Resents Dad's Attempts to Control Her",
   "text": "a co-worker sent me an invitation to a party celebrating her son's graduation from college. the envelope was addressed with a computer mailing label.\nthe party fell on a day i work, so i didn't even consider attending. i have never met the young man and have no social relationship with his mother. my initial reaction was to ignore the whole thing, but my wife thought i should send a gift of money as a matter of courtesy -- which i did.\nhere's the clincher: i received a thank-you note written in my co-worker's handwriting! what do you make of this, abby? -- perplexed in pennsylvania",
   "year": 2002,
   "month": 7,
   "day": 29
 },
 {
   "letterID": 410,
   "topic": "Parties",
   "title": "Mom Who's After Golf Pro May Get Stuck in the Rough",
   "text": "my wife and i are looking forward to entertaining in our home. neither of us drinks alcohol, and we prefer not to have any in our home. can you help us with an appropriate way to communicate that to our guests? -- t. totaller in st. louis",
   "year": 2001,
   "month": 12,
   "day": 28
 },
 {
   "letterID": 1015,
   "topic": "Parties",
   "title": "Dad Demands to Know if Birthday Party Will Last All Night",
   "text": "recently my wife was out for some training all day on a saturday. our 11-year-old daughter had been invited to a birthday party on the same day, so i was to drop her off. my wife and daughter told me the birthday party \"might or might not\" be a sleepover party. my daughter would inform me at the end of the party if she were spending the night.\ni wanted to know at the time i dropped her off whether she was going to be sleeping over. my wife claimed i \"didn't need\" to know. she accused me of being unreasonable, and said it was ok for me to find out at the end of the party. i don't mean to be picky, but as a dad was i being unreasonable? -- responsible parent in oregon",
   "year": 2016,
   "month": 7,
   "day": 22
 },
 {
   "letterID": 149,
   "topic": "Marriage",
   "title": "Mr. Nice turns into Mr. Wrong for her",
   "text": "here's one for you. my wife and i were married over a year ago. we sent wedding invitations to a number of family members and friends. one of my cousins who lives many miles away called to say that she couldn't attend, and asked whether we would like \"a this\" or \"a that\" from a prominent store in her town.\ni chose between the two items and thanked her, but now i really can't recall what the items were.\nwell, here it is, a year later, and neither the \"this\" nor the \"that\" has arrived. my concern: did my cousin forget or decide not to send anything (which is fine), or did the store not send it (which isn't). and, hence, since my cousin may have thought a gift was sent and she hasn't received a \"thank-you,\" she may be miffed.\nwhat is the right thing to do? perplexed in princeton",
   "year": 1990,
   "month": 7,
   "day": 5
 },
 {
   "letterID": 131,
   "topic": "Marriage",
   "title": "Alcohol approval hard to swallow",
   "text": "i must take issue with your suggestion that husbands should share in writing the thank-you notes for wedding gifts.\ni understand that all department stores have a \"bridal registry.\" this is a long list of everything the bride has already selected: china, glassware, silver, household appliances-the works.\ni personally would be content to use the discount store dishes and silverware (stainless) i used before i was married.\nwhere is the \"groom's registry\"? i would have been thrilled to go to my local hardware store and pick out a power tool, a set of screwdrivers or a garden rake as a wedding present.\ni would be more than willing to write thank-you notes for our wedding gifts had there been anything for me. as it happens, my wife received most of the things she selected. i say, let her write the thank-you notes! newlywed in seattle\n----------\nis your social life in a slump? get abby's booklet, \"how to be popular\"-for people of all ages. to order, send your name and address, plus check or money order for $2.89 ($3.39 in canada) to: dear abby, popularity booklet, p.o. box 447, mount morris, ill. 61054.",
   "year": 1989,
   "month": 9,
   "day": 20
 },
 {
   "letterID": 522,
   "topic": "Marriage",
   "title": "Woman's One and Only Has the Acquaintance of Many",
   "text": "please settle a disagreement my wife, \"angela,\" and i are having. we heard from some friends that angela's nephew was being married. angela saw her nephew on a couple of occasions, and he never once mentioned that he was even engaged.\nthe wedding was held in july. we did not receive an invitation. now an announcement has arrived in the mail stating that they are married. angela has heard through the grapevine that the bride is registered for wedding gifts at a local department store.\ni say we should send them a card since we were neither notified of the engagement nor invited to the wedding. angela is very upset over this because she has always felt close to her nephew -- but apparently her feelings weren't reciprocated. she thinks we should send a nice gift. what do you think, abby? -- confused and sad",
   "year": 2005,
   "month": 10,
   "day": 15
 },
 {
   "letterID": 615,
   "topic": "Marriage",
   "title": "Bride Angles for Presents Even After Groom Bails Out",
   "text": "my wife and i received an invitation from a family member to attend their daughter \"heidi's\" wedding on father's day weekend. we canceled our existing plans in order to attend, and gave \"heidi and dave\" an appropriate gift. as the ceremony progressed, the minister asked, \"do you, steve, take heidi\" ... at which point the guests began whispering to themselves, \"steve?\"\nwe were embarrassed, thinking we had made a horrible mistake in addressing the gift card -- and we weren't the only ones. finally, after much discussion among the guests, someone approached the bride's mother to ask if we had made a mistake. \"oh, no,\" she replied. \"dave backed out two weeks ago. heidi asked steve if he would marry her, and he said he wasn't doing anything else this weekend, so why not?\"\ni was flabbergasted. predictably, in less than three weeks, this sham of a marriage was over. heidi, of course, retained all the gifts.\nmy wife says it's no big deal. i say the bride's parents should have called the guests and explained the circumstances so they could make an informed decision about attending. i was also raised to believe that in cases such as this, where the commitment to marriage was so obviously missing, that the gifts should be returned. am i wrong? this has caused a rift in the family. -- jilted guest",
   "year": 2008,
   "month": 11,
   "day": 18
 },
 {
   "letterID": 398,
   "topic": "Marriage",
   "title": "Surgeon Keeps Office Hours for Patients, Not for Family",
   "text": "my family needs your help to solve a serious problem that is causing hard feelings. my wife's cousin, who is from a middle-class family, is being married this summer. he and the bride are planning a large wedding, and we were told the invitations will state \"formal attire.\"\nabby, very few, if any, of the guests own formal attire, and family members feel the dress code is rude and inconsiderate. it creates an expense we should not have to bear to attend the wedding.\ni also need to know if we will be expected to purchase a gift for the couple if we go to the expense of buying formal attire. it seems to us that our presence in expensive formal attire should be present enough. what should the family do about attending the wedding with this restriction on the attire of the guests? -- confused in overland park, kan.",
   "year": 2000,
   "month": 7,
   "day": 24
 },
 {
   "letterID": 284,
   "topic": "Marriage",
   "title": "Child Neglected at Home Needs Attention at School",
   "text": "our 21-year-old grandson, who has always been the apple of our eye, has just announced that he is the \"proud\" father of a baby boy born to his 20-year-old girlfriend. they are living together, he has a good job, but no mention has been made of any forthcoming marriage. they just say they are \"engaged.\"\nmy wife and i have decided that until they get married we are not giving them a wedding present. we gave our granddaughter a generous cash wedding gift after her wedding, and we are prepared to do the same for this grandson, but not until -- regardless of how many illegitimate children he has!\nalso, do you think a baby gift is in order for an illegitimate child? -- uncertain in minnesota",
   "year": 1996,
   "month": 8,
   "day": 30
 },
 {
   "letterID": 335,
   "topic": "Marriage",
   "title": "Venal Caregiver of Elderly Man Took Far More Than She Gave",
   "text": "an old friend of ours mentioned that she was coming to town and needed a place to stay. we invited her to spend the night at our home. she and her husband own a buffalo ranch. she asked us if we would like to taste some buffalo sausage and we said, \"sure.\"\nwhen she arrived, she was carrying a small package of frozen buffalo sausage and her recent wedding video. after a nice dinner and viewing the video, we gave her a wedding gift that we had recently purchased in greece.\nnow, here is the odd part: my wife and i had to leave the next morning for work. we left our guest a key to lock the door when she left. when we returned from work that evening, we noticed a note on our kitchen counter. we thought it would be a \"thank you\" for the previous evening. instead, it was a bill for the buffalo sausage! there was no mention of our hospitality or the wedding gift.\nof course we will pay the bill, but enclosed with our check will be a bill for her night's lodging and dinner. abby, what do you think? -- buffaloed in st. paul",
   "year": 1998,
   "month": 7,
   "day": 17
 },
 {
   "letterID": 84,
   "topic": "Marriage",
   "title": "HISTORICAL NOTES ON ORIGIN OF THE 'FAT LADY SINGS'",
   "text": "my wife and i are in our 40s. friends, also in their 40s, have invited us to their wedding (his fourth, her third).\nmy wife thinks we should send them a wedding gift. i say they have already received enough wedding gifts as they both own homes and don't need any items to start a household. our attending their wedding indicates our best wishes, and that should be enough.\nif my wife insists, i say we should give them a toaster. who's right? gift giver",
   "year": 1987,
   "month": 11,
   "day": 22
 },
 {
   "letterID": 570,
   "topic": "Marriage",
   "title": "Subdued Colors at Funeral Are Way of Paying Respect",
   "text": "my grandchild's mother -- she and my son were never married -- is being married soon. my wife and i have been invited to the wedding.\nmust we attend? our son will not be in attendance. all we would really want is to see our granddaughter, but we know we would have very little time with her at the wedding. we would prefer to send a nice gift, and use the time and money to visit at a different time so we can spend time with our granddaughter and visit our son.\nwhat do you think we should do? -- missing our granddaughter in minnesota",
   "year": 2006,
   "month": 6,
   "day": 5
 },
 {
   "letterID": 650,
   "topic": "Marriage",
   "title": "Husband's Anniversary Wish Is to Give Wife a Real Wedding",
   "text": "our 40th wedding anniversary will soon be here, and my wife, \"nancy,\" and i are considering renewing our vows. we were married when i was in the service during the vietnam war, so we had only a rushed ceremony with a justice of the peace.\ni would like a full-blown wedding for my dear wife. i picture nancy walking down the aisle wearing her white gown, looking as beautiful as the day we were first married. my children, now adults, think this is unnecessary and a waste of money. (we don't have much -- we're on social security.)\ni think my wife deserves the wedding she never had. nancy has been through so much stress with all the surgeries i've had. i feel the love of my life and mother of my children deserves the wedding she was dreaming of. what do you think? -- steve w. in phoenix",
   "year": 2008,
   "month": 1,
   "day": 12
 },
 {
   "letterID": 424,
   "topic": "Marriage",
   "title": "Fast Action by Rape Victim Helps Police Catch Predator",
   "text": "here's a topper for your \"can you top this\" collection. my wife and i attended a lovely wedding. the groom was a 45-year-old physician; his bride is a 38-year-old professional. it was a first marriage for both, a lavish affair with a reception and formal dinner following the ceremony.\nsix weeks later, we received the following e-mail from the newlyweds: \"dear friends: we're back from our glorious honeymoon romp through the game parks of east africa, and still basking in the glow of our wedding.\n\"tomorrow we're meeting with the catering manager at the hotel where our wedding was held, because we're disputing the liquor bill from the wedding dinner. their claim works out to seven drinks per person! this is separate from the wine and champagne served during dinner.\n\"would you please e-mail us the number and kind of drinks you drank at our wedding? we are meeting at 9 a.m. so we need your response asap. thank you (all) for making our wedding so special.\"\nabby, my wife and i are aghast at this request. what's your take on this? -- appalled in leucadia, calif.",
   "year": 2001,
   "month": 9,
   "day": 12
 },
 {
   "letterID": 183,
   "topic": "Marriage",
   "title": "Dad loves night life; kids have had enough",
   "text": "i can't believe i'm writing this. this is a second marriage for both me and my wife. the problem is this: i have two daughters and two stepdaughters. all four have gotten married since my wife and i were married. one stepdaughter had a big church wedding; the other one ran after the fellow and finally married him in texas. they were married by a judge, so i sent them the money i would have spent on a big wedding.\nnow, both stepdaughters are divorced. the one that got married in texas is engaged again and wants a big wedding since she didn't have one the first time. abby, i don't believe i should be expected to pay twice, especially since i don't think this will be her last, either.\nit's not that i don't have the money, but it has been earmarked for retirement, which is three years away.\nhow can i handle this? please answer soon because the wedding looks like it may be in may 1991. one daughter, one wedding",
   "year": 1991,
   "month": 2,
   "day": 10
 },
 {
   "letterID": 281,
   "topic": "Marriage",
   "title": "Dad's Pockets Are Inside Out After Years of Subsidizing Son",
   "text": "my son (i'll call him earl) was married in palm beach to a girl he has lived with for some time. her family is quite wealthy. the wedding was elaborate and must have cost more than $75,000. earl's mother, my ex-wife who is also quite wealthy, and i hosted the rehearsal dinner for 80 guests and shared the nearly $4,000 in expenses. my present wife, our daughter who is a junior in college on scholarship and full financial aid, and i flew in from our home in los angeles for the ceremony. we sacrificed to attend and give the newlyweds a cash wedding gift. our total cost for the occasion was more than $5,000.\nmy home and business were destroyed in the earthquake in 1994 and my wife and i have been struggling ever since.\nmy problem: earl is a talented rock musician. his dream is to have a career in music, and he has asked me to give him money for expensive equipment for a studio he intends to build in his home. his 30th birthday is in late november.\ni don't know how to handle this. i want to help him. don't tell me to co-sign with him for a loan because when i did that before, i ended up paying the whole amount. part of me says, why didn't they spend our wedding gift for the studio or opt for a smaller wedding and use some of that money for their future?\nas a divorced father, all i was ever asked to provide for my son was money, and this seems to be the ongoing scenario. what should i do? -- embarrassed in l.a.",
   "year": 1996,
   "month": 10,
   "day": 27
 },
 {
   "letterID": 263,
   "topic": "Marriage",
   "title": "LUMP PROVES VALUE OF A 2ND OPINION",
   "text": "my daughter, \"sarah,\" is a part of a circle of friends-male and female-who have remained close friends all through school. \"john\" became engaged to a woman who had not been a part of the original group.\nsarah was shocked and hurt when she learned, months later, that she had not been invited to john's wedding.\ni ran into john shortly after that, and he gave me a big hug. when i told him how hurt sarah was because she hadn't been invited to his wedding, john said, \"it was my wife's big day, and i deferred to her decision.\"\nthen i said, \"that's odd; i would have thought it was your big day too.\"\nabby, i believe john's wife wanted to exclude a person she perceived as a potential rival-and she succeeded. i told sarah i thought john's bride was petty and mean-spirited, but john will probably soon figure it out on his own.\nabby, why do you think my daughter wasn't invited to john's wedding?\nsimmering in seattle",
   "year": 1995,
   "month": 1,
   "day": 27
 },
 {
   "letterID": 878,
   "topic": "Marriage",
   "title": "Groom, Not the Bride, Is Under Pressure to Change His Name",
   "text": "my wife's niece is marrying a wonderful man of greek descent this summer. her grandfather insists that his last name is too long and impossible to pronounce. he thinks they need to change the name when they marry. he went so far as to make them call him so he could tell them what he wanted. then he gave them 10 days to \"think about it\" and call him back with their answer.\nhe told the mother of the bride that if they don't change the name, then he's \"just not into the wedding anymore,\" implying that he won't help them pay for the event. needless to say, this has most of the family shaking their heads and thinking the old man has finally lost it.\nwe understand that this was common practice for families passing through ellis island coming to america a century ago, but have you ever heard of this being done for a wedding? being a therapist, i thought i'd seen and heard it all -- until now. please give us some insight. i'm hoping his \"ladyfriend\" will read your reply and share it with him. -- can't believe it down south",
   "year": 2013,
   "month": 5,
   "day": 13
 },
 {
   "letterID": 814,
   "topic": "Marriage",
   "title": "Otherwise Generous Man Keeps His Heart Under Lock and Key",
   "text": "my 24-year-old daughter, \"lisa,\" informed me a year ago that she was engaged. she's a college graduate living in another state and still looking for a job. her fiance is a young marine who plans to make it a career.\nlisa was visiting this weekend and gave us the wedding date, which is in three months. she already has her invitations and bridesmaids picked out, etc.\nas she was leaving, she broke down and said she had \"something to tell me.\" they were married six months ago. she still wants to continue with her \"wedding\" plans, and have me walk her down the aisle.\nmy wife and i are extremely hurt and angry for having been lied to all this time. my question is, should i go along with this charade? any other wisdom to impart? -- lisa's disappointed dad",
   "year": 2012,
   "month": 9,
   "day": 16
 },
 {
   "letterID": 43,
   "topic": "Marriage",
   "title": "WEDDING NEEDN'T BE SHOW-STOPPER",
   "text": "our family is approaching a time of dissension concerning the upcoming wedding of our eldest daughter. recent weddings of friends and family have been real \"blowouts,\" each trying to outdo the last.\nmy wife and daughters keep talking about the reception, dresses, flowers and tuxedos as if we had a mature money tree. they justify a \"nice\" wedding for the \"memories\" it will make.\ni believe that a \"nice\" wedding can consist of a bride's gown, and simple dresses for the ladies that won't cost them a fortune--and ones they can wear again. and what's wrong with dark blue suits for the guys, a few simple bouquets, and cake and punch for the reception?\nwe aren't rich, but we meet our needs and have no bad debt problems--yet! my wife uses coupons to shop at the grocery store and she manages our daily money matters very well, but no amount of coupons will be able to cover the disaster they are planning.\nwhat do you say? has the ladder set up",
   "year": 1986,
   "month": 6,
   "day": 8
 },
 {
   "letterID": 813,
   "topic": "Marriage",
   "title": "Teens Play the Same Notes, but Aren't Making Music Together",
   "text": "my wife and i were invited to my brother's wedding, and we accepted. later, my brother asked me to be a groomsman.\nmy wife is upset because i didn't ask her if she minded that i'll be in the wedding and i will walk down the aisle with one of the bridesmaids. she feels that my walking with another woman is a \"date\" and disrespectful to her. is it proper wedding etiquette to accept an invitation to be in a wedding if you are married? -- groomsman in the south",
   "year": 2012,
   "month": 9,
   "day": 22
 },
 {
   "letterID": 293,
   "topic": "Marriage",
   "title": "Pet Adoption Campaign Asks for Open Hearts and Homes",
   "text": "our family was invited to my brother-in-law's wedding. the invitation said \"adults only\" and noted that a baby sitter would be provided at the house. nice try, but no go. look at it from my side: i'm to drive to a strange state, a strange city, a strange house, leave my 2-year-old with a stranger, and then off for six hours and have fun? fat chance! i'd worry and so would my child. furthermore, a kid is not a pork chop or a dog; you can't freeze it or tie it up in the back yard.\nour options were: i stay with my child and my wife attends the wedding and reception alone, or we disobey the rules and bring our kid, or we don't go. period. however we do it, the hosts are not going to be pleased, but that's life.\nwe attended the wedding as a family. i brought books and toys, parked in a corner of the reception hall, took my kid to wrestle on the lawn and explore the country club. then i read to him. afterward, i apologized to the hosts, who were very gracious.\nbut what disturbs me is how brides lose track of what their wedding is all about. because they're spending $25,000, they plan a major hollywood production or a disneyland extravaganza. they want to direct and make everything perfect. it's not going to happen.\na wedding is nothing but a fancy party, a celebration bringing families and friends together. uncle albert is just as likely to get drunk and paw the women, or cousin bruce to start a fight, or jeannie to flirt with the groom as my kid is to spill his punch. you might as well note on the invitation: \"no drunks, punks, flirts or smokers.\" if a bride wants a flawless affair, she should hire a producer, choreographer, and actors to stand in as family, and then mail videos to \"invited guests.\"\nfive years from now, when these brides have their own toddlers, they'll receive an invitation to a wedding with a p.s.: \"no kids allowed.\" then they will understand that every hurt comes home. -- a family man in bangor, maine.",
   "year": 1996,
   "month": 4,
   "day": 28
 },
 {
   "letterID": 645,
   "topic": "Marriage",
   "title": "Mom Feels Helpless Watching Troubled Son Waste His Life",
   "text": "my wife's niece is being married in may. the wedding is 1,500 miles from here. our daughter, \"sophie,\" a college sophomore, will be a bridesmaid in the wedding.\nfor the last year and a half sophie has been dating \"trey,\" whom she met at school, and it appears to be a solid relationship. i like him.\ntrey received an invitation to the wedding, too, which was unnecessary in my opinion. now my wife insists it's our responsibility to buy trey an airplane ticket so he can attend. he will stay in a hotel room with my sons if he goes.\ni don't mind paying for the room and related expenses, but i see no reason why i should fork out hundreds of dollars for an airline ticket. i already have to pay for my family of five for this trip. my wife says i'm stingy. am i? -- getting flak in atlanta",
   "year": 2008,
   "month": 2,
   "day": 19
 },
 {
   "letterID": 205,
   "topic": "Marriage",
   "title": "Little neighbor is becoming a big pest",
   "text": "i need your advice on the proper thing to do in a situation in which my wife and i will soon find ourselves. our son is marrying a woman who lives in a distant state. her mother, whom we have never met, invited my wife and me to stay in her home when we come for the wedding, which will be three days total.\nwe feel that we should offer to do something to cover at least the expense of the food - but we don't want to offend her.\nhave you any suggestions as to how we can accept the invitation and yet feel that we have held up our end of the arrangement? we have never met these people, and we'd like to make a good impression on them. thanks for your help. future in-laws",
   "year": 1992,
   "month": 9,
   "day": 12
 },
 {
   "letterID": 392,
   "topic": "Wedding Rings",
   "title": "Mom's Strength, Forgiveness Still Inspire Decades Later",
   "text": "after reading the letter in your column about the wearing of wedding rings, may i offer a suggestion?\nmy late, beautiful wife and i always agreed we would wear our wedding rings until we passed on. however, at times this has caused some embarrassment when people asked about my wife, not knowing she has passed on.\nsince i do not want to remove my ring, i asked my jeweler to cut a groove in it and to blacken the groove. now i wear it as a mourning ring, and it looks quite distinctive. -- jack anspach, virginia beach, va.",
   "year": 2000,
   "month": 9,
   "day": 29
 },
 {
   "letterID": 106,
   "topic": "Marriage",
   "title": "SHOULD DAD FOOT HER WEDDING BILL?",
   "text": "our daughter is 26. she's living with a man we've never met. they have lived together for more than two years. eighteen months ago, she called to tell us that she was pregnant. at the time, i suggested that they get married, but she said she didn't know if she really \"loved\" him. they now are the parents of a healthy 10-month-old boy.\nlast week, this daughter (who lives 1,000 miles away) called to say that she decided to marry this man-and would we pay for the wedding? i didn't know what to say.\nwe haven't seen her for more than two years. two years ago, my wife and i drove from phoenix to denver to surprise her on her birthday. we called her from a service station on the outskirts of town, and were told she had other plans and couldn't see us that week. almost every call we've had from her since she left home at 18 was an sos for money.\nmy first reaction to her request that we pay for her wedding was anger- although i didn't express it. i don't think we should pay for it. what do you think? hot in arizona",
   "year": 1988,
   "month": 11,
   "day": 8
 },
 {
   "letterID": 362,
   "topic": "Marriage",
   "title": "Taking Deceased's Property Is Burglary, Plain and Simple",
   "text": "my wife and i have a dilemma over something that occurred at our wedding. we invited my mother's first cousin (whom i've only met twice) and his wife out of courtesy to my grandmother. (my mother is deceased.) the cousin called our home five days before the wedding and informed us that he would be picking up his son from college and bringing him to the wedding, too, \"since he's family and all.\" he said he'd be doing this because it would give the three of them time to spend together.\ngiven the late notice with which he called, we decided that it was simply too late to add another guest. i spoke with him the following day, and he agreed with us and said it was \"no problem\" to come without his son.\nto our surprise, however, while dancing at our reception, my new bride and i noticed the cousin's wife and son dancing! we don't know when he arrived or if he was there for the ceremony, cocktail party and/or dinner (however, no dinner was ordered for him and no place seating reserved). they never came over to speak to us during the evening, and we decided not to address the issue on our wedding day.\nabby, we spent a year carefully planning our wedding, and as hosts, we felt it was presumptuous of them to make a decision about our guest list against our explicit request. under the circumstances, we do not feel comfortable accepting their wedding gift. we appreciate the gift, but are too hurt by the disrespect and disregard we feel we were shown to accept it. should we send a letter explaining our feelings and return the gift, or is there a more appropriate course of action? -- ignored in southern california",
   "year": 1999,
   "month": 9,
   "day": 23
 },
 {
   "letterID": 325,
   "topic": "Marriage",
   "title": "Reception Deception Leaves Father Doubting Son's Word",
   "text": "my son was married last month. before the wedding, he asked me if i would contribute financially to the reception. i offered to pay for the drinks, and he and his fiancee seemed appreciative. the bride's parents are divorced, but they, too, have each contributed several thousand dollars to the reception.\na few days before the wedding, my son informed me that the total cost of the beverage bill came to nearly $3,000. i wrote a check for that amount.\nmy son's bride told my wife that there would be some extra charges, so i telephoned the accountant at the hotel to get the exact amount. the accountant informed me that there were no extra charges, and the total bar bill was less than half the amount i had contributed. my son refused to discuss the matter, so i sent the invoice from the hotel to him and his wife two weeks ago. since then, there has been total silence on their end, and it looks like a cold relationship is developing. my wife says i should forget about the extra $1,700, since they probably needed the money for other expenses. i maintain there's an ethical issue here that shouldn't be swept under the rug. what do you think? -- cheated father/father-in-law in wisconsin",
   "year": 1998,
   "month": 12,
   "day": 27
 },
 {
   "letterID": 392,
   "topic": "Wedding Rings",
   "title": "Mom's Strength, Forgiveness Still Inspire Decades Later",
   "text": "after reading the letter in your column about the wearing of wedding rings, may i offer a suggestion?\nmy late, beautiful wife and i always agreed we would wear our wedding rings until we passed on. however, at times this has caused some embarrassment when people asked about my wife, not knowing she has passed on.\nsince i do not want to remove my ring, i asked my jeweler to cut a groove in it and to blacken the groove. now i wear it as a mourning ring, and it looks quite distinctive. -- jack anspach, virginia beach, va.",
   "year": 2000,
   "month": 9,
   "day": 29
 },
 {
   "letterID": 421,
   "topic": "Wedding Rings",
   "title": "Cell Phone Opponents Caught Driving While Being Distracted",
   "text": "i am in my mid-60s. my wife and i were married 38 years. she died a year ago.\ni know it is customary for women to wear their wedding rings after their husband's death, but should men continue wearing their wedding bands?\nalthough i do not want to offend my children and in-laws by removing my ring, on the other hand, i do not want to appear foolish for continuing to wear it when i am no longer married.\nwhat is proper under these circumstances? -- wondering widower in wisconsin",
   "year": 2001,
   "month": 10,
   "day": 6
 },
 {
   "letterID": 629,
   "topic": "Wedding Rings",
   "title": "Sister Can't Knit Together Family Torn by Its History",
   "text": "my wife, \"mona,\" and i decided to separate a few months ago. she filed for divorce, and during the two months cooling-off period we spent a lot of time talking to each other. after some consideration, we reconciled.\nnow that we're back together, i have learned that mona sold her wedding ring to pay for some living expenses. we discussed purchasing another one, but apparently it's not a top priority on her to-do list. she has also said she doesn't want to buy her own ring or split the cost. i still wear mine, but feel as though i'm the only one who's committed to the relationship. any thoughts? -- having doubts in dallas",
   "year": 2008,
   "month": 7,
   "day": 25
 },
 {
   "letterID": 674,
   "topic": "Wedding Rings",
   "title": "Friends Opt Out of Couple's Spouse Swapping Parties",
   "text": "after 13 years of marriage, my wife has stopped wearing her wedding rings. first she said her fingers had shrunk and her rings kept falling off. then she claimed that the \"golf club had bent them.\" now she refuses to wear them out of spite because i told her the rings are a sign of commitment, and i feel she's \"advertising\" that she's not married.\nam i reading too much into this? in many ways she is still a dutiful wife, but this ring thing is becoming an issue. any pearls of wisdom? -- feeling insecure in midway, ga.",
   "year": 2009,
   "month": 7,
   "day": 22
 },
 {
   "letterID": 557,
   "topic": "Wedding Rings",
   "title": "Out of Mouths of Babes Come Nosy Question for Sub Teacher",
   "text": "my wife of 24 years refuses to wear her wedding rings. when i asked why, she said it's because we're not getting along. i asked her to put them back on, but she refuses.\nwe talk, but my love for her is wearing thin -- and when she goes out of town without the rings, it burns me up. what can i do? she refuses to go to a counselor.\ni am a stay-at-home, retired dad, and she works full time. i do all the chores, including cooking dinner. there has been no intimacy for months. we have two boys, 14 and 16.\nwhy would she do something like this? i think she doesn't want to be married anymore. -- smarting in fort myers, fla.",
   "year": 2006,
   "month": 12,
   "day": 9
 },
 {
   "letterID": 411,
   "topic": "Marriage",
   "title": "Father of Flower Girl Finds It's No Bed of Roses at Home",
   "text": "my nephew is being married in a few months and has asked my 7-year-old daughter, \"shelley,\" to be the flower girl in his wedding. he is her godfather.\ni also have a 5-year-old daughter, \"ruthie.\" my wife thinks it is unfair that ruthie wasn't asked to be in the wedding because \"it's every little girl's dream\" to be a flower girl. the truth is, ruthie did not feel slighted in the least when she heard shelley was asked. however, my wife, her mother, two sisters and a couple of her friends think it is wrong and mean-spirited for ruthie not to be included.\nthis argument has caused a great deal of strain between my wife and me. she has even stated that rather than attending the wedding, she may stay home with ruthie. abby, do you think i am being an insensitive father for not telling my nephew that he must ask both girls to be flower girls? -- bewildered in texas",
   "year": 2001,
   "month": 12,
   "day": 26
 },
 {
   "letterID": 85,
   "topic": "Marriage",
   "title": "SOMETHING OLD FOR BRIDESMAIDS?",
   "text": "the other day, my wife and daughter and i were talking about our daughter's upcoming wedding. since our daughter has a closetful of expensive dresses she's worn only once, i made what i thought was a very good suggestion: \"why not let all the girls you want in your wedding party just pick out the prettiest dress they have hanging in their closets and wear it? for those who don't have one or can't afford to buy one, let them borrow one of yours, or another friend's. guys rent tuxedos for weddings; why should girls have to buy an expensive dress to wear only once? a lot of girls are left out of weddings because they can't afford to buy a dress.\"\nwell, abby, my suggestion went over like a lead balloon. what do you and your readers say? practical alabama daddy",
   "year": 1987,
   "month": 11,
   "day": 24
 },
 {
   "letterID": 446,
   "topic": "Marriage",
   "title": "Annoyed Doctor Tries to Avoid Practicing Outside His Office",
   "text": "five years ago i married a widow with two adult daughters. i was divorced with two adult daughters of my own. now there are two weddings in the works -- one for my daughter and the other for my stepdaughter.\nmy wife thinks we should contribute substantially more to her daughter's wedding because mine has \"more family\" behind her. i say our financial assistance should be the same for both. do you think i am being unreasonable? -- father of the brides in montana",
   "year": 2002,
   "month": 12,
   "day": 13
 },
 {
   "letterID": 446,
   "topic": "Marriage",
   "title": "Annoyed Doctor Tries to Avoid Practicing Outside His Office",
   "text": "five years ago i married a widow with two adult daughters. i was divorced with two adult daughters of my own. now there are two weddings in the works -- one for my daughter and the other for my stepdaughter.\nmy wife thinks we should contribute substantially more to her daughter's wedding because mine has \"more family\" behind her. i say our financial assistance should be the same for both. do you think i am being unreasonable? -- father of the brides in montana",
   "year": 2002,
   "month": 12,
   "day": 13
 },
 {
   "letterID": 974,
   "topic": "Promiscuous Kids",
   "title": "Parents With Strong Beliefs Won't Visit Cohabitating Couple",
   "text": "our amazing daughters are in their late 20s. both of them are independent, intelligent and loving. the four of us have a special bond. my wife and i have always been supportive in all aspects of our daughters' lives, and that will never change.\nthey have been dating great guys over the past five years whom we believe they will ultimately marry. the problem? my wife and i were raised with certain values, and our daughters have recently moved in with their boyfriends. we do not approve, but respect their decisions as adults.\none daughter plans to have an open-house party celebrating their new place. she's upset that my wife and i have indicated we won't be attending, because doing so would be difficult and against our beliefs. we have understood her decision, but she does not appear to respect ours. are we wrong to take this stance? -- against the tide in new jersey",
   "year": 2015,
   "month": 5,
   "day": 5
 },
 {
   "letterID": 690,
   "topic": "Promiscuous Kids",
   "title": "Man Gets the Silent Treatment for Reasons He Can't Fathom",
   "text": "our 23-year-old daughter, \"kristy,\" lives at home. she works full time and goes to school, but lives here with free room and board, cable tv, etc. she has been seeing a man for a month and now is spending two or three nights a week at \"his place.\"\ni am not unreasonable or naive, but i feel that because kristy is living under my roof, she should live by my rules, which do not include sleeping over at some man's house after only one month of dating. to top it off, we have never met him, although we have asked several times to be introduced.\nwe know that kristy is an adult, but i believe that as an adult she should have enough respect for us to refrain from spending the night at his place until she knows him better and we have at least met him. am i being unreasonable?\nmy wife throws up her hands and says, \"what can we do?\" i believe parenting does not end at 18. i am not a prude, but this seems wrong to me. any advice? -- dad in distress",
   "year": 2009,
   "month": 4,
   "day": 7
 },
 {
   "letterID": 1040,
   "topic": "Promiscuous Kids",
   "title": "Teen Daughter's Sex Life Reveals Parental Discord",
   "text": "my 16-year-old perfect kid came to us, very adult-like, saying it was time for her to go on the pill. we knew she had a boyfriend, but didn't realize it was this serious.\ndespite my initial impulse to kill him and stick my daughter in a convent, we discussed it as a family and agreed she would see a gynecologist. she also had a long talk with her mother about sex, and with me a few days later. when i sat down alone with her she was embarrassed, but i don't care -- i'm her father.\nfast forward to last week: she left her ipad in the living room, and while i was using it, up popped explicit pictures of her not only with her boyfriend, but with other guys and girls. her mother and i talked about how to handle this. i suggested therapy and pulling her from school. my wife disagreed. she accused me of violating our daughter's personal property and said it's none of my business!\ni may be old-fashioned, but my daughter, whom i love more than life, needs to know this is not ok. she's still a child despite looking like an adult, and as a child, she needs guidance. am i wrong? do you have any resources for me on handling my daughter's sexual impulses? -- concerned dad in santa clara",
   "year": 2016,
   "month": 2,
   "day": 19
 },
 {
   "letterID": 1063,
   "topic": "Promiscuous Kids",
   "title": "Old Custom of Asking Permission to Marry Is Fading Away",
   "text": "the husbands of both my two daughters asked for my blessing prior to asking my girls to marry them. i felt what they did was respectful and it was very much appreciated. my wife felt the same way when i relayed the good news to her.\ni believe this courtesy replaced what in the \"olden days\" was a request for permission from the father rather than a blessing and, in my opinion, is more appropriate. if i am correct in my assumption that \"permission\" has evolved to \"blessing,\" i wonder if it would have been more appropriate for them to have asked my wife and me together for our blessing. your thoughts? -- proud papa",
   "year": 2017,
   "month": 5,
   "day": 10
 },
 {
   "letterID": 1063,
   "topic": "Promiscuous Kids",
   "title": "Old Custom of Asking Permission to Marry Is Fading Away",
   "text": "the husbands of both my two daughters asked for my blessing prior to asking my girls to marry them. i felt what they did was respectful and it was very much appreciated. my wife felt the same way when i relayed the good news to her.\ni believe this courtesy replaced what in the \"olden days\" was a request for permission from the father rather than a blessing and, in my opinion, is more appropriate. if i am correct in my assumption that \"permission\" has evolved to \"blessing,\" i wonder if it would have been more appropriate for them to have asked my wife and me together for our blessing. your thoughts? -- proud papa",
   "year": 2017,
   "month": 5,
   "day": 10
 },
 {
   "letterID": 172,
   "topic": "Holidays",
   "title": "Man Wants to Open Door Wife Shut on His Family",
   "text": "i never thought i would be writing to you. my wife, \"annie,\" does not care for my family, so we spend every holiday with her family. she says my family lives \"too far away\" to visit, although hers lives only a few miles closer.\nannie and i are happy together, but shutting out my family completely is starting to bother me. i think of them on holidays and their birthdays and would like to share these times with them. i try to discuss this with annie, but she always says, \"we'll talk about it another time\" -- then she always initiates sex. (i just realized this.) it does take my mind off the discussion for the time being.\nhave you had letters from anyone else who neglected his family because of his spouse and later regretted it? -- \"sam\" in pittsburgh",
   "year": 1991,
   "month": 9,
   "day": 11
 },
 {
   "letterID": 516,
   "topic": "Holidays",
   "title": "Thanksgiving Commotion May Be Harmful to Dad's Health",
   "text": "this year it's our turn to have thanksgiving dinner for my parents, my two brothers and their families at our home. my parents and brothers all live in the same city, about three hours from my family.\nmy father recently had major surgery. he's recovering at home and can't drive. my mother can drive. however, she drinks a little, although she has never caused an accident.\nabby, i'd still like to host thanksgiving dinner at our home. we don't have a spare bedroom, but i don't think it would be a problem to make sleeping arrangements for my parents, my brothers and their families. all together, there would only be eight adults, a preschooler, a 6-year-old, 8-year-old twins and two teenagers in our house - and it would be only for two nights. (members of our families always stay with relatives when they travel, so a motel is out.)\nmy wife thinks it would make more sense (even though she enjoys cooking) if we stayed in a motel close to my parents' home this year and treated everyone to thanksgiving dinner in a restaurant close by. how can i convince her that my plan to have everyone at our home will work? -- perplexed in santa barbara",
   "year": 2005,
   "month": 11,
   "day": 21
 },
 {
   "letterID": 80,
   "topic": "Holidays",
   "title": "ABBY'S NEW COOKBOOKLET IS READY!",
   "text": "here's a family dilemma i hope you can solve: i'm a 30-year- old man who still lives in the same town as my parents. my wife and i have spent every holiday with my family for the last five years.\nthis year, my wife's family is going to lake tahoe for christmas, and we'd like to join them.\nthe problem is that my parents expect us to be with them as we always have. my wife feels that she's entitled to a holiday with her parents. her solution is to celebrate christmas on dec. 22 with my family (my mother's birthday) in our home. does this seem reasonable to you? if so, how do you suggest i tell my family of our plans? i don't want to hurt anyone's feelngs, and i am caught in the middle. sleepless in san diego",
   "year": 1987,
   "month": 11,
   "day": 5
 },
 {
   "letterID": 999,
   "topic": "Holidays",
   "title": "Sister Fears Her Wedding Will Be Beginning of Family's End",
   "text": "in less than a month, i am being married to my same-sex partner of 4 1/2 years. my brother and i spend time together at least once a month -- if not more -- and he has always given me time with my nephews. our conversations tend to be centered around lighthearted subjects and the occasional funny joke on our parents. unfortunately, having heart-to-hearts has not worked well for us. he's five years older and very religious.\ni have been out to my brother since i was 19, and the conversation didn't go well. he is refusing to come to my wedding, and i see this as the beginning of my having to choose my partner over him and my nephews.\nof course, i will want to spend christmas with my wife -- which will mean that instead of being a family together, i will no longer have christmas with my nephews. any advice for a way to approach him, or to be at peace with the future of my family? -- sad sister",
   "year": 2016,
   "month": 11,
   "day": 19
 },
 {
   "letterID": 57,
   "topic": "Dogs",
   "title": "LIVE-IN MAY HAVE TO SPEND TIME TO EARN FRIENDS",
   "text": "my wife has a degree in the medical field from a large, respected university, yet she thinks it's perfectly all right to allow our dog to drink out of the toilet bowl. the dog is even allowed to drink out of our swimming pool. she says it won't hurt him. this makes no sense at all to me. the pool man puts chemicals into the pool to kill the algae, so wouldn't that be harmful to our dog?\nplease hurry your answer. we are having words about this. this is a second marriage for both of us, and i can't afford another divorce. dog tired",
   "year": 1987,
   "month": 1,
   "day": 25
 },
 {
   "letterID": 553,
   "topic": "Dogs",
   "title": "Daughter Unsure About Contact From Her Long Absent Dad",
   "text": "am i a \"sicko\" because i step out of the shower naked in front of our dog? my wife thinks so. the trouble started when we got a female dog, \"taffy,\" from the local animal shelter. taffy sleeps in our bedroom and is there in the morning when i take my shower.\nmy wife insists that i cover up in front of the dog and that taffy is no different from a child. this has created a lot of stress between us because, to me, a dog is a dog. is it wrong to be naked in front of a dog? -- in the doghouse, temecula, calif.",
   "year": 2006,
   "month": 12,
   "day": 22
 },
 {
   "letterID": 142,
   "topic": "Dogs",
   "title": "Children want to transplant parents",
   "text": "my wife and i travel in a van with our two standard poodles. in mild weather they can stay in the van overnight, but when it's very hot or very cold, we cannot leave them in a closed-up van, so we put them in a kennel. this is quite expensive, and not satisfactory when we take long trips.\ncan you tell us where to find a directory of overnight accommodations that allow dogs to stay in the rooms with their owners? we realize there are probably not many, because dogs can be destructive, dirty or noisy. our vet knows of no such directory. woodbury, conn.",
   "year": 1990,
   "month": 3,
   "day": 9
 },
 {
   "letterID": 738,
   "topic": "Dogs",
   "title": "Husband Is Dog Tired of Being Ignored by Wife",
   "text": "i love my wife very much. i like giving her back rubs, massaging her feet, cuddling and kissing her. in return she does the same -- to her dog, \"barkley.\"\nbarkley is the only one who benefits from her affections. the dog does nothing for me except allow me to pick up his droppings. what am i missing? -- doggone puzzled in cedar rapids, iowa",
   "year": 2010,
   "month": 2,
   "day": 26
 },
 {
   "letterID": 22,
   "topic": "Dogs",
   "title": "Dear Abby: Washing the Dog and the Licked Dish",
   "text": "1n the 73 years of my life. 48 of them spent with my wife. who died three years ago. i have always had dogsspanlels and poodlesthat were  bathed in the kitchen sink. _ _ __ _ _ also. whenever we had ice cream. we left a little tor  the dogs, and they licked the dish clean. this past year i became acquainted with a pennsyl vania dutch lady. who was at my house and saw me give my dog a bath in the kitchen sink. then she  witnessed the same dog clean out my ice cream dish. she was horrified and said only people of \"slum  caliber'i did that. in my neck of the woods. neither of these two  practices were thought to be so terrible. i've been a farmer most of my life, and i've never found anything that wouldn't wash off.  do you think i should stop giving my dog a bath in the kitchen sink and refrain from letting her lick my ice cream dish clean? your answer will in no way affect my relationship with this lady. but an outside  respected opinion will give me some peace of mind. frank  dear frank: the lady's criticism is less troubling than the way she phrased it\"people of slum caliber.\" a lot of nice middle-class people bathe their dogs in the kitchen sink, which is all right as long as the sink is  well cleaned afterward. letting a pet lick the ice cream dish clean is another  matter, however. boiling water will sterilize the dlshbut many people are understandably squeamish when it comes to accepting invitations to homes  equipped with \"doggie dishwashers.\"  cl  ",
   "year": 1985,
   "month": 8,
   "day": 18
 },
 {
   "letterID": 229,
   "topic": "Dogs",
   "title": "PARENTS' FEAR THEY'RE IN THE DOGHOUSE NOW",
   "text": "our son, daughter-in-law and grandson accepted our invitation for a memorial day cookout/pool party. they live about a 45-minute drive from our home.\nour daughter-in-law agreed somewhat reluctantly to leave their dog home, knowing that my wife and i are not \"pet people.\"\nmemorial day morning, our daughter-in-law telephoned to say that she was sorry, but she just couldn't leave their dog alone all day. then she gave me a \"love me-love my dog\" ultimatum, indicating that the dog was a member of their family. she expected me to cave in and say, \"well, all right . . . bring the dog.\"\ninstead, i said, \"i'm sorry you're not coming, but i understand your feelings. perhaps another time.\"\nshe said, \"well, goodbye,\" and then she hung up.\nabby, neither she nor my son has communicated with us since. was i wrong? or was she?\nin the doghouse",
   "year": 1994,
   "month": 7,
   "day": 17
 },
 {
   "letterID": 796,
   "topic": "Dogs",
   "title": "Man's Dog Outranks Wife in Household Pecking Order",
   "text": "i met my husband, \"monty,\" shortly after he lost his wife of 14 years. monty has two dogs, but the one i have issues with is \"ginger.\"\ni have never seen a dog act like her. ginger acts more like a wife than a dog. she clings to monty to the point he doesn't have any time alone. she'll sit outside the shower until he is done. if he takes a bath, ginger sits on the edge of the tub. she runs to him when he gets home from work to greet him before i do. as she's running ahead of me, she looks back as if she's worried i'll beat her to him.\nit's as if she thinks she's his wife! she sits next to monty on the couch when we're watching television. i hesitate telling her to move so i can sit next to my husband because he treats his dogs like gold. his excuse? \"they were here for me when my wife died.\" i'm sympathetic to that, but where do i fit in?\nginger bullies the other dog by growling at her and bumping into her when the other one tries to get monty's attention. i'm feeling jealous because sometimes my husband neglects my physical needs and is more affectionate with the dogs. what do i do? -- jealous of the four-legged mistress",
   "year": 2011,
   "month": 1,
   "day": 31
 },
 {
   "letterID": 313,
   "topic": "Dogs",
   "title": "Paternity Suit Fades Away in Light of Paternity Test",
   "text": "my wife and i are retired senior citizens. we occasionally like to take short trips, and we don't have to answer to anyone or worry about anything when we leave home.\non our recent anniversary (45th), our daughter and her family gave us a housebroken poodle, which they had purchased for themselves two months ago. (they live only two houses from us, so we knew about the dog and thought she was adorable.)\nwhen my daughter gave us the dog, i told her i absolutely did not want the responsibility. i was really upset and made myself quite clear. well, my wife, just to keep peace in the family, said that she would take care of the dog, so we kept her. and guess who is taking care of her?\nabby, was i wrong about the way i felt -- and still feel? my wife thinks that there wasn't anything wrong with giving us this unexpected gift, but i am about ready to say, \"it's either the dog or me!\"\nplease tell me what you think about this, but do not use my name, initials or location. -- in the doghouse",
   "year": 1997,
   "month": 4,
   "day": 26
 },
 {
   "letterID": 879,
   "topic": "Dogs",
   "title": "Dog Ownership Too Much Responsibility For Small Child",
   "text": "my 6-year-old daughter wants a dog more than anything in the world. she mentions it at least once a day.\nshe's a great kid, well-behaved and doing well in school, so i hate to disappoint her. but i have absolutely no interest in taking on the added responsibility of a pet like that.\nmy wife and i work long hours and our home is unoccupied for most of the day. it would have to be adjusted to be pet-friendly. i have nothing against pets, but i could never be considered an animal lover. we currently have two goldfish, but i can see that the time those guys bought me is quickly running out.\ni want my daughter to be happy and rewarded for what a great kid she is. i don't want a dog. what do i do? -- bad daddy out west",
   "year": 2013,
   "month": 5,
   "day": 11
 },
 {
   "letterID": 608,
   "topic": "Sisters",
   "title": "Man's Affair With One Sister Threatens Marriage to Other",
   "text": "a few years ago i had an affair with a woman i met at a local benefit. i'll call her \"desiree.\" as luck would have it, a few years later, desiree would become my sister-in-law.\nmy wife has always been jealous of her \"more attractive\" sister. she reminds me of that fact every time we visit. now desiree is having money problems, and she's threatening to tell my wife about our \"history\" if i don't accommodate her needs.\nmy marriage is already on thin ice because i ran over my wife's dog and forgot our anniversary in the same week. what should i do? -- blackmailed in burbank",
   "year": 2007,
   "month": 1,
   "day": 5
 },
 {
   "letterID": 1073,
   "topic": "Sisters",
   "title": "Mom Suspects Sister's Gift to Gay Daughter Came With a Message",
   "text": "my sister, who is very religious, sent my gay daughter a bible with her name engraved on it for christmas, even though we told her -- after she asked for suggestions -- that a gift card would be more appropriate. we are not religious, by the way.\nmy wife and i feel strange about it, as if my sister is trying to tell us something like, \"your gay daughter needs religion.\" how should we respond to this? -- baffled in the east",
   "year": 2017,
   "month": 3,
   "day": 10
 },
 {
   "letterID": 972,
   "topic": "Sisters",
   "title": "Ungrateful Houseguests Leave Bad Feelings In Their Wake",
   "text": "my sister and her husband are well-to-do, but cheap. they recently invited themselves to stay three nights in our snowbird condo on their way to a vacation in the caribbean. my wife and i hosted them, and during their stay we went out twice for dinner. both times my sister was quick to request separate bills. in the meantime, we had provided lodging and all their other meals for them.\ni am offended that they didn't show appreciation for our hospitality by at least taking us to dinner once. i have wanted to confront my sister about my feelings, but my wife has vehemently told me i shouldn't. what would you suggest? -- unequal in pennsylvania",
   "year": 2015,
   "month": 5,
   "day": 17
 },
 {
   "letterID": 828,
   "topic": "Sisters",
   "title": "Distant Mom Now Reaching Out Refuses to Admit Past Abuse",
   "text": "my wife, \"diane,\" and her youngest sister, \"jenny,\" have grown closer in recent years. jenny and her husband have been married as long as diane and i have. our children are close in age, and none of us is wealthy.\nwe live in different states. in her attempt to stay connected to diane, jenny sends gifts on every conceivable occasion and non-occasion. she sends boxes of cheap items she picks up at her local dollar store -- household knickknacks, toys, kitchen gadgets, plastic trinkets and costume jewelry. it's always things we neither need nor use, and the postage probably costs more than the items in those boxes.\nabby, i don't like it. our home is already jammed with too much stuff. i have told my wife i want her sister to stop sending all that junk. of course, she doesn't want to hurt her sister's feelings, so she says nothing. i have threatened to tell jenny myself, but i know that would be a mistake. i don't interact with her and her husband anyway, and we don't communicate well. what can i do? -- stuffed with stuff in oregon",
   "year": 2012,
   "month": 7,
   "day": 2
 },
 {
   "letterID": 460,
   "topic": "Sisters",
   "title": "Amateur Shrink's Analysis Provokes a Family Feud",
   "text": "my wife's family consisted of eight sisters and four brothers. she is the youngest sister, and the difference in age between her and her older sister is 18 years. all of the siblings married and had many children. my wife attended all their showers; we subsequently went to the weddings and baby showers.\nnow the third generation is starting to become engaged and we are again receiving invitations. we don't have the energy or money to attend these weddings, but don't know how to graciously decline the invitations. (there are more on the horizon.) both of us are over 80 years old and on a fixed income. how should we respond? -- old folk in new york",
   "year": 2002,
   "month": 4,
   "day": 6
 },
 {
   "letterID": 841,
   "topic": "Sisters",
   "title": "Sisters' Spat Is No Reason to Ruin Husband's Reunion",
   "text": "my wife, \"kate,\" and her sister, \"judy,\" do not get along, to the point that my wife refuses to be in the same room with her. i have a class reunion coming up, and judy is in my class.\nbecause we're not sure judy will show up, kate has said she will attend -- but she'll leave if judy arrives. we had planned on going in separate cars so kate could escape if necessary. but now she says if judy puts in an appearance, she'll be upset with me if i don't leave with her.\ni don't get along with judy either, but i'd like the chance to catch up with other classmates. kate feels my not leaving with her would demonstrate a lack of support. i don't want my wife's antipathy toward her sister to cause me to be penalized. what to do? -- in the middle",
   "year": 2012,
   "month": 1,
   "day": 30
 },
 {
   "letterID": 199,
   "topic": "Sisters",
   "title": "Lipstick mark gives her reason to see red",
   "text": "how would you define immediate family? are in-laws considered immediate family?\nthis may be a dumb question, but if my wife's sister is my sister-in-law, is her husband my brother-in-law? and, would he be considered immediate family? i need an answer to this question to settle an argument.\nfrancis basak in clarence, pa.",
   "year": 1992,
   "month": 5,
   "day": 29
 },
 {
   "letterID": 710,
   "topic": "Sisters",
   "title": "Woman Can't Stop the Affair She Started Two Years Ago",
   "text": "my wife, \"marissa,\" and i are expecting our first child. my sister \"patti\" has a little boy whom we all love and adore. when patti learned that we're having a girl, she said we don't \"deserve\" to have one because she has always wanted a daughter. then marissa added fuel to the fire with a few well-chosen remarks of her own that she shared with friends and neighbors.\ni just want all of this to stop and i don't know how to accomplish it. i'm upset with patti for her behavior, and sad that my wife and sister are at odds. this is hurting everyone in the family. what should i do? -- stressed-out dad-to-be",
   "year": 2010,
   "month": 10,
   "day": 13
 },
 {
   "letterID": 567,
   "topic": "Sisters",
   "title": "Woman Shrinks From Stares That Bigger Breasts May Bring",
   "text": "my wife of five years has three sisters. she is the second oldest, and ever since i have known her, she has felt like she doesn't \"belong\" in her family. these feelings get worse during holiday get-togethers. she feels isolated by her sisters and her mother.\ni thought she would eventually grow out of it, but since they have all had kids, it has only gotten worse. she cries every time we leave her parents' house, and i know it is affecting our son.\nwhat can i do to help her get over these feelings of not being liked or loved by her own family? it is starting to affect our marriage. -- carla's husband",
   "year": 2006,
   "month": 8,
   "day": 14
 },
 {
   "letterID": 621,
   "topic": "Sisters",
   "title": "Woman Drowns in Sorrow of Man's Drinking Binges",
   "text": "my 35-year-old sister is soon to be married for the first time and has planned an elaborate affair. she has many friends, business associates and family members to invite. because of the expense, she is not inviting the \"younger\" generation.\nwhen i called to respond to her invitation, i explained that i will be attending, but my wife - due to health issues - will not be able to come. i told her i would like to substitute our only teenage daughter. my sister's response? she told me she has so many people to invite that she has a waiting list, and she'll substitute someone from that list!\nthis seems rude to me. have you ever heard of a waiting list? - miffed in san jose",
   "year": 2008,
   "month": 10,
   "day": 2
 },
 {
   "letterID": 676,
   "topic": "Sisters",
   "title": "Couple's Hearts Were Fonder When Distance Was Greater",
   "text": "i have been married three years. my wife comes from a large family, most of whom are here on the east coast. she is close to all her sisters. one of them, \"kate,\" is gay and moved out west to be with her girlfriend, \"leslie.\"\nkate and leslie break up every year. then kate flies back to visit the family. everyone tells her not to reconcile with leslie and to start a life without her. after a few weeks, kate goes back, gets back together with leslie, and the cycle starts all over again.\nit's always the same story: leslie initiates the breakup. kate gets lonely and calls us for comfort at all hours of the night because she doesn't work a \"normal\" job, and it's still early for her. my wife and i both work and we have to get up very early.\ni have told my wife that kate needs to break this repeating cycle. i want to speak up but don't think it's my place as a non-blood relative. is there anything anyone can do to get through to her that what she's doing is not only hurting her, but other family members? -- sleep-deprived in springfield, va.",
   "year": 2009,
   "month": 7,
   "day": 9
 },
 {
   "letterID": 559,
   "topic": "Sisters",
   "title": "First Name Informality Is Wrong for Business Mail",
   "text": "please assist my wife and me with a question of usage. is the man who married my wife's sister my brother-in-law or my sister-in-law's husband?\nplease help, as there is $20 and a homemade deep-dish pizza on the line. -- stickler in tennessee",
   "year": 2006,
   "month": 11,
   "day": 15
 },
 {
   "letterID": 847,
   "topic": "In-Laws",
   "title": "Man Wants Input On Family's Holiday Plans",
   "text": "for the past 10 years, the holiday season has brought with it arguments between my wife and me. we both get along with our in-laws and do many things with both sides of our families. but for some reason, my wife makes arrangements for the holidays without discussing them with me first. this year, she told her mom we would host thanksgiving and that i would have to tell my family we wouldn't be coming to them.\nmy wife's sisters are not close to their in-laws. am i wrong to think she should have discussed the matter with me before deciding unilaterally what we're doing for the holidays? our kids need to see all their grandparents on thanksgiving and christmas. oh -- our parents live only seven minutes from each other. -- holiday blues in wisconsin",
   "year": 2013,
   "month": 12,
   "day": 20
 },
 {
   "letterID": 130,
   "topic": "In-Laws",
   "title": "Dad objects to in-laws' slurs",
   "text": "i am a 29-year-old married man with a fine, bright, 8-year-old son. my wife and i have a wonderful marriage, and for the most part i have fantastic in-laws. the one negative aspect of my in-laws is the way they refer to certain ethnic groups. they are very close-minded, prejudiced people who use offensive words to describe someone's race, color or religion.\ni can live with it, but i don't want our son to hear talk like that from people he is supposed to respect.\nis there a tactful way to ask my in-laws to please refrain from making ethnic slurs around our child? or should i let them say what they wish and continue to dispute what they've said after they leave? open for suggestions",
   "year": 1989,
   "month": 9,
   "day": 12
 },
 {
   "letterID": 296,
   "topic": "In-Laws",
   "title": "Mother's Rules for Marriage Brought Lifetime of Happiness",
   "text": "my wife, our 4-year-old daughter, \"betsy,\" and i went to my in-laws' for dinner recently. within 30 minutes of our arrival, my mother-in-law had called her husband \"stupid\" and \"dummy.\" everyone heard it, including betsy. now, she uses those words when speaking of her grandfather.\nmy wife tolerates her mother's behavior, but i find it humiliating to witness. at home i am able to discipline betsy, but i don't want to have to discipline her when she's at her grandmother's.\ni have mentioned this to my in-laws on several occasions, but the situation recurs. we live only a few blocks from them and frequently eat together. should we sell our house and move 10 or 20 miles away? -- a father in tacoma",
   "year": 1996,
   "month": 2,
   "day": 1
 },
 {
   "letterID": 671,
   "topic": "In-Laws",
   "title": "Father in Law's Fish Story Reveals His True Character",
   "text": "two weeks ago, i went on a fishing trip with my father-in-law. it was great. i caught the biggest fish of my life. i kept it so i could have it mounted when i returned home.\nwhen we arrived back at my in-laws', my father-in-law took the fish out of the cooler and claimed he had caught it. at first, i thought he was joking, but now he's planning on having the fish mounted!\ni didn't want to make him look bad in front of his daughter and his wife, but i am furious. my wife thinks i'm overreacting, but this really is the big one that got away. should i confront him and call his bluff? -- something's fishy in new york",
   "year": 2009,
   "month": 8,
   "day": 10
 },
 {
   "letterID": 1052,
   "topic": "In-Laws",
   "title": "Spouse Can't Fix What's Broken Between Wife and Her Mother",
   "text": "my wife and i met four years ago, have been married for two and i still haven't met her mother. my mother-in-law, a homophobic, self-proclaimed \"evangelist prophet,\" refuses to acknowledge our union.\nher behavior upsets my wife, which angers me to the point that i have no desire to ever cross paths with her. my wife sometimes cries about this wedge in their relationship, which only makes me resent my mother-in-law more. is there something i should do or say to either of them that might possibly help all of us deal with this turmoil a little better? -- frustrated lesbian-in-law",
   "year": 2017,
   "month": 8,
   "day": 11
 },
 {
   "letterID": 315,
   "topic": "In-Laws",
   "title": "Family Trip of a Lifetime Has Trouble Getting Off the Ground",
   "text": "my parents have invited my wife and me and my two sisters and their families on a 12-day cruise at their expense. they have never made such a trip before, and my father's declining health may make traveling impossible in the future. both my wife and i get along with my parents very well. we see them once or twice a year.\nour problem: they have invited only grandchildren who are more than 6 years of age. there are many reasons: small children would make the trip less relaxing for everyone; there are a variety of programs for children aged 6 and older, but not younger; the cabins accommodate only groups of four; and younger children wouldn't remember the trip anyway.\nmy wife and i would be taking two of our children and leaving two -- ages 2 and 4 -- at home. one of my sisters would be leaving two of her four children at home, and my other sister would be leaving both of hers. we have a very reliable friend who has taken care of all of our children when my wife and i have gone away together (for as long as six days), so that's not the issue.\ni see this as a wonderful opportunity. our older children would have the time of their lives, and while i'd miss the younger ones, i also know they would be just fine. my wife, however, feels it would be difficult for the 4-year-old. although neither of us feels he would suffer permanent emotional scars, my wife says she wouldn't enjoy the trip if she had to worry about him. she feels put on the spot by my parents by being forced either to be the party pooper or to do something she feels uncomfortable about.\nshe says it would be much easier on the 4-year-old if we took none of the children, but i would love to share this experience with the older ones. she has offered to stay home while i take the older two, but i like that idea even less.\nthe issue has been tabled for the last three months, but our positions have not changed. i'm unwilling to concede that the trip, as planned, needs to be scrapped. she's unwilling to concede that it would be no big deal to leave the two younger children at home.\nhow should this be resolved? -- one family's fortune",
   "year": 1997,
   "month": 3,
   "day": 13
 },
 {
   "letterID": 1060,
   "topic": "Cheating",
   "title": "Mom Dotes on New Boyfriend at the Expense of Her Kids",
   "text": "my wife, \"rita,\" and i separated a year ago. our divorce is pending. the man she's seeing, whom i believe she was cheating with before we split, has a violent criminal past. he has already cheated on rita with his ex-girlfriend, the woman who had him locked up in the first place.\nrita caters to him to the point that she ignores our kids. when he shows up, they often \"retire\" to the bedroom and my children are on their own for dinner. she even paid his bail when we were supposed to be saving for our daughter's school trip, which meant i ended up paying her half.\nshe is oblivious. she believes the kids want to spend time at my place only because there's a game system here. our daughter is slightly overweight, and rita and i had agreed to make sure we keep up her self-esteem. i don't think rita's behavior is helping in this area at all.\nmy kids want him gone. they have expressed this to their mother, but she keeps making excuses to keep him around. they have told me she comes apart when he's not there. could she be terrified of being alone? is it possible to make her realize how this is affecting our kids? or am i making too much of all this? -- perplexed in minnesota",
   "year": 2017,
   "month": 6,
   "day": 7
 },
 {
   "letterID": 0,
   "topic": "In-Laws",
   "title": "PEN MIGHTIER -- AND SAFER -- THAN CONFRONTATION",
   "text": "my wife's mother died nine years ago. six months later, her father married a woman who had been married twice before.\nrecently, my father-in-law informed my wife that he was excluding her from his will and was leaving his entire estate to his new wife.\nmy wife is 40, her father is 70, and his new wife is 50. my wife is an only child.\nmy question: how should my wife treat her father?\nr.",
   "year": 1985,
   "month": 1,
   "day": 23
 },
 {
   "letterID": 73,
   "topic": "In-Laws",
   "title": "TEEN RESENTS GRANDPA'S 'FRIEND'",
   "text": "my son, \"charles,\" who is almost 14, has always had a wonderful relationship with my father-his grandfather-until a few months ago. for about a year and a half, charles would stop at his grandpa's on the way to school, and they would have breakfast together. charles even had a key to dad's house, and would start preparing breakfast while dad was shaving.\nthis, of course, was on school days. however, one saturday morning, charles had to be at school to practice for a play. he went to his grandpa's as he usually did on school days, let himself in with his own key and found grandpa having breakfast with an attractive lady-both in their pajamas!\ncharles never did go to school for play practice. instead, he stormed home and locked himself in his room. now he will talk to no one, and rushes out of the room when his once-beloved grandpa visits us. we are all terribly upset by his attitude. dad is heartbroken because he can't seem to get through to his only grandson. dad has been a widower for over eight years. the lady is well-known to my wife and me. she is a lovely person and a widow.\nhow can we get through to charles and persuade him that dad has not committed a terrible crime? don't suggest our minister, abby. he is rather conservative and does not approve of \"living in sin.\" canadian dad",
   "year": 1987,
   "month": 8,
   "day": 27
 },
 {
   "letterID": 124,
   "topic": "In-Laws",
   "title": "Wife resents mate's snooping",
   "text": "my wife and i recently stayed overnight with my parents at their country home. we had a good time, but something bothered me.\non one occasion, i spontaneously gave my wife a gentle kiss just to say, \"i love you.\" my father said, \"please confine that sort of thing to the bedroom.\"\ni suppose i should mention that both my parents are very uptight about showing affection publicly.\nmy wife and i are quite affectionate, but we don't overdo it in public. we enjoy seeing other couples holding hands or walking arm in arm; it gives us pleasure to know that other couples are as affectionate as we are.\nabby, how do you feel about showing affection \"outside of the bedroom?\" or are there some \"rules\" we're not aware of? in love in florida",
   "year": 1989,
   "month": 8,
   "day": 3
 },
 {
   "letterID": 450,
   "topic": "In-Laws",
   "title": "Boyfriend's Disappearing Act Leaves Woman in Suspense",
   "text": "i have been married to \"ginny\" for two happy years. my wife is the best. she's understanding, loving and, most of all, my best friend.\nthe only problem is her parents. don't get me wrong, i love them dearly and have known these folks since i was 12. ginny's dad has been my pastor a good portion of my life in our small town.\nwhat bothers me is the fact that my in-laws won't let us fall down! whenever ginny and i are faced with any type of financial difficulty, her parents find out about it and insist on helping us. well, it doesn't help.\ni've tried to tell ginny how important it is to live within our means. she just keeps on spending because she knows her mom and dad will bail us out.\ntime after time, i've tried to politely refuse their offers of help, to no avail. they end up giving the money directly to ginny. abby, can you come up with some advice on what i can do? -- bothered in nebraska",
   "year": 2002,
   "month": 9,
   "day": 2
 },
 {
   "letterID": 822,
   "topic": "In-Laws",
   "title": "Texting With Friends Leads Girl Into Chat Room Trouble",
   "text": "i am a healthy, active older man who is in love with a woman my age. coincidentally, we are in-laws. her husband and my wife are both deceased. having known each other for many years, we are very close and have found renewed happiness with each other. we are in love.\nour adult children tell us we are not being rational. our peers see nothing wrong with it. do we ignore our children's advice and seek happiness together for the next few years? please tell me something that makes sense. -- confused retired engineer",
   "year": 2012,
   "month": 7,
   "day": 25
 },
 {
   "letterID": 244,
   "topic": "Cheating",
   "title": "THE PERFECT PRESENT FOR THE GRANDCHILDREN",
   "text": "approximately 20 years ago, my wife had an affair, which devastated me. however, we stayed together, even though i periodically raised questions about the activities between her and her lover.\nrecently i started pressing for more intimate details. when she refused to satisfy my curiosity, in order to get even, i told our children about their mother's affair. what a mistake! now they tend to take their mother's side more than mine.\nhow can i redeem myself with my children and improve my relationship with my wife?\nrepenting in south carolina",
   "year": 1994,
   "month": 12,
   "day": 6
 },
 {
   "letterID": 902,
   "topic": "Cheating",
   "title": "Clandestine Family Affair Needs Complete Confession",
   "text": "i recently found out my daughter has been having an affair with her sister's husband. this will tear our family apart. it will also have a huge impact on my grandchildren.\ni have not yet told my wife, who will be devastated, but i'm having trouble carrying this burden alone. i feel they should be held accountable. should i look the other way, or make them responsible for their actions, knowing the hell it will create? -- stressing in the usa",
   "year": 2014,
   "month": 11,
   "day": 26
 },
 {
   "letterID": 533,
   "topic": "Cheating",
   "title": "Husband Wants What's Best for His Wife Even Divorce",
   "text": "last night i was having trouble accessing the internet on my computer and wanted to see if my wife's laptop was having the same problem. when i opened her computer, i found she had left open an e-mail from a family friend, and my name caught my eye.\nthe letter was about how much he and she loved each other, and what they should do about it because they didn't want to hurt me.\ni didn't read any further, and i haven't mentioned to my wife that i saw it. i can understand what's behind it -- i'm almost 40 and i've gained a lot of weight in recent years. i have never been a great husband, and my wife has made it clear she doesn't feel the same way about me as she once did. the man who wrote to her is a really nice person, and i trust both of them enough that i doubt there is anything physical going on. they're just trying to deal with their emotions. complicating things, my wife and i have an 8-year-old daughter.\nwhat should i do? i want my wife to be happy, and maybe she'd be happier with him than with me. i know she wouldn't want to hurt me, so i'd rather not let her know how badly this has wounded me because it would make her feel awful. counseling is pretty much out of the question, because she would not be comfortable with that.\ni feel like all i can do is find a way to get out of the picture and let her go on with her life, but i hate the thought of being away from her and our daughter because i love them both very much.\ndo i have any options here, or am i as trapped as i feel? -- devastated in santa monica",
   "year": 2005,
   "month": 6,
   "day": 27
 },
 {
   "letterID": 358,
   "topic": "Cheating",
   "title": "Confused Wife Would Take Husband Back Despite Abuse",
   "text": "i recently divorced my husband of nine years because i found out he was having an affair. he actually introduced her to people that we both knew. i ended up hiring an off-duty police officer so i could get the proof (pictures). it turned out she was one of my husband's co-workers, and the affair had been going on for three years. i ended up divorcing him, but the woman's husband decided to forgive her.\nmy ex hates my guts because she chose to remain with her husband.\nabby, i am so ashamed. how could i not have known? we had not slept together since our daughter was born; she is 6 years old now. he blames the whole affair on me. he says i was not doing my wifely duty and that's what made him cheat. well, i just didn't feel that close to him. he had been verbally and physically abusive prior to our daughter's birth and afterward. he was terrible to my parents and called them names. he never paid any bills nor helped me with our daughter.\nto this day he hates me so much he can't stand to look at me because he has to pay child support. he has every other weekend with our daughter, and it kills him to come and pick her up. he was a sorry excuse for a husband and not much better as a father.\nthe problem is -- if he wanted to come back, i believe i would take him back. why do i feel like this? is there something wrong with me? do i need counseling? -- dazed and confused",
   "year": 1999,
   "month": 12,
   "day": 24
 },
 {
   "letterID": 870,
   "topic": "Cheating",
   "title": "Man Tries To Save Marriage After Cheating On His Wife With Her Teenage Cousin",
   "text": "i'm a 33-year-old man who has screwed up his marriage. i stupidly had a fling with my wife's 16-year-old cousin and got in trouble for it. i never lied about it because i knew it was wrong, and i am deeply sorry for it. it happened more than a year ago. i ended up serving time in jail.\ni love my wife. she is my best friend. we have no kids, just some great dogs and horses. we were very close until i went to jail, and the last day i was in there i got served with divorce papers.\ni can't blame her for how she feels. she says she loves me but she's too hurt to continue. i love her and i'm devastated that i can't fix this.\ni have known her for 20 years and she means so much to me. i want to save our marriage, and for the last year i have expressed repeatedly how sorry i am. any advice? -- sorry in tennessee",
   "year": 2013,
   "month": 7,
   "day": 6
 },
 {
   "letterID": 379,
   "topic": "Cheating",
   "title": "Passion Cannot by Itself Be Foundation for Solid Marriage",
   "text": "you printed a letter from \"k,\" a woman who has been dating a wonderful man for 18 months. she loves him with all her heart, but thought she would rather be his friend than permanent partner. you advised her to break things off, so that both of them may be free to find \"true love.\"\nabby, that helps perpetuate one of the saddest lies of human existence. \"chemistry\" and \"magic\" -- as you call them -- have almost nothing to do with love. passion and lust, as such, are illusions that hold empty promises and fade quickly. why do you think there are so many more failed and broken relationships than happy, lifelong ones? because people believe these lies are indicators of love, and search again and again for them when they fail to fulfill.\nlove is eternal and ever-present. love is also more closely related to friendship than passion. if you polled successful marriages, you would find that the most committed partners claim they were best friends first. passion is certainly exciting and part of the shared experience between partners, but true intimacy grows from trust and friendship -- not from the fear that lustful illusions bring.\nat one time, my wife was like \"k.\" it took seven long years for my patient love to find its way into her heart, but we've been happily and passionately married ever since! true love never walks away from another. i hope \"k's\" boyfriend hangs in there and shows her what love is really all about. -- bruce culp, vero beach, fla.",
   "year": 1999,
   "month": 1,
   "day": 23
 },
 {
   "letterID": 819,
   "topic": "Sex Life",
   "title": "Girl Abused by Grandfather Is Reluctant to Open Up",
   "text": "i love my wife very much, but over the years we have drifted apart. at one time we considered separating, but we went to a marriage counselor and worked most things out.\nmy wife is the only woman in the world for me, but my feelings are at the bottom of her priorities. i give her nightly foot massages and tell her how much she means to me. she never returns any pleasures. she has told me that sex is not enjoyable for her and she does it only to please me.\ni love her dearly, however the romance is gone. is it possible to rekindle the long-lost fire? -- lonely, unimportant husband in north carolina",
   "year": 2012,
   "month": 8,
   "day": 15
 },
 {
   "letterID": 644,
   "topic": "Cheating",
   "title": "Twins' Candlelight Birthday Celebration Gets Snuffed Out",
   "text": "i have been dating a lovely woman, \"bethany,\" for the past seven months. i'm 30 and bethany is 29. she's a teacher, and i work in health care. we met online, then talked on the phone and eventually decided to meet.\nabby, i was attracted to her from the moment i saw her. over these past months i have bonded with bethany's family and have fallen in love with her. i would like nothing more than to make her my wife. i haven't asked her yet, although we have joked about it.\ntwo nights ago we went to dinner, and the whole time something felt \"off\" to me. when we returned to bethany's place, she informed me out of the blue that she would like to take a break from \"us.\" she said she feels rushed into a new relationship without having closure from her previous one, which lasted six years and was difficult.\nbefore i became too upset, i got up off the couch and left. we haven't talked since, as i want to give her the \"space\" she has requested. i love bethany, and i'm afraid i am going to lose her. how long should i go without making contact with her? -- troubled in jacksonville, n.c.",
   "year": 2008,
   "month": 2,
   "day": 23
 },
 {
   "letterID": 539,
   "topic": "Cheating",
   "title": "Husband Asks if Torn Marriage Can Be Stitched Back Together",
   "text": "after six years of marriage and a beautiful daughter, my wife, \"chanelle,\" demanded a separation. she said she needed time to \"find herself.\" she forgot to mention that she was having an affair with a subordinate at work, \"earl.\" eventually, earl's wife and i found out. chanelle lost her job, her boyfriend and her self-respect.\nsuddenly she wanted me back. i wasn't sure i could live with a woman who had lied and cheated on me.\nafter a year later, chanelle became pregnant with our son, who is due in a few months. i'm positive the baby is mine, so we decided for the children's sake to reconcile.\ni still can't forgive chanelle for the affair. she used a string of lies to cover her activities, so i'm having severe trust issues. i was faithful throughout our marriage. while we were separated, i frequently lent her money and ran errands for her. at the time, she told me she hadn't been in love with me since the birth of our daughter. now i feel used.\nduring our separation, i made sure our daughter called chanelle's parents every night. we spent holidays with them while chanelle worked. instead of thanking me for it, they insist that i drove their daughter into the arms of another man. to make things worse, my parents refuse to accept chanelle back into the family.\nin all fairness, chanelle was the last person you'd think would have an affair. she was family-oriented and had conservative values. earl was the last person you'd imagine she'd choose. he's a chain-smoking, married redneck with a history of infidelity.\nboth sets of in-laws are trying to sabotage the marriage, my feelings for my wife have changed, and i now realize i never really knew chanelle at all. can this marriage be saved? -- shaken, not stirred in west virginia",
   "year": 2005,
   "month": 5,
   "day": 12
 },
 {
   "letterID": 386,
   "topic": "Cheating",
   "title": "Couple Mends Broken Marriage Through Forgiveness and Love",
   "text": "to those who wonder, \"can people fall back in love after having an affair?\" the answer is yes. here's what happened to me:\nsix years ago, my wife found out that i had been having an affair with a woman at work for more than three years. her husband called my wife and told her all the details. it happened five days before christmas, and i had to call both our families to explain why we would not be attending the holiday gatherings. i also had to explain to our teen-age daughter why i was moving out of our home.\nwe are a very close family, and when i faced the ugliness of what i had done and the hurt i caused, i realized what a fool i'd been.\nafter convincing my wife that i would do absolutely anything to stay married to her, she allowed me to move back home and seemed willing to give it a try.\nwe worked with a wonderful counselor who helped us to rediscover each other, and we fell in love all over again -- 25 years after we'd done it the first time. we also became best friends, and truly have a dream marriage now.\nabby, i will always feel guilt and sadness about what i did. however, love and forgiveness gave us a way to begin again. -- blessed in alabama",
   "year": 2000,
   "month": 11,
   "day": 13
 },
 {
   "letterID": 913,
   "topic": "Cheating",
   "title": "Illusion of Perfect Marriage Is Shattered by Man's Discovery",
   "text": "i always thought that \"lana,\" my wife of 14 years, and i had the perfect marriage. when i discovered she was having an affair, it hit me like a train wreck. after many weeks of trying to discover who she really is, i found out she has had several affairs throughout our marriage.\ni still love my wife and feel i could forgive her and regain my trust in her. the problem is, she says she is trying to recover from her actions, so she can no longer hear about my problems or respond to any of my questions.\nlana is now saying i need to see someone to discuss our issues with. we are already seeing a marriage counselor, but i suspect he is too connected to us as a couple. what do you think? -- lost in limbo",
   "year": 2014,
   "month": 9,
   "day": 25
 },
 {
   "letterID": 753,
   "topic": "Cheating",
   "title": "Parents Must Maintain Contact With Daughter Needing Support",
   "text": "what would you say is the difference between a friendship and an emotional affair? -- unhappy wife in pennsylvania",
   "year": 2011,
   "month": 11,
   "day": 20
 },
 {
   "letterID": 381,
   "topic": "Cheating",
   "title": "Man Gives Up His New Love in Order to Take Back His Old",
   "text": "i can't decide what to do. i am a 44-year-old man. in 1996, my wife left me after 19 years of marriage. i have one daughter who stayed with me during the separation.\nduring the first year of our split, i tried very hard to persuade my wife to return home, even though i knew she was having an affair with a married man.\nin 1997, i finally gave up on wooing her back and started seriously dating a wonderful younger woman. soon we were madly in love. all my friends and my daughter fell in love with my new love.\nmy wife, waiting our divorce, saw what was happening and decided she wanted to come back home. after trying so hard for so long and for my daughter's sake, i decided to take my wife back and try again. it has been very difficult. we've been seeing a marriage counselor, but we fight all the time. every time there's an argument i think of my lost love. we never fought. my wife is very strong-willed and extremely jealous of every woman who speaks to me, although i never cheated on her.\nmy girlfriend was heartbroken when i broke it off, but she has stayed out of my life for the last six months because she doesn't want to be a home-wrecker. she now knows things aren't going well at home. i have called her a couple of times. she has made it clear she wants me back, but only after the marriage is over.\ni am ready to give up again on my wife. she knows i am not happy, and blames me for not trying hard enough. my wife hasn't slept in our bed for two weeks. my friends see the stress and tell me i should go with my heart. i'm torn about what to do. can you help me decide what would be best for everyone involved? -- mixed-up in missouri",
   "year": 1999,
   "month": 1,
   "day": 9
 },
 {
   "letterID": 620,
   "topic": "Cheating",
   "title": "Husband Is Racked by Guilt Despite Avoiding Temptation",
   "text": "i have been happily married for a number of years. i'm not what you would call \"hot\" - far from it, actually. but for some reason, women have always been attracted to me.\nit doesn't matter where i work, there always seems to be some woman coming on to me. i have never cheated on my wife -- never! i have always told the interested party that i'm married and love my wife and kids, and would never do anything to destroy what we have.\nabout a year ago, my wife and i hit a rough spot. i met a woman who was having problems with her boyfriend. we were attracted to each other and became quite close. we never did anything physically. we never spoke of love, and both recognized that we were only infatuated.\nmy problem is this is the first time i was really tempted. i resisted, thank god, but feel terribly guilty about it. my head says telling my wife would help relieve my guilt, but nothing else. ultimately, it would hurt her.\nbecause nothing actually \"happened,\" should i listen to my head, or should i go with my heart, which says to tell her everything? this is eating me up inside. -- consumed by guilt in n.y.",
   "year": 2008,
   "month": 10,
   "day": 6
 },
 {
   "letterID": 883,
   "topic": "Cheating",
   "title": "The Harder Husband Works, the More His Wife Cheats",
   "text": "i am a 47-year-old male, married for 26 years. i am hopelessly in love with my wife and still see her as the most beautiful woman in the world.\ni have always been self-employed and have sometimes been at the extremes of feast or famine. during the bad times, i often worked 110-plus-hour weeks to save the ship.\neach time things have gotten really bad, my wife has had an affair to make up for the time, money and attention i can't provide her. i found out about her latest affair (her third) when i found a secret cellphone in her purse. for the last eight months, when she visited our daughter at college, she would check into a hotel with her lover.\ni feel responsible for failing to meet her needs. she doesn't want a divorce, but admits she doubts she will ever fully stop dating, and says the effort she puts into deceiving me is proof she loves me and doesn't want to hurt my feelings.\ni am amazed at the number of men willing to have sex with a married woman. my heart is broken, and i feel like a failure. am i a fool to keep fighting for her? -- hopelessly in love",
   "year": 2013,
   "month": 4,
   "day": 19
 },
 {
   "letterID": 332,
   "topic": "Cheating",
   "title": "Husband Hurt by Wife's Affair Ends Up in One of His Own",
   "text": "i desperately need some advice. i am a physician, married to a beautiful woman for 20 years, and we have three teen-age children. my wife and i are in our 40s.\nin 1995, my wife confessed she had a seven-year affair with my best friend. he would come to our house after i went to work and they would have sex in our bed. although my wife never showed me any affection during that period, i blamed it on the strain of raising three children, never suspecting her infidelity.\nshe let word of the illicit affair slip when i teased her about her old boyfriends. i was devastated, but i didn't let on. she apologized, and our marriage continued for the sake of the children. in the last two years, my wife has been especially loving and affectionate toward me.\nearlier this year, my married sister-in-law (i'll call her marie) stayed with us for four months. she confided to me that she had an unsatisfactory sex life with her husband. one thing led to another, and we slept together several times. marie has since returned home.\nnow i feel guilty and would like to confess this indiscretion to my wife to clear my conscience, but i am not sure how she'll react.\nthough it will even things out, i do not want to hurt my wife or expose marie's behavior. should i tell my wife about the affair with her sister? -- only human in kentucky",
   "year": 1998,
   "month": 8,
   "day": 9
 },
 {
   "letterID": 900,
   "topic": "Cheating",
   "title": "Ex-Wife Is Baffled That No One Warned Her About Husband's Cheating",
   "text": "i was married for six years and had three children with my husband. he always said he hated people who cheat on their spouse, but then he had an affair with a married co-worker, a woman who had three kids. we had a huge argument about it. i called her names and he beat me up. i called the police, he was arrested, jailed, and i filed for divorce.\nit has been six years and i have moved on, but i'm still angry over their cheating. they got married and invited mutual friends who knew of their affair. all of them attended the wedding.\nwhen i questioned a few of them about why they didn't tell me he was cheating on me, they said it was \"none of their business.\" (oddly enough, those people thought nothing of socializing with the cheaters.)\ni'd like to know how many of your readers would tell someone their spouse was cheating. i know i would, because affairs aren't innocent fun.\njust to add to the end of my story, my ex and his trophy wife are now divorcing after three years of marriage. the reason? he caught her cheating! -- the ex-mrs. in illinois",
   "year": 2014,
   "month": 12,
   "day": 10
 },
 {
   "letterID": 580,
   "topic": "Cheating",
   "title": "Man Discovers Wife's Old Affair Has Rekindled Online",
   "text": "i went into our home office and noticed that my wife had left her e-mail on. i spotted an odd name, so i opened one of the messages and my jaw dropped. it was from a man with whom my wife was having an affair. the e-mails were so graphic as to leave nothing to the imagination. this person is someone with whom my wife had an affair before we got together. he was going to leave his wife and live with her before we met, but when push came to shove, he stayed with his wife and just used mine for sex.\none of the messages discussed a planned meeting that did not take place -- only because he got stuck at work. she e-mailed him and told him he could stop by the house any night after 10 and have sex for an hour or two because our 5-year-old son and i were sleeping in other bedrooms!\nshe insists that \"nothing happened,\" which i have trouble believing. we have been seeing a therapist who believes my wife, and says that since \"nothing happened\" it wasn't an affair. i disagree. am i wrong? -- furious in new jersey",
   "year": 2006,
   "month": 1,
   "day": 20
 },
 {
   "letterID": 474,
   "topic": "Cheating",
   "title": "Soccer Mom's Criticism Is Way Out of Bounds",
   "text": "my wife, \"ruthie,\" and i have been together for 10 years and married for five. we have three beautiful children. last year, i caught ruthie having an affair, but i eventually forgave her.\nto this day, every time my wife leaves the house, i can't help asking her who she's meeting, where she'll be, what time i can expect her home -- and if she's going to cheat on me again. every once in a while, i still find strange phone numbers in her pocket or purse. when i call, the men always say they didn't know ruthie was married. then they quickly break it off with her.\nabby, i want my marriage to last. i love my wife with all my heart. what can i do to make my marriage to ruthie better? -- kentucky husband",
   "year": 2003,
   "month": 6,
   "day": 28
 },
 {
   "letterID": 723,
   "topic": "Cheating",
   "title": "Would Be Pilot Maps Out Life for Himself and Future Family",
   "text": "my wife and i have been married five years and have a beautiful 4-year-old daughter. two years ago, my wife cheated on three different occasions with three different men. each time she admitted her infidelity to me the following day.\ni was heartbroken. i have fallen out of love with her and no longer find her attractive. i didn't leave immediately because i didn't want our daughter to be raised in a broken home. also, my wife didn't have a job. i thought i could forgive her and get over it, but i can't and don't think i ever will.\nshould i leave her or stay in a marriage where i feel i am being unfair to myself and that i deserve better? please advise. -- betrayed in kansas",
   "year": 2010,
   "month": 6,
   "day": 24
 },
 {
   "letterID": 256,
   "topic": "Cheating",
   "title": "DAUGHTER'S LIFE BECOMES AN OPEN BOOK",
   "text": "i am writing to you for some advice. my wife and i have been married for five years. she is 34 and i am 39. no kids. we sleep together but have not had sex for eight months.\nfor the last 18 months, i have been having an affair with my old high school sweetheart. i will call her betty. betty is also married, but she doesn't love her husband. six weeks ago, betty found out she is pregnant. she can't tell her husband because she's afraid of what he might do to her. you see, he had a vasectomy (for his first wife), and he will know that betty's baby isn't his.\ni want to leave my wife, and betty wants to leave her husband so we can get married. how can we accomplish this with nobody getting killed? betty's husband has a terrible temper.\nin trouble",
   "year": 1994,
   "month": 5,
   "day": 14
 },
 {
   "letterID": 350,
   "topic": "Cheating",
   "title": "Husband May Leave His Wife Who Won't Leave Her Boss",
   "text": "i have been married for 21 years. we have two children, ages 12 and 9. i was a poor husband for the last 10 years -- unsupportive, overly critical, controlling and negative. all this led to my wife's having a two-year affair with her boss.\nafter i learned what was going on and filed for divorce, my wife asked for a reconciliation. my problem is that neither she nor her boss is willing to leave their job for a new position elsewhere.\ni am unable to see how we can rebuild our marriage as long as they continue to work together on a daily basis. she is his executive secretary. am i wrong to demand that this work relationship end? -- fred in michigan",
   "year": 1998,
   "month": 3,
   "day": 11
 },
 {
   "letterID": 407,
   "topic": "Cheating",
   "title": "Husband Suffers Double Dealing by Wife Who's Cheated Twice",
   "text": "you have helped so many people, i hope you can help me. i have been married more than 20 years, and we have two lovely daughters. everything was fine until my wife started to work as a secretary for a bank branch manager.\nwhen i found out they had been having an affair for nearly two years, it crushed me. i asked my wife if she wanted a divorce, and she said, \"no.\" i didn't either for the sake of the children and, strange as it sounds, i still loved her.\nshe agreed to quit working there, and about the same time the branch manager got transferred to a branch in another city, so i thought everything was all right.\nshe then took a job as a secretary to an attorney in a law firm. i became suspicious when i would call her at the office at 2 or 3 in the afternoon and was told, \"she and mr. 'jones' went to lunch and then to see a client to take a deposition.\"\na private detective discovered that the \"deposition\" was taking place in a motel! when i confronted her, she admitted that she and her boss were having an affair.\nwe saw a counselor and our pastor, but my wife insisted it was no big deal and everyone was doing it. she still doesn't want a divorce and assured me it was over as far as her cheating goes.\nshe now works in an office with only women, so i'm hopeful her cheating is a thing of the past.\nabby, how do i cope with the second infidelity, since it, too, lasted more than a year? i want to save our marriage because of the kids. i saw a psychiatrist, but he didn't help much. any advice, abby? i'm really hurting. -- can't forget in the midwest",
   "year": 2000,
   "month": 1,
   "day": 21
 },
 {
   "letterID": 535,
   "topic": "Cheating",
   "title": "Married Man Fears Discovery if Old Love Affair Resumes",
   "text": "fifteen years ago i had a years-long affair with a woman 23 years my junior. \"alex\" was 17 when we first had sex. i never led her on. i told her on many occasions that i would not leave my wife and family for another woman -- even her. i told her i'd meet her secretly for as long as she wanted, but i would commit to nothing more. alex accepted this state of affairs for several years, and we had what i considered to be the perfect affair. i loved the passionate, uninhibited sex.\nbecause i could offer no more than the status quo, i wasn't surprised when one night, after a particularly exhausting love-making session, alex announced she was ending our affair and moving to los angeles to be closer to friends. i begged her to reconsider, promised to spend more time with her, and insisted that i loved her. she went anyway. we had no contact other than christmas and birthday cards.\nmy kids are now grown and gone. on a recent business trip to la, i decided to give alex a call for old times' sake. she was delighted to hear from me and invited me over for a drink. it was just like old times. i wasn't there five minutes when she literally tore my clothes off.\nso what's my problem? alex just told me she might move back here and take up where we left off. abby, an affair like ours was fine 15 years ago, but i'm no longer comfortable sneaking around. my wife and i have been married 30 years and i don't want to hurt her or give her up. i'm afraid if alex moves back, we'll get caught. i still love her, and i certainly enjoy making love to her -- but how do i tell her that it's fine for us to sleep together in la where she lives, but not here in my hometown? -- in a quandary in the south",
   "year": 2005,
   "month": 6,
   "day": 22
 },
 {
   "letterID": 81,
   "topic": "Cheating",
   "title": "EX-WIFE RESENTS MISTRESS AS GUEST",
   "text": "i need to know how a person gets crab lice. my wife got them, then said she must have gotten them off a toilet seat at work. could she have been fooling around?\nplease tell me what percent likelihood it is that they came from a toilet seat, or an affair.\nthese doubts are damaging a very good marriage. must know",
   "year": 1987,
   "month": 11,
   "day": 10
 },
 {
   "letterID": 976,
   "topic": "Cheating",
   "title": "Despondent Husband Wants to Break Cycle of Cheating",
   "text": "i have been married twice. my first marriage lasted 20 years, the second one about four years.\nduring my first marriage, i started cheating seven months after our wedding. my wife knew about some of the affairs and stuck with me anyway. i finally felt so guilty for hurting her emotionally, i called it quits and married the last woman i cheated on her with.\nmy second marriage was in many ways better. i was able to remain faithful for more than three years before cheating again. i feel terrible that i have hurt another woman i loved, but i have now fallen in love with the woman i'm cheating with.\nit's like i'm in a perpetual cycle and don't know how to stop. i want this relationship to be my last one. i want to remain faithful and committed, but i'm scared to death i'll end up cheating on her and let us both down.\ni'm not proud of how i treated my exes, but i can't change the past. how do i change this pattern of behavior so i can be a faithful and devoted partner? -- cheater in michigan",
   "year": 2015,
   "month": 4,
   "day": 28
 },
 {
   "letterID": 95,
   "topic": "Cheating",
   "title": "SURVEY: MORE SAINTS THAN SINNERS",
   "text": "dear readers: last june i invited you to participate in a survey. the question: have you ever cheated on your mate? i received 210,336 responses: 149,786 from women, and 60,550 from men.\nthe results were astonishing: 22,468 (or 15 percent) of the female respondents said they had been unfaithful, and 15,743 (or 26 percent) of the men admitted they had cheated.\nputting it in more positive terms: 85 percent (127,318) of the women said they had been faithful and 74 percent (44,807) men claimed fidelity. surprised? so was i. for all the recent publicity the media have given the cheaters, there are far more faithfully wed couples than i had surmised.\nface it, friends, well-behaved, law-abiding folks seldom make the morning headlines, the dear abby column or the evening news, even though they far outnumber the transgressors.\ni had expected mostly postcards, but more than half the respondents wrote letters. and although this was to be an anonymous survey, upward of two-thirds of the respondents-cheaters and non-cheaters alike-signed their names!\nthe oldest respondent was a 99-year-old widower who described himself as a country doctor-now retired. he wrote:\n\"i've had three wives and cheated on all of them. wife no. 2 was the woman i cheated with while married to wife no. 1, who divorced me when she found out. when i was 66, wife no. 2 died; then i married the nurse i had been cheating with off and on during my first two marriages. (i also cheated on her until she died.) i was only 79 and still going strong, but i decided no more wives for me-only compatible housekeepers.\"\nthe youngest respondents wrote from indiana: \"we're both 18, we've been married for three months but we went together for nearly three years, and we haven't cheated yet.\"\nthis heartwarming letter came from harrisburg, pa.: \"thanks for asking. i am proud to say that in the 45 years i've been married to this wonderful woman, i have never cheated. and this includes two years during which i served with the u.s. navy. i had no girl in any port! my upbringing and moral values would never have allowed me to live in peace should i have strayed. furthermore, i'm sure my wife can make the same statement.\"\nthe most surprising revelation in this survey was the number of male bisexuals that surfaced. although mental health professionals in the past have estimated that 10 percent of the population is either gay or bisexual, my survey indicated that there are possibly twice that number. many are married with \"fine families.\" \"i am a 67-year-old male who has been homosexual (or bi) since i can remember. because of the social pressures of living in a small iowa town in the '40s, i married and remained married until my wife died. while married, i cheated whenever i could find a willing partner.\"\nfrom a vermont wife: \"married 36 years, we both had extramarital affairs. all mine were heterosexual, but i'm not sure about his.\"\n\"i'm female, 49, now divorced. fourteen years ago i had an affair with a close friend of my husband's. it lasted three years-until i caught him in bed with my husband. that ended my affair and also my marriage.\"\nmany wrote at length to justify their affairs: \"i was married to a wonderful man for 38 years. did i cheat? you bet i did! my husband was great at a lot of things, but a lover he wasn't. back in those days nobody ever spoke about a woman's need to be satisfied. i mentioned it a few times-even bought him a book on lovemaking-but he just looked at the pictures. he's been dead for 13 years. i'm 72, and if i could find a decent man who wasn't after my money, i'd go for it!\"\nfrom albany, n.y.: \"have i ever cheated? yes. am i sorry? no! we've been married for 22 years. i'm 48, and 'miss untouchable' is 47, and she hasn't had her nightgown off in 10 years. she announced, 'we have our family now. i've done my duty, so don't bother me'!\"\nhere's an upper: \"my husband and i just celebrated our 34th wedding anniversary, and if our sex life was any better, we couldn't handle it. i was 19 and he was 22 when we married. we were both virgins. i swear sex is the fountain of youth. my mother told me that the way to a man's heart was through his stomach, but i think i found a shortcut.\"\ntomorrow: more quotes from the survey.",
   "year": 1988,
   "month": 2,
   "day": 23
 },
 {
   "letterID": 376,
   "topic": "Cheating",
   "title": "Mother Is Tempted to Tattle on Daughter's Married Lover",
   "text": "maybe my experience will keep other hearts from being broken as mine was. i was involved with a married man. he swore he and his wife were breaking up; it was taking so long only because of the children. how could i have been so stupid?\nit happened two years ago, but only now am i seeing clearly. now i'm finally able to talk about it. i'm shocked how similar my experience has been to that of other women.\nthese men all say practically the same thing: \"you make me feel alive again.\" (i now realize that how you feel about yourself comes from within.) \"i can talk to you and you really listen.\" (i didn't have three small children underfoot demanding my attention.) \"my wife and i have a lousy sex life.\" (some even claim it's nonexistent, but their wives seem to get pregnant anyway. immaculate conception, perhaps?)\ntake it from me, ladies, what your married lover is telling you is what they all say -- and what he'll no doubt tell the next gullible woman who comes along. i was a fool. i feel guilt and sadness for the pain my actions caused my ex-lover's wife when she found out about our affair. i can only offer my heartfelt apology.\nto those of you who are having affairs -- please learn from my mistakes. the pleasure is dwarfed in comparison to the pain that's inflicted on so many people. it's just not worth it. -- ex-mistress in massachusetts",
   "year": 1999,
   "month": 2,
   "day": 22
 },
 {
   "letterID": 91,
   "topic": "Cheating",
   "title": "GOLF PUTS MARRIAGE PLANS IN ROUGH",
   "text": "three months ago, i married a very nice woman i'll call mary. everything seems to be going well except for one small item. mary and her \"ex\" (i'll call him john) continue to stay in close touch with each other. they were married for five years, but had no children because john didn't want children. he divorced mary two years ago, but continued seeing her for fun and frolicking (sex) until he met the woman to whom he is now married.\nnow, the problem: john has been married for a year and he continues to phone my wife to keep her updated on what is going on in his life. i can't understand why mary still bothers with him. john's wife is not aware of this keeping-in-touch business. i've told mary that i don't approve of it and i've asked her to stop. she says she will, but so far she hasn't. can you figure this out? and what should i do? bothered",
   "year": 1988,
   "month": 1,
   "day": 12
 },
 {
   "letterID": 763,
   "topic": "Cheating",
   "title": "Wife Performing in Sex Tape Doesn't Know She's a Star",
   "text": "my wife and i have been married for 10 years, and it is a wonderful marriage. we love each other very much, never argue and get along great. we have a 2-year-old child.\nrecently i found a \"sex tape\" online of my wife with the guy she dated before me. this video was taken without her knowledge and is from 13 years ago. because of this, i am not upset about it.\nmy question is, should i bring this to her attention, and if so, how? i feel she needs to know it's out there. i'm reacting to this as a man would. i don't know how a woman would react. please help. -- it's private",
   "year": 2011,
   "month": 9,
   "day": 14
 },
 {
   "letterID": 473,
   "topic": "Cheating",
   "title": "Husband Struggles to Forgive After His Wife's Second Affair",
   "text": "several months ago, i discovered my wife was having an affair with one of our closest single friends from church. their relationship had been going on for almost a year. this was her second affair in our 12-year marriage, and i'm about ready to cut my losses and file for divorce.\nmy wife has expressed great remorse for her mistake and claims that she will do \"anything\" to save our marriage. i am still very much in love with her -- and i have the happiness of our young son to consider. my wife and i are in counseling, but my feelings of betrayal and anger are so great that i don't know if i can trust her -- or any woman -- ever again. i feel as though i've not only been betrayed by my wife, but also by my \"friend,\" my church -- even by god.\nis it possible for a spouse who has a history of extramarital affairs to change? and if change is possible, how do i begin to trust again when the person i loved and cared for most in the world is the one responsible for my pain and misery? i would be grateful for any insight you can offer, abby. -- shattered in bluegrass country",
   "year": 2003,
   "month": 7,
   "day": 13
 },
 {
   "letterID": 824,
   "topic": "Cheating",
   "title": "Man Pays for One Night Stand With Seven Year Punishment",
   "text": "seven years ago, while on a business trip to europe, i went to a bar, got drunk and went back to my hotel with one of the \"hostesses.\" it was a one-night stand, but my wife found out.\ni quit drinking with the help of aa and have never had another affair. however, i am a sociable, friendly person, and i like to share laughs and light-hearted conversation with members of both sexes.\nalthough my wife claims to have forgiven me, she constantly brings up my \"fling\" and makes it clear that she doesn't trust me to this day, despite my repeated apologies, my desire to make amends and my determination never to do it again. she has made my life a living hell. she has an extremely caustic tongue that she uses at every opportunity to embarrass and humiliate me.\ni no longer love her, but her health isn't the best and she hasn't worked for several years. what can i do, abby? i feel so alone and stuck. -- desperate in the u.s.a.",
   "year": 2012,
   "month": 7,
   "day": 20
 },
 {
   "letterID": 382,
   "topic": "Cheating",
   "title": "Girl Wants to Date Younger Boy but Fears What Others May Say",
   "text": "after five years of marriage, i find myself in the middle of divorce proceedings. i'll spare you the gory details, but suffice it to say that my wife left me for a co-worker. luckily there are no children involved, so other than the emotional pain, the process is primarily financial at this point.\nas part of the proposed settlement, i am responsible for returning the personal effects she left behind when she abandoned our home. most items are easy to deal with, such as clothing, shoes, etc. however, other things are causing a dilemma for me. these are the items that have a connection with our marriage. in particular, i'm troubled by what to do with our wedding album.\nin one sense it represents a part of my life and my family history, even though it's been painful. on the other hand, the album is a reminder of the failure of our marriage and the promises that we made to each other. its financial value is virtually nil, and she has not explicitly requested its return. i want to do the right thing, but not at the expense of my own well-being.\nabby, can you please offer your thoughts on how to deal with this while still remaining a gentleman? -- feeling torn in pittsburgh",
   "year": 2000,
   "month": 12,
   "day": 22
 },
 {
   "letterID": 96,
   "topic": "Cheating",
   "title": "SURVEY: FAITHFULS AND PHILANDERERS",
   "text": "dear readers: in my fidelity survey that brought over 210,000 responses, i was both astonished and reassured to learn that the marriage vow-to forsake all others-is still honored by 85 percent of the females and 74 percent of the males who responded.\nfred case, a seattle times reporter, called the other day, and in a charming british accent asked: \"does your survey bear out what lord byron wrote in 'don juan': 'there's more adultery where the climate's sultry'?\"\ni told fred that we were not tabulating the findings regionally, so his guess was as good as mine. i did, however, observe that canadian behavior appeared to be no different than american, though the climate is somewhat sultrier in our southern states.\nmany respondents aired their frustrations in order to justify their philandering: \"occasional affairs with call girls keeps me sane,\" confided an investment broker on his business stationery. \"it's the only way i can tolerate the emptiness of living with a woman who is unable to show any affection through physical intimacy.\"\nwomen, too, wrote to justify their infidelities. the most common complaint: \"sex with my husband is so mechanical and unromantic. no caresses, no compliments, no love talk. he never talks to me. it's so humiliating!\"\nanother unfulfilled wife wrote: \"yes, i cheated on my husband. after nine years of marriage, i got bored and curious and wanted to see what else was out there. i had a real estate agent, an accountant, a jeweler, a commercial airline pilot, a construction worker and a magazine editor. the construction worker was the best and the editor was the worst. thank god this was long before aids.\"\na denver wife wrote: \"my husband doesn't know how to make love, but he sure knows how to make money. i'd try to teach him a few things, but i'm afraid he'll ask me where i learned it.\"\nthe number of faithful older lovers was heartening. letter after letter described enduring, true-blue marriages from couples in their 60s, 70s and 80s:\nfrom st. paul, minn.: \"we're writing because we want to add to the number of couples who have never cheated. i'm 92 and my wife is 88. we've been married for 71 years, still have all our marbles and enjoy every aspect of married life, though we have slowed up some in recent years (arthritis).\"\na 60-year-old farmer from lexington, ky., wrote: \"married 36 years, never cheated. no sex relations for eight years now. the wife says she's through with that kind of stuff. if opportunity ever knocks, i'm afraid i'll be too old and deaf to hear it.\"\nsome men admit to cheating-but only occasionally. from philadelphia: \"i've been married for 24 years and cheated twice. once when i went back to my hometown for my 10th high school reunion, then again when i went back for my 20th (same girl). now i'm looking forward to my 25th reunion.\"\ni have enough material from this survey to write a book. and if i do, i will certainly include the following. some short takes:\n-\"male, age 39, married 16 years. income $55,000 a year. cheated? yes. but only out of town.\"\n-\"abby, please send me a list of females who have cheated in the tampa bay area. (i'm lonely but not necessarily desperate.)\"\n-\"female, married 66 years. i have never cheated on my husband. i am 83 and my husband is 89 and says he can't remember.\"\n-\"there are so many mismatched couples. when a man wants sex six times a week and his wife is satisfied with twice a month, that doesn't mean there's anything wrong with either one of them; they just have a lousy marriage. i have made a lot of women happy and i never broke up anybody's home-and i never neglected my own wife, either. if there is a hall of fame for lovers, i should be in it. i have to go now; my wife wants me.\"\n-and finally: \"i am a woman now 40, married 21 years and have cheated more times than i can count, but i will never cheat again. why? because i fear god, damnation, pregnancy, herpes and aids. besides, i found jesus.\"",
   "year": 1988,
   "month": 2,
   "day": 24
 },
 {
   "letterID": 137,
   "topic": "Cheating",
   "title": "Sulking could result from sickness",
   "text": "i know exactly what \"sulker's wife\" went through, because i was married to a woman who sulked off and on for 22 years. when i would ask her what was wrong, she always had the same answer: \"if you don't know, i'm not going to tell you.\"\nthe night our youngest son graduated from high school, we drove home in silence. my wife had been sulking for a week. i asked her: \"what's the matter? did i say or do something to upset you? please tell me what's the matter.\" her reply was, \"if you don't know, i'm not going to tell you.\"\nwhen we got in the house, i got my suitcases out and started packing my clothes. she looked at me in disbelief. i finished packing, then loaded my bags into my car and said goodbye.\nshe asked, \"what is this all about? what are you doing?\" my response: \"if you don't know, i'm not going to tell you.\"\nthat was 20 years ago. since then, i have been happily married for 18 years. sulker's ex-husband jerome, idaho",
   "year": 1990,
   "month": 2,
   "day": 2
 },
 {
   "letterID": 53,
   "topic": "Cheating",
   "title": "CHILD SUPPORT SHOULDN'T GO DIRECTLY TO THE CHILD",
   "text": "you be the judge: my husband, \"john,\" is a very young 66. he is also very handsome, charming and gregarious. we have an excellent marriage. john sings in the church choir and i am part of the audience. the choir director is a lively, 24-year-old woman who is fond of john. (i'll call her sandra.) sandra has a live-in boyfriend who also sings in the choir.\nsandra recently called our home and i answered. she asked to speak directly to john. i assumed it had something to do with choir practice. then i heard john laugh and say, \"i'd better ask my wife.\" well, it turned out that sandra had tickets for a musical and she asked my husband to escort her because her boyfriend was going to be out of town! (no mention was made of me.)\nwhen john asked if it would be all right with me if he escorted sandra, i said no, it wouldn't. he said i was foolish to take that attitude--all it involved was picking her up and acting as her escort for the evening.\ni held my ground. he insisted i was wrong to make a \"big deal\" out of it--all sandra wanted was an escort.\ni need to know from you, was i wrong to say no? or should i have told him it was all right with me when it wasn't? john's wife",
   "year": 1986,
   "month": 11,
   "day": 9
 },
 {
   "letterID": 449,
   "topic": "Cheating",
   "title": "Soul Mate' Turns Her Back on Man Facing Cancer Scare",
   "text": "i have been married for 18 years. two years ago, i met \"rita.\" she was \"the girl of my dreams,\" and we moved in together. our relationship was \"unstoppable.\" my wife and i began divorce proceedings.\nthree weeks ago, my doctor told me there was a good chance i had cancer. i needed more tests. i panicked and ran back to my wife and children. i wanted them to hear it from me. i told them i \"might\" get very sick from the disease and the treatment. i ended up going on a one-week vacation with my family. rita said she understood i needed to be with them.\non the first day of vacation, i realized how much i missed rita and decided to call her. there was no answer. when i called her the next day at her job, she said, \"i have moved on,\" and hung up. i was shocked because she had always told me we were \"soul mates and our love would never die.\" now she won't give me the time of day and has threatened to notify the police if i keep calling.\nabby, the irony is -- i don't have cancer. it's four small cysts. at my suggestion, my wife agreed to e-mail rita to tell her that i am not sick after all, and that she and i are not sleeping together. so far there has been no response from rita.\nnow i don't know what to do. i think rita broke up with me not knowing all the facts. what do you think? -- healthy and unhappy in ontario, canada",
   "year": 2002,
   "month": 9,
   "day": 3
 },
 {
   "letterID": 391,
   "topic": "Cheating",
   "title": "Door Slams Shut on Roommate Looking to Trade Up for Space",
   "text": "while on our honeymoon, my wife called her first love and set up dinner for the three of us. things were going well until i noticed she was looking at him with a little too much interest. she got upset with me when i mentioned it back in our honeymoon suite.\nlater, she told me if i didn't let her go see him alone she would divorce me. she went and offered herself to him. he told her no man should go through what i had to go through on his honeymoon -- and he sent her back to me.\nshe asked my forgiveness and wants to get on with our lives. i look at her differently now and am trying to love her as i did before, but it's hard. what do you think? -- almost jilted on the jersey shore",
   "year": 2000,
   "month": 9,
   "day": 30
 },
 {
   "letterID": 378,
   "topic": "Cheating",
   "title": "Man Reconciling With Wife Discovers Unexpected Rival",
   "text": "my wife and i recently got back together after a year's separation. i made a lot of mistakes and have been trying hard to make it up to her. we are now getting along better than ever.\nthere is, however, a terrible, nagging doubt in my mind. in the year that we were separated, my wife became good friends with a lesbian. i would never have suspected anything more than a good friendship existed, except for two reasons: first of all, things between us are great everywhere except in bed. i'm not the most sensitive guy, but her lack of enthusiasm in this department is obvious.\nsecond, one day last week i was supposed to meet her at her office for lunch. when i arrived, there was a note for me to wait in her office until she returned from a meeting. being curious about her various projects, i looked through her files. i came across a file with the gay woman's name on it. i couldn't resist. i read through it and was shocked. in the file was a collection of beautiful love letters and poems written by this woman to my wife. some of the poems were very erotic.\nabby, i can't stop thinking about the possibility that my wife was -- or still is -- lovers with this woman. it's torturing me. should i confront her with my suspicions or should i keep my mouth shut? -- tortured in oregon",
   "year": 1999,
   "month": 1,
   "day": 30
 },
 {
   "letterID": 613,
   "topic": "Cheating",
   "title": "Couple's Happiness Grates on Man Who Felt Betrayed",
   "text": "my first serious relationship lasted a year and ended more than eight years ago. \"stacy\" was terrific, but we were very different, and our relationship came to an amicable end.\nseveral months later, i heard that stacy had begun dating a close friend of mine, \"alex,\" soon after our breakup. needless to say, i was devastated. alex's betrayal was as painful or more so than that of stacy. i broke off all contact with them in an attempt to salvage my dignity. i haven't spoken to either one since.\nall these years later, i am happily married to a wonderful woman. i hear through the grapevine occasionally that stacy and alex are still together. whenever i do, i feel unaccountably upset. it's not that i'm pining for an old flame, because i wouldn't trade my wife for any woman on earth. i have thought a lot about it and believe i am clinging to the naive belief -- or hope -- that people who do unkind, deceitful things always come to regret it in the end.\ni am grappling with the guilt of wishing unhappiness for two people who are obviously happy together. i can't help it, but i know i'd be glad if i learned they'd broken up. i am confused and embarrassed about why i even still care. your thoughts, please? -- lacking closure in san jose",
   "year": 2008,
   "month": 11,
   "day": 29
 },
 {
   "letterID": 387,
   "topic": "Cheating",
   "title": "Man Strains to See Beyond Wife's Long Ago Infidelity",
   "text": "a year and a half ago, my wife of 18 years confessed to an infidelity i had feared in the back of my mind all along. in our second year together, i was in the military. we were stationed overseas. we had a small group of friends -- couples and singles -- who partied three or four nights a week. we never allowed the parties to get too crazy, but occasionally someone would sleep overnight on our couch if they weren't sober enough to drive home.\none evening i returned from work very tired, and after a few beers, i retired early. a few friends were still hanging around, but were leaving soon. it happened in the adjacent room with one of my best friends, while our 2-year-old and i slept.\nsince i found out the truth, i have experienced all of the emotions -- betrayal, sadness, shock, hatred, anxiety, denial, etc. after talking to two family counselors, three preachers, a psychiatrist, my parents, god, reading tons of books, fishing, taking countless long walks trying to reason why -- and finally attempting to talk to her alone -- what else can i do? (she refuses to discuss it further.) it still bothers me every single day. there has to be some relief from this continuous bad feeling i am trying desperately to get rid of.\nnothing has worked so far. i don't want to say divorce is the answer, because this happened so long ago. however, at times, it seems like it happened yesterday.\nonce again, what else can i do? -- living in a gray world",
   "year": 2000,
   "month": 10,
   "day": 18
 },
 {
   "letterID": 886,
   "topic": "Cheating",
   "title": "Don't Spill News About Old Affair",
   "text": "three years ago, i found out that my wife of 14 years was sneaking around behind my back with her high school sweetheart. i confronted both of them and it ended. i forgave her, but i still can't sleep at night because of something that's bothering me. his wife has no idea about the affair, and i feel guilty that i haven't told her about everything that happened.\nsome of my friends say i should call her and tell her, but now it seems like it happened too long ago to bring it to her attention. also, in an attempt to get her husband to come clean -- which he did -- i promised him i wouldn't tell his wife.\nmy wife and i have patched things up and we're having the best years of our life together. so the question is, should i break my word and possibly upset my new relationship with my wife so i can not feel this guilt? -- can't sleep in illinois",
   "year": 2013,
   "month": 4,
   "day": 10
 },
 {
   "letterID": 137,
   "topic": "Cheating",
   "title": "Sulking could result from sickness",
   "text": "i know exactly what \"sulker's wife\" went through, because i was married to a woman who sulked off and on for 22 years. when i would ask her what was wrong, she always had the same answer: \"if you don't know, i'm not going to tell you.\"\nthe night our youngest son graduated from high school, we drove home in silence. my wife had been sulking for a week. i asked her: \"what's the matter? did i say or do something to upset you? please tell me what's the matter.\" her reply was, \"if you don't know, i'm not going to tell you.\"\nwhen we got in the house, i got my suitcases out and started packing my clothes. she looked at me in disbelief. i finished packing, then loaded my bags into my car and said goodbye.\nshe asked, \"what is this all about? what are you doing?\" my response: \"if you don't know, i'm not going to tell you.\"\nthat was 20 years ago. since then, i have been happily married for 18 years. sulker's ex-husband jerome, idaho",
   "year": 1990,
   "month": 2,
   "day": 2
 },
 {
   "letterID": 789,
   "topic": "Cheating",
   "title": "Wife's Choice of Dinner Date Is Hard for Man to Swallow",
   "text": "my job requires me to travel out of town several nights a week, leaving my wife home alone. she recently invited a mutual (male) friend out for dinner during my absence. he's the other half of a couple we socialize with frequently. (his wife was also out of town.)\ni told her i was uncomfortable with it. i don't think married men and women should go out alone with members of the opposite sex. she maintains that it wasn't a \"date,\" that she was just having a meal with a friend.\ni value your opinion and would like to know how you feel about this. did i overreact? is it appropriate for a married woman to go out for a meal alone with a man other than her husband? -- feeling cheated on in illinois",
   "year": 2011,
   "month": 3,
   "day": 22
 },
 {
   "letterID": 873,
   "topic": "Cheating",
   "title": "Gay Or Straight, Avoidance Sends A Clear Message",
   "text": "i have been a widower for 15 years. i had kids at home, so restarting romantic life wasn't a priority after my wife died. ten years later, i realized i was no longer interested in women, and my love life since then has been with men. while i have never been vocal about it with family and friends, i assume they all probably know.\na couple of months ago, one of my male friends -- much younger than i and from my poker group -- came to my home to take me to lunch. i had always assumed he was gay. i made a pass and ended up seducing him. he was a great sex partner, but he changed his mind about going to lunch afterward. he has never shown up for poker since and no one has heard from him.\ni feel bad, but i am not ashamed and i would never say anything that would lead anyone to know what happened. should i contact my former friend and reassure him? he's a good man and i worry about him. -- missing a friend in miami",
   "year": 2013,
   "month": 6,
   "day": 19
 },
 {
   "letterID": 872,
   "topic": "Cheating",
   "title": "Dad Wonders If Lying To Kids Is Right Way To Handle Cheating Wife",
   "text": "i have been married for 19 years and this is the third time i have caught my wife cheating. i didn't catch her \"in the act\" because she disguised it behind \"vacations with her girlfriends.\" what happened was i caught her sending some guy nude pictures of herself and lying about having stayed at a friend's house. (she had spent the night with a guy.)\ni have remained in this marriage because i wanted to raise all my kids before separating or divorcing. i am leaving eventually, but want to stay four more years to raise my last son.\nis it immoral to lie and pretend like i want to work it out? i feel this is the best way not to damage my children. -- responsible dad in georgia",
   "year": 2013,
   "month": 6,
   "day": 24
 },
 {
   "letterID": 997,
   "topic": "Cheating",
   "title": "Wife's Job at the Gym Has Husband in a Sweat",
   "text": "my wife and i have been married for almost 11 years and have three children. about four years ago my wife cheated on me and left. after a six-week split, we decided we wanted to work things out. everything was great -- until recently, when she got a job working at a busy gym.\nseveral of the guys from the gym have added her on facebook and send her messages. they like all her posts and pictures. i work out there and when i go in, i see her laughing and joking with them. this has all started to bring me flashbacks to when she cheated.\ni tried talking to her about how i feel, but she just says they are my insecurity issues and i need to deal with them. at this point, i'm contemplating divorce so i won't go through the same pain i went through last time. i check her facebook page constantly to see if she has added any new guys and see what comments they are leaving. i know it's not healthy, and it makes me constantly depressed.\nmy wife has no interest in marriage counseling, but tells me i should seek professional help for my issues. is there any saving this marriage, or is it time to move on? -- threatened in texas",
   "year": 2016,
   "month": 12,
   "day": 1
 },
 {
   "letterID": 454,
   "topic": "Sex Life",
   "title": "Happy Marriage Can't Satisfy Husband's Sexual Longings",
   "text": "i am a married man in my 30s, with two adorable little babies at home. my sex life with my wife is very good. i have no complaints at all. my problem is my feelings.\ni love my wife and do not cheat; however, i desire other women. i have an instinctual desire to procreate. i can't afford more babies. in fact, my wife and i do not want more children.\nother women -- even women i find unattractive -- arouse me. as a result, i avoid looking at female co-workers and have become very disconnected at work. even though i don't act upon my instinctual urges, i still wrestle with them.\nabby, how does a man get past this? every woman i see makes me feel like i am in heat. -- fighting testosterone in twin falls",
   "year": 2002,
   "month": 7,
   "day": 12
 },
 {
   "letterID": 895,
   "topic": "Sex Life",
   "title": "Man Wants Wife Along for Ride to Take the Reins and Lead",
   "text": "do women ever initiate sex with men, or must they always be wooed, cajoled, begged or persuaded? i have a fairly good physical relationship with my wife, but it happens only when i make the overtures. i am left with the conclusion that either the physical act isn't that enjoyable or i am not very desirable.\nif every encounter must start with me, and my wife can take it or leave it, is she just doing me a favor? must sex always start with the guy, or can women demonstrate more overt interest? -- undersexed in ohio",
   "year": 2013,
   "month": 1,
   "day": 30
 },
 {
   "letterID": 469,
   "topic": "Sex Life",
   "title": "Mail Carriers Brave Rain, Sleet, but Stop at Spiders",
   "text": "i have been married for 30 years. my wife and i have not had sex for the past 20 of them. we have no children.\nmy wife does like undressing in front of me, but then she quickly covers herself. we are always friendly -- very friendly -- to each other. at night we sleep in the same bed, but we do not mention sex, and have not mentioned it for 20 years. can you give me some advice? -- reader in san francisco",
   "year": 2003,
   "month": 9,
   "day": 15
 },
 {
   "letterID": 889,
   "topic": "Sex Life",
   "title": "Dying Spark In Otherwise Good Marriage",
   "text": "can a sexless marriage last? my wife and i have been married for 17 years and our sex life has been slowing for a long time. we have sex less than 10 times a year.\nwe get along great and are the best of friends. my wife is attractive and fun to be with, and i don't know what happened to us. what causes women to lose their sex drive? (then they wonder why their husbands have affairs.)\nmy wife is in good health. there are no medical issues. we are more friends than lovers. i don't think she's involved with anyone else. i want a fun, active sex life, but i don't want to upset her or lose the closeness we have. it's just that i'm watching our sex life evaporate. please help. -- mike in missouri",
   "year": 2013,
   "month": 3,
   "day": 15
 },
 {
   "letterID": 409,
   "topic": "Sex Life",
   "title": "Husband Feels Happy Marriage Should Include Occasional Sex",
   "text": "my wife and i have been married 48 years, have raised three children and are in our early 70s. eleven years ago, my wife stopped having sex with me, saying she didn't think it was necessary. she said all her lady friends our age have stopped doing it, and also they sleep in separate bedrooms.\nam i wrong for feeling that sex is necessary for a happy marriage? -- hurt husband, redford, mich.",
   "year": 2000,
   "month": 1,
   "day": 5
 },
 {
   "letterID": 583,
   "topic": "Sex Life",
   "title": "Holiday Blues Chased Away by Reaching Out to Others",
   "text": "i keep reading that having sex regularly will improve your health and extend your life. however, my wife of 34 years has lost all interest in sex and keeps pushing me away. so what do i do? am i justified in taking on a lover on the side, discreetly, of course? -- considering it, san mateo, calif.",
   "year": 2007,
   "month": 11,
   "day": 26
 },
 {
   "letterID": 61,
   "topic": "Sex Life",
   "title": "WIFE DECIDES TO LIVE WITHOUT SEX",
   "text": "my wife, who is approaching 40 and in reasonably good health, has recently announced that she has no more interest in sex, and we have stopped all sexual relations. obviously i am not very pleased with this situation and have conveyed that to her in no uncertain terms. however, she has indicated that that's the way it is--and i had better learn to live with it.\ni don't believe my wife is seeing anyone else; she's just decided that she can live wihout sex. however, i can't, and i would like to know whether this is normal for a woman her age, and what do you recommend i do? i would appreciate an early response. frustrated in downers grove",
   "year": 1987,
   "month": 5,
   "day": 6
 },
 {
   "letterID": 237,
   "topic": "Sex Life",
   "title": "MAN IN COLD MARRIAGE WANTS TO WARM UP WIFE",
   "text": "my problem is my wife. she is a very good person in every way, but she has lost all interest in sex. we have been married for 11 years and have two wonderful children, but about five years ago, my wife made up her mind that she has had all the sex she will ever need.\nwell, maybe she has, but i haven't. don't suggest going to a counselor. she would never go. never! she has told me that she would rather have a divorce than start having sex again.\nabby, is there something i can slip into her food that would turn her on? it would have to be tasteless; otherwise she would detect it.\nwhen i was a boy, i heard older boys talk about putting spanish fly on gum and giving it to a girl. where can a person buy it? i will be eternally grateful if you can help me.\nbenny (not my real name)",
   "year": 1994,
   "month": 9,
   "day": 23
 },
 {
   "letterID": 558,
   "topic": "Sex Life",
   "title": "Husband's Limping Libido Sends Couple to Counselor",
   "text": "i want \"short on intimacy,\" the wife in her 20s with no sex life (10/26), to know that she is not the only wife out there who has this problem. i wish you could have heard some of the wild excuses my husband made about why he couldn't have sex. we have been in counseling for months because of this.\ni think it is so hard for us women because other men are always talking about wanting sex, and our husbands may even be acting like they want it. and then, when we get home, sex is the furthest thing from their minds.\nthrough counseling, i have realized that \"why\" may never be answered. the bottom-line question is, can i live the rest of my life this way or not? -- no answers in oklahoma",
   "year": 2006,
   "month": 12,
   "day": 5
 },
 {
   "letterID": 1064,
   "topic": "Sex Life",
   "title": "Man Is No Longer Happy With Tit-for-Tat Marriage",
   "text": "after 34 years of marriage, i realized that i must \"earn the right\" to have sex. this morning i agreed to go to a particular movie my wife wants me to see with her in exchange for sex.\ni now recognize that this trading started years ago, and i just let it slide. but now i realize that what i call \"trading for favors\" has entered other aspects of our relationship: \"do this for me, and i'll do that for you.\"\ni have a pretty thick skin, but more and more, i'm concluding this is a game that i'd rather not play. can you give me any advice as to where we can go for help? i have no problem involving her in any solution. -- must earn the right",
   "year": 2017,
   "month": 4,
   "day": 30
 },
 {
   "letterID": 466,
   "topic": "Sex Life",
   "title": "Teacher Regrets Lie That Ruined Principal's Career",
   "text": "my wife and i have a wonderful relationship. we have seen both good and hard times during our 30 years together. my problem is our sex life died about two years ago.\ni love my wife dearly. i don't want to hurt her, but i still have physical needs despite having had a stroke, a heart attack, four bypasses and arthritis. i have also been disabled since 1988 due to a back injury.\nabby, what can i do? my wife knows how strong my sex drive is, but she will no longer try anything sexual. please help. -- still sleeping (only) in the same bed",
   "year": 2003,
   "month": 11,
   "day": 17
 },
 {
   "letterID": 661,
   "topic": "Sex Life",
   "title": "Wife Draws Line in Bedroom in Battle Over Man's Smoking",
   "text": "my wife of 25 years, in an effort to get me to stop smoking, refuses to have sex until i quit. it's been more than a year since we made love.\ni love my wife with all my heart, and i always will. i plan to stop smoking, but not this way. she will not give in (or give out). i don't want to think of sex as her weapon, but it is. any advice on how to cope with my unwinnable battle? -- desperate in arlington, texas",
   "year": 2009,
   "month": 11,
   "day": 16
 },
 {
   "letterID": 110,
   "topic": "Sex Life",
   "title": "Little thief's reward upsets Mom",
   "text": "i lost my wife after having been married for 30 years. we had one of those very good marriages that are all too rare these days. she died a little over a year ago, but she was a very sick woman for the last two years of her life.\nafter my wife was diagnosed as terminal, she told me that she had heard (she didn't say where) that men over 50 are highly susceptible to cancer of the prostate if they go without sex for very long. is this true?\ni certainly hope not, because my religion forbids sex outside marriage and i am in no mood to date another woman, let alone go to bed with one.\nyou can print this if you think it will help others, but i respectfully ask you to withhold my name and the name of my town. sign me: over 50 and worried",
   "year": 1989,
   "month": 2,
   "day": 24
 },
 {
   "letterID": 801,
   "topic": "Sex Life",
   "title": "Wife Has a Few Choice Words on Man's Love for Sexy Lips",
   "text": "please help save my marriage. my wife of five years discovered an internet browser history of 13 web pages i had clicked on the previous day. the pages were of women's sexy lips. my wife is calling it \"porn\" and a \"gateway to porn.\" i feel guilty about it, but i told her it isn't pornography. i think it's a fetish. she says i'm using that word to get off the hook.\nwill you please tell her that this probably is a fetish? our sex life has not been the same since she discovered the images on the computer. what can we do about it in a way that will strengthen our marriage? -- not guilty as charged",
   "year": 2012,
   "month": 12,
   "day": 26
 },
 {
   "letterID": 373,
   "topic": "Sex Life",
   "title": "Wife Has Reason to Suspect Husband's Change in Routine",
   "text": "\"miserable\" said her husband brought home a steady paycheck and was raising her three sons by other marriages.\ni, too, am harassed by a jealous wife. unfortunately, her jealousy extends into my relationship with family and friends.\nlike \"miserable,\" my wife would probably say our sex life is \"so-so\" (or even worse). she also told me our infrequent sex makes her feel fat, old and unattractive.\nhowever, her physical appearance has nothing to do with her lack of appeal. it's the constant jealousy and lack of trust that pushes me away. her compulsion to ensure that i have no relationship with anyone but her has tainted our marriage. i wish she understood that trust in me would be the best cure for a sour relationship.\ni need interaction with others so i can better my relationship with her. how can i make her understand that this marriage will dissolve if she doesn't change her attitude? -- trapped and unhappy in new mexico",
   "year": 1999,
   "month": 2,
   "day": 28
 },
 {
   "letterID": 626,
   "topic": "Sex Life",
   "title": "Know It All Husband Needs a Word to the Wise From Wife",
   "text": "what do you think of marriages where the husband and wife merely tolerate each other and have little emotional connection? in our situation, my wife seems to accept that our marriage \"just is,\" but i feel that marriage should offer more.\ni would press for a divorce except for the fear of making matters worse. in this case, no children are involved. it's doubtful that counseling would change a thing. do we just stick it out after 25 years of marriage? -- loveless in georgia",
   "year": 2008,
   "month": 8,
   "day": 21
 },
 {
   "letterID": 819,
   "topic": "Sex Life",
   "title": "Girl Abused by Grandfather Is Reluctant to Open Up",
   "text": "i love my wife very much, but over the years we have drifted apart. at one time we considered separating, but we went to a marriage counselor and worked most things out.\nmy wife is the only woman in the world for me, but my feelings are at the bottom of her priorities. i give her nightly foot massages and tell her how much she means to me. she never returns any pleasures. she has told me that sex is not enjoyable for her and she does it only to please me.\ni love her dearly, however the romance is gone. is it possible to rekindle the long-lost fire? -- lonely, unimportant husband in north carolina",
   "year": 2012,
   "month": 8,
   "day": 15
 },
 {
   "letterID": 583,
   "topic": "Sex Life",
   "title": "Holiday Blues Chased Away by Reaching Out to Others",
   "text": "i keep reading that having sex regularly will improve your health and extend your life. however, my wife of 34 years has lost all interest in sex and keeps pushing me away. so what do i do? am i justified in taking on a lover on the side, discreetly, of course? -- considering it, san mateo, calif.",
   "year": 2007,
   "month": 11,
   "day": 26
 },
 {
   "letterID": 61,
   "topic": "Sex Life",
   "title": "WIFE DECIDES TO LIVE WITHOUT SEX",
   "text": "my wife, who is approaching 40 and in reasonably good health, has recently announced that she has no more interest in sex, and we have stopped all sexual relations. obviously i am not very pleased with this situation and have conveyed that to her in no uncertain terms. however, she has indicated that that's the way it is--and i had better learn to live with it.\ni don't believe my wife is seeing anyone else; she's just decided that she can live wihout sex. however, i can't, and i would like to know whether this is normal for a woman her age, and what do you recommend i do? i would appreciate an early response. frustrated in downers grove",
   "year": 1987,
   "month": 5,
   "day": 6
 },
 {
   "letterID": 899,
   "topic": "Sex Life",
   "title": "Internet Obsession Threatens to Consume Widower's Life",
   "text": "i am a 58-year-old recent widower. my wife and i were very happy for 29 years, and that included a satisfying sex life. although i am not ready to date yet, i continue to have a strong sex drive.\ni'm finding the internet is a good alternative to \"hooking up\" at this time. however -- and this is embarrassing to admit at my age -- i'm beginning to wonder if i have crossed a line into spending too much time online.\nmy question is, how much is too much? i want to be healthy and in balance with this, but for the first time, i understand how people can become addicted to internet porn. guidelines, please? -- just wondering in georgia",
   "year": 2014,
   "month": 12,
   "day": 17
 },
 {
   "letterID": 728,
   "topic": "Sex Life",
   "title": "Good Marriage Undermined by Couple's Bad Sex Life",
   "text": "my wife, \"alana,\" and i have been married for 14 years. in many ways our marriage is good, but our sex life is horrible. in my opinion, it has never been good. as time passes, i feel more and more anger toward her. alana is attractive and physically fit; i don't understand her lack of desire. when the subject of sex comes up, it makes us both clam up.\ni have been thinking of leaving her. we have become more like best friends than husband and wife. our two boys would be crushed if we split. i have not -- and would never consider -- an affair. what do you think about this? -- troubled husband in missouri",
   "year": 2010,
   "month": 6,
   "day": 3
 },
 {
   "letterID": 31,
   "topic": "Sex Life",
   "title": "IT'S NEVER TOO LATE FOR CHILDREN TO MEND FENCES",
   "text": "my wife refuses to have sex with me. she refuses to touch me, or let me touch her. this has been going on for six weeks because of something she says i said to her during an argument. (she won't tell me what it was.) further, she says she will continue to withhold sex until she is ready to change--it may be another week, month or year.\ni say she is using sex as a weapon to prove there is an area over which she has absolute control. what should i do? i can't live this way, and i don't want to end our marriage--but i think physical love is a necessary part of marriage. out in the cold",
   "year": 1986,
   "month": 1,
   "day": 26
 },
 {
   "letterID": 38,
   "topic": "Sex Life",
   "title": "CHILD, NOT LOVE, GIVEN UP FOR ADOPTION",
   "text": "my wife insists that it's the man's place to initiate sex. she says if i'm going to wait for her to initiate sex, there won't be any.\ni'm tired of always being the aggressor. i've told her i would find it exciting if she would approach me for a change, but she says it's not ladylike and she wouldn't feel comfortable making the first move.\nshe has never turned me down, and it's very satisfying to both of us when it happens, so what should i do? tired of arguing",
   "year": 1986,
   "month": 3,
   "day": 16
 },
 {
   "letterID": 735,
   "topic": "Babies",
   "title": "Grandma's Late Nights Take Their Toll on Her Grandkids",
   "text": "my son was killed in a car accident five years ago. his wife, who was pregnant at the time, gave birth to a beautiful baby boy a few months later.\nlast month, i received a phone call from a woman we barely know who told me -- very politely -- that she had a \"surprise\" for me. she then informed me that i have another grandchild, a little girl! she claims my son got her granddaughter pregnant six years ago, and that she had the dna checked to prove my son was the father. needless to say, my wife and i were floored.\nabby, i don't know how to react. my wife, who is level-headed, told me not to react right now and to think things through. do i go to this grandchild with open arms? it doesn't feel right. the child's mother has not reached out to us at all. i need your help. -- man with no plan in new york",
   "year": 2010,
   "month": 4,
   "day": 9
 },
 {
   "letterID": 761,
   "topic": "Babies",
   "title": "Daughter's Third Pregnancy Crosses the Line for Parents",
   "text": "our daughter \"bree\" has just announced that she's pregnant with her third child. her other children are 1 and 2. my wife and i are in our 60s and provide chi1d care three days a week, while the other grandma baby-sits for two days. we also pay for preschool and swimming lessons, as well as cook dinner for them on the days when we baby-sit.\nbree and her husband do not earn enough money to support even one child. we know we'll be expected to finance college for the children. when we agreed to help out, we asked them to promise they would not have more than two kids. this third one will cause us to use up our savings, increase our child care responsibilities and take us into our 80s to continue helping. is it wrong to feel used? i am very depressed over this. -- overwhelmed in san diego",
   "year": 2011,
   "month": 9,
   "day": 24
 },
 {
   "letterID": 924,
   "topic": "Babies",
   "title": "Bride Should Be Center Of Attention At Her Own Wedding",
   "text": "my sister-in-law is being married in september. i am in the wedding. my wife and i are having a baby in june, but the bride does not want to include my new baby. i think she is concerned people will pay attention to the baby and not her.\nmany distant relatives will attend and this may be the only time they will see my son. she plans to invite more than 200 people. am i right to be upset that my son, her nephew, is not invited? -- john doe in plano, texas",
   "year": 2014,
   "month": 5,
   "day": 16
 },
 {
   "letterID": 576,
   "topic": "Babies",
   "title": "Grandma Who Favors Grandson Is Causing Major Family Harm",
   "text": "about a year ago, i found out that i am biologically unable to father a child. my wife and i looked into several options and chose to go with an anonymous donor.\nhow would you suggest i handle comments like, \"that baby looks just like you,\" or \"she has your eyes.\" because our baby will be a girl, i was thinking of something like, \"i hope not -- she'll never get a date looking like me.\" any other suggestions? -- father-to-be",
   "year": 2006,
   "month": 3,
   "day": 5
 },
 {
   "letterID": 951,
   "topic": "Babies",
   "title": "Mom's Baby Talk Puts Down Daddy",
   "text": "my wife and i have been together for 10 years. like all couples do, we've had our ups and downs, but we love each other very much. two months ago, we welcomed our first son into our family; we are overjoyed.\nraising a newborn has its challenges because babies don't come with an owner's manual. our communication has always been good, and we work hard in our relationship to keep it that way. when we disagree, we try not to fight in front of the baby or raise our voices.\nbut something my wife does bothers me. she talks about me to the baby. an example: \"apparently you're too stressful for daddy right now, but not for me.\" i have asked her to please not do it. i understand that he's only 2 months old and can't understand her, but i don't feel disparaging me in front of him is right. am i wrong? or am i being overly sensitive? -- needs help in new york",
   "year": 2015,
   "month": 10,
   "day": 13
 },
 {
   "letterID": 599,
   "topic": "Babies",
   "title": "Baby Boy Isn't Pretty in Pink to Some Members of Family",
   "text": "my daughter recently had a baby boy. mother and baby are doing fine, but the problem is the sonogram during pregnancy showed a baby girl, according to the doctor. so now our grandson has a slew of pink blankets, jammies and clothes given by friends before little jack was born. i say, no big deal.\nmy wife says it is a big deal. no way a boy should be dressed in pink. she's worried the color will give the wrong message to people, who will then treat our grandson like a girl in a way they won't even be aware of, even though they're told he's a boy. she worries that this will somehow make him a cross-dresser when he's grown up and make him gay.\nour daughter and son-in-law are in a quandary, too, over the pink clothes. what do you think? -- jack's grandpa in guerneville, calif.",
   "year": 2007,
   "month": 4,
   "day": 2
 },
 {
   "letterID": 555,
   "topic": "Babies",
   "title": "Sister's Deployment to Iraq Fills Her Sibling With Regret",
   "text": "our daughter recently gave birth to a baby boy. we would like to establish a college fund in his name, but we have a dilemma. our son-in-law has two children by a prior marriage. we have an excellent relationship with all of them and do not want to hurt anyone's feelings. however, my wife and i are retired and are not in a position to fund three programs. what do you suggest? -- proud grandpa in new hampshire",
   "year": 2006,
   "month": 12,
   "day": 13
 },
 {
   "letterID": 569,
   "topic": "Babies",
   "title": "Wife Wonders What to Dish Out to Neighborhood Delilah",
   "text": "my wife just had a d and c because the baby was dead. there was no heartbeat. my problem is my wife doesn't want to talk about it.\ni love my wife more than any woman i have ever known. it hurts me more than words can express that she keeps this to herself. i love her and want to hold her, but she is pulling away. it's as if she feels this is my fault. i would like for us to cry together over the loss of our baby. how do i get through to her that this is what we need to do? -- \tsad husband in ohio",
   "year": 2006,
   "month": 8,
   "day": 5
 },
 {
   "letterID": 1075,
   "topic": "Babies",
   "title": "Dad Says No to Another Child Following Wife's Infidelity",
   "text": "five years ago i discovered my wife had been cheating on me with an ex-boyfriend for eight years. we have two young children, so we resolved our differences and decided against divorce.\nnow she says she wants us to have another baby. i feel i cannot handle a pregnancy with her because of her infidelity. as a hands-on father, i would want to be part of the pregnancy and the complications/changes that come with it. how should i handle this and express to her why i cannot (at this point) have another child with her? -- hands-on dad",
   "year": 2017,
   "month": 2,
   "day": 16
 },
 {
   "letterID": 551,
   "topic": "Babies",
   "title": "Meddling Mother Makes Future Bride Think Twice",
   "text": "there is an expression i hear all the time. it's \"we are pregnant.\" i have never known a man to be pregnant. i believe the expression should be, \"my wife is pregnant, and we are expecting a baby.\"\nhas terminology changed since i had my children 40 years ago, or am i missing something? -- senior citizen in bonita springs, fla.",
   "year": 2005,
   "month": 1,
   "day": 5
 },
 {
   "letterID": 1030,
   "topic": "Babies",
   "title": "Man Is Lost Without Wife He's No Longer in Love With",
   "text": "my wife, \"mimi,\" and i have been married nine years and together for 14. we have agreed that while we love each other, we are no longer \"in love.\" we have stayed together because we're comfortable.\nmimi has just informed me that she's pregnant with someone else's baby and will be moving out soon. she is all i have known since we have been together. i feel lost and confused and sad. do you have any advice? -- deeply hurt in tampa",
   "year": 2016,
   "month": 4,
   "day": 9
 },
 {
   "letterID": 146,
   "topic": "Babies",
   "title": "Bathrooms",
   "text": "i can't believe i'm doing this-but here goes! my wife and i have been married for 34 years. we have four grown children and two grandchildren. my wife is worried about getting pregnant. she will be 56 years old this year.\nmy question: when does a woman fall into the non-bearing age? and is it possible for my wife to get pregnant at her age? her husband",
   "year": 1990,
   "month": 4,
   "day": 11
 },
 {
   "letterID": 265,
   "topic": "Appropriate Behavior?",
   "title": "MAN HELPING A LOST GIRL COULD FIND LEGAL TROUBLE",
   "text": "a few weeks ago, i stopped in a convenience store to pick up some snacks. inside the store, a little girl-crying and apparently lost-grabbed my trousers and said, \"daddy!\" i looked around and didn't see anyone who looked daddy-like, so i picked her up, put her on my shoulder and told her we would find her daddy. i took her to the checkout stand, where the assistant manager picked up his microphone and announced that he had found a little girl named \"adrianne\" whose daddy was lost. adrianne's mother showed up and took her away.\nwhen i got home and told my wife about it, she told me i never should have touched the child; i could have been sued, jailed or both.\nwho was wrong? the grandfather who rescued a crying child, or the \"mother\" who left her crying between the canned peaches and the bread shelf? i guess the law says we should just leave the little ones to cry if we are not \"mommies.\"\ndon ransdell, squaw valley, calif.",
   "year": 1995,
   "month": 4,
   "day": 10
 },
 {
   "letterID": 744,
   "topic": "Appropriate Behavior?",
   "title": "Couple Is Moving at Different Speeds Toward the Next Step",
   "text": "my wife and i are having a disagreement. i went into a women's clothing store to buy her a formal dress for christmas. she has recently gotten into superb shape, and i wanted to celebrate it by buying her something formal but sexy.\ni found an item i liked but was unsure how or whether it would fit her. the store manager who was helping me asked one of the salesclerks to try it on for me. she did, and i bought the dress.\nmy wife feels this was highly inappropriate of everyone involved -- tantamount to a \"come on.\" can you give me your views? -- well-intended in phoenix",
   "year": 2010,
   "month": 2,
   "day": 13
 },
 {
   "letterID": 782,
   "topic": "Appropriate Behavior?",
   "title": "Wife Says Kiss on the Hand Deserves Slap on the Wrist",
   "text": "my wife and i shop in an upscale shoe store. on the past two visits there, a middle-aged salesman kissed my wife's hand when we left. i was surprised but not offended, considering it to be nothing more than an old-fashioned expression of courtesy. the man is knowledgeable, helpful and honest. my wife, however, disagrees. she says his gesture is forward and inappropriate and that i should resent it. who's right? -- t.r. in houston",
   "year": 2011,
   "month": 4,
   "day": 28
 },
 {
   "letterID": 123,
   "topic": "Appropriate Behavior?",
   "title": "Workout",
   "text": "is it appropriate for a gentleman to compliment a woman on her perfume, and to inquire as to what kind it is, particularly if they are strangers to one another?\nwould the age of the persons involved make a difference? occasionally i have noticed a very lovely fragrance on a woman and i have wanted very much to know the name of it so that i could buy some for my wife, but i didn't want to appear as though i was making a pass or trying to flirt.\nwhat do you think? and if you think it's okay, how should i ask? wondering in wisconsin",
   "year": 1989,
   "month": 7,
   "day": 19
 },
 {
   "letterID": 961,
   "topic": "Anniversary Gifts",
   "title": "Text Alerts On Bank Accounts Sacrifice Surprise For Security",
   "text": "i am totally frustrated. my wife has implemented alerts on our credit cards, bank accounts and debit card accounts to a point that i can't buy surprise gifts for her birthday, our anniversary, valentine's day, etc., without receiving a text from her almost immediately asking if i charged something to a specific store.\ndo you think this is a control obsession, or is she just overly cautious? every time i try to discuss this with her, she says she's trying to make sure we are not hacked, etc. i want to be able to buy her things and create the element of surprise.\ni would love some financial privacy at special times. other than this, i have nothing to hide. do you have any advice to help me save my sanity on this one? -- under surveillance in north carolina",
   "year": 2015,
   "month": 8,
   "day": 22
 },
 {
   "letterID": 630,
   "topic": "Anniversary Gifts",
   "title": "Friend Advises Punster to Go Slow With New Colleagues",
   "text": "when i proposed to my wife 15 years ago, i surprised her with a trip to san francisco. we got engaged on one of the benches in ghirardelli square. i spent thousands on the ring and more on the flight, hotel, dinners, etc.\never since, my wife has returned every gift i have given her for christmas, her birthday, our anniversary and, most recently, on mother's day. it's never right. it's too small, too large, too expensive, too shiny, too furry -- too anything.\nnot surprisingly, my desire to buy her gifts has dwindled over the years to the point where i never feel like getting her anything.\nour 14th anniversary is coming up. i know, as usual, she expects me to do something to celebrate the occasion -- but i don't want to waste time and effort on something she won't like and will return. i think she is ungrateful, and she will probably get nothing this time around as i am too tired to deal with it. however, if i don't buy something, i will probably feel guilty because she always buys me \"something,\" even if it's another watch -- i already have seven, which i don't wear. what should i do? -- gift grinch in carlsbad",
   "year": 2008,
   "month": 7,
   "day": 23
 },
 {
   "letterID": 105,
   "topic": "Anniversary Gifts",
   "title": "NEW MATE WILL SOON BE OLD NEWS",
   "text": "i'm wondering how come it's always the husband who buys the wife a gift on their wedding anniversary-and not the other way around?\nin this age of \"equal rights\" and \"women's lib,\" one would expect gift-giving to be reciprocal, but apparently women seem quite content with the old double standard.\nand by the way, while i was buying flowers for my wife for our anniversary, i raised that question with the florist. she said, \"don't you think your wife deserves flowers for having given you two wonderful children?\" this confused me even more, as i was under the impression that the children were my wife's, too! confused",
   "year": 1988,
   "month": 10,
   "day": 27
 },
 {
   "letterID": 120,
   "topic": "Anniversary Gifts",
   "title": "Son's high utility bills upset mom",
   "text": "my wife and i agreed to chip in with a group of friends to buy a 50th wedding anniversary gift for a couple we have known for many years. the group giving this gift consists of eight married couples and one widow.\none member of our group-not the widow-adamantly insists that the cost of the gift should be divided by 17. we think it should be divided by nine.\nwhat do you think? in doubt in arizona",
   "year": 1989,
   "month": 5,
   "day": 3
 },
 {
   "letterID": 336,
   "topic": "Anniversary Gifts",
   "title": "Return of Anniversary Gift Still Rankles Widower",
   "text": "i have carried this resentment for two years and would like to ask you if i am right or wrong to feel hurt and angry.\non thanksgiving 1996, which was our 53rd anniversary, my wife and i invited our children and grandchildren and a few close friends to our home for dinner. we received many nice gifts from all.\nabby, the following day my wife passed away. it was completely unexpected. thank goodness all my family was here.\none couple, whom my wife and i had known for many years, immediately asked me to return their gift. i was shocked, but of course i complied. my children were angry at me for giving in to their request.\nwas i wrong to return their gift? please don't identify me, as the couple lives nearby. -- still hurting in georgia",
   "year": 1998,
   "month": 7,
   "day": 13
 },
 {
   "letterID": 956,
   "topic": "Other Couples + Dinner",
   "title": "Man Prays For Forgiveness From Other Diners In Restaurant",
   "text": " my wife and i had dinner with some other couples at an elegant, white linen tablecloth restaurant. after the meals were brought to the table, someone said, \"we need to pray.\" in this quiet, candlelit setting, a \"bless us, oh lord ...\" was spoken aloud by most of the people in our party, causing heads to turn at a number of nearby tables. undoubtedly, the din sounded like chanting. i was embarrassed.\nplease understand, we are religious and we pray aloud in church, but not in restaurants. i have seen people bow their heads and pray privately, which seems more appropriate. is there a rule of etiquette about praying in a restaurant? -- silently praying for advice",
   "year": 2015,
   "month": 9,
   "day": 10
 },
 {
   "letterID": 400,
   "topic": "Other Couples + Dinner",
   "title": "Foster Grandparents' Menu Is Causing a Family Stew",
   "text": "we have been invited to my foster parents' home for a celebration that includes a meal of venison. my wife and young children do not like that kind of food. the host asked for help with the veggies and desserts. we obliged, and told him that we would also bring pizza for the kids, who are 2, 6 and 9 years old. (they know from past experience that the kids won't eat venison.)\nmy foster parents objected to this -- they feel that everyone should eat what's put in front of them. most of their meals are what one would call \"eccentric.\" it will be mealtime when we arrive, and we don't want to starve the kids. are we out of line, or should they be more accommodating to the palates of their guests? -- parent in lowell, mass.",
   "year": 2000,
   "month": 6,
   "day": 4
 },
 {
   "letterID": 975,
   "topic": "Other Couples + Dinner",
   "title": "Prayer Can Turn to Panic During Restaurant Outings",
   "text": "i'm comfortable with my faith and pray before a meal at home and at friends' houses. we have become friendly with individuals from our church, and on many occasions have gone out to eat together at restaurants. when the meal is brought out, it has become a custom to pray. i feel uncomfortable praying aloud in public, and have seen others at our table already eating when someone says, \"let's pray.\"\nmy wife tells me to just go with it. but sometimes when the praying goes on for a lengthy time, i start to get sweaty and on the verge of a panic attack. i wish they would take into consideration that others may feel praying is a private matter. i don't believe that because one person doesn't want to do something, others shouldn't do it.\nso what say you? when food is brought to the table, should i dash to the restroom, or would that be rude? -- prefers praying privately",
   "year": 2015,
   "month": 5,
   "day": 3
 },
 {
   "letterID": 717,
   "topic": "Other Couples + Dinner",
   "title": "Dad's Chronic Cheating Strains Daughter's Trust in Boyfriend",
   "text": "we have some longtime friends, the \"gotrocks,\" who frequently come over for dinner. when they do, they bring \"house gifts\" -- commercially made cakes, danish, etc. that are well past their expiration dates -- then brag about how much they saved on the food.\nmy wife and i limit our intake of sugar, high-fat and processed foods, and the gotrocks are aware of it because we have told them, but they persist. i am offended that they would offer low-quality food that i wouldn't serve an animal.\nwhat should i do? accept the garbage gracefully, not serve it and deep-six it after they leave, or tell them to stop bringing it?\nincidentally, money isn't an issue here; they proudly admit they are cheap. -- offended in pennsylvania",
   "year": 2010,
   "month": 8,
   "day": 20
 },
 {
   "letterID": 616,
   "topic": "Other Couples + Dinner",
   "title": "Man Finds Neither Time Nor Money for Love Child",
   "text": "my wife accuses me of \"acting pretentious\" when we are dinner guests at a friend's house and i warm my plate in the microwave. what am i supposed to do when the food has gone cold or lukewarm, and i want my meal to be hot? -- some like it hot, san jose, calif.",
   "year": 2008,
   "month": 11,
   "day": 9
 },
 {
   "letterID": 1046,
   "topic": "Other Couples + Dinner",
   "title": "Couple's Excessive Drinking Strains Longtime Friendship",
   "text": "my wife and i have been friends with another couple, \"bill\" and \"emily,\" for 20 years. we usually have dinner together once every four to six weeks.\nin the past, everyone enjoyed a cocktail or a glass of wine with dinner and nobody overdid it. but over the last year or so, it is clear that they have started drinking earlier in the day, before we arrive. they each consume multiple drinks while my wife and i are still on our first. emily often is noticeably drunk within the first hour and excuses herself to go to bed while bill continues drinking. often dinner plans at their house or at a nearby restaurant must be canceled because of this behavior.\nwhen they visit our home, emily helps herself to several glasses of wine before dinner and then passes out in our guest room, while bill sits on the couch rambling on and we speed up the cooking to get food on the table. when dinner is finished, we suggest it's time to call it a night. our get-togethers are now over in less than two hours.\nhow do we tell these otherwise nice friends that they drink too much? -- unwilling bartender in arizona",
   "year": 2016,
   "month": 1,
   "day": 18
 },
 {
   "letterID": 1024,
   "topic": "Other Couples + Dinner",
   "title": "Demanding Dinner Companions Leave Bad Taste in Friends' Mouths",
   "text": "we often go out to dinner with another couple and have done so for several years. it has become increasingly embarrassing because of the demands they place on the servers.\nthey always want more butter (and often demand it before the rolls or bread are served), they want more sauce, more gravy, more cheese, more dressing, then more bread, butter, syrup -- basically more of everything. then they feel compelled to let the server know what was wrong with the meal after we are finished.\nhow can my wife and i bow out of dinner dates with them without canceling all other social activities we do together? -- desperate at dinner",
   "year": 2016,
   "month": 5,
   "day": 4
 },
 {
   "letterID": 380,
   "topic": "Other Couples + Dinner",
   "title": "Cell Phones in Cars Add to Arsenal of Distraction",
   "text": "i won a gift certificate for two free dinners at a very nice restaurant. if i call another couple to join us for dinner, should i be expected to share the certificate with them -- or do i explain that my wife and i will be eating for free because of the certificate and they will pay for their own dinner? -- joseph f. in sherman oaks, calif.",
   "year": 1999,
   "month": 1,
   "day": 14
 },
 {
   "letterID": 745,
   "topic": "Phone",
   "title": "Wife Doubts Her Marriage Can Survive Husband's Depressions",
   "text": "my wife is addicted to her cell phone. whenever we're out together it's impossible to converse with her because she always has one or two text conversations going on.\nthe first thing i hear in the morning is her phone buzzing, notifying her of an incoming text. the last thing i hear at night is her sending a good-night message to one of her friends. if no texts are coming in, she plays games on her phone even if we're watching tv or if company is over.\ni have told her it's making me crazy, but she won't stop. the constant clicking drives me up the wall. i feel as though i have lost my wife to her phone. am i being overly sensitive? what do i do? -- click-crazy in california",
   "year": 2010,
   "month": 2,
   "day": 12
 },
 {
   "letterID": 627,
   "topic": "Phone",
   "title": "Wife's Cell Phone Mystery Man Unsettles Her Husband",
   "text": "my wife of 25 years has been talking on the phone with a married man who lives in a city 300 miles away. they chat for more than an hour a week. our cell phone bills indicate that this has been going on for more than a year.\ni have decided there is nothing to gain by confronting her with this information, but every few months i wonder. she has never talked to me about him. there is no way she has been able to see this man during this time, but i wonder why she hasn't mentioned that she has a \"phone pal.\"\nat least she got him to stop calling the house and hanging up when i answered. (she noticed i looked at the caller id.) any suggestions? -- suspicious in columbus",
   "year": 2008,
   "month": 8,
   "day": 8
 },
 {
   "letterID": 940,
   "topic": "Phone",
   "title": "Spoiled Teen Is Winning War Of Wills At Home",
   "text": "our 13-year-old is addicted to her phone. she stays on it for hours, and it's affecting the time she goes to bed. she's now starting to oversleep the alarm in the morning before school.\nshe's spoiled, and i'm afraid that removing or limiting phone privileges will lead to major problems with her protesting it. i don't want truant officers or social workers coming to my house because my wife and i can't discipline our kid.\nhow do you handle a spoiled brat without involving outside agencies? she's nice to people in school, but is lazy at home and totally self-centered. -- frustrated, exhausted dad",
   "year": 2014,
   "month": 1,
   "day": 25
 },
 {
   "letterID": 588,
   "topic": "Bed",
   "title": "Scholarship Student Wonders if School Is Worth All the Pain",
   "text": "my wife eats cookies and crackers in bed. when i ask her not to, she tells me it's her bed too, and says i can't tell her what to do. in the meantime, i have to sleep amid the crumbs.\nam i being bossy or is she being inconsiderate? if i'm bossy, please help me understand. if she's inconsiderate, how do i make her understand? -- the cookie monster's husband",
   "year": 2007,
   "month": 10,
   "day": 14
 },
 {
   "letterID": 950,
   "topic": "Bed",
   "title": "Wife Needs a Wake-Up Call on Family's Sleeping Patterns",
   "text": "my wife and i have been married 16 years. we have three boys, ages 12, 6 and 2. my 6-year-old doesn't sleep in his bed. he sleeps on the couch. my wife sleeps in a recliner in the den. the 2-year-old usually sleeps with her. sometimes he sleeps in a crib in our room. i sleep by myself in a king-size bed.\nthere is no possibility for romance. the only time there can be is when my wife comes to bed. if this happens, i know something is going to take place, but i have no chance to initiate. our sex life is totally up to her. once a month or so is fine with her, but not for me.\ni have told her how i feel about our \"sleeping arrangements,\" but nothing has changed. i know i snore, but she has not complained about it keeping her awake or used it as an excuse.\nour 6-year-old will not sleep in his bed as long as his mother sleeps in the recliner. the longer this goes on, the harder it will be to get him in his bed. do you have any advice on what i should do or say about this situation? -- sleeping solo in the south",
   "year": 2015,
   "month": 10,
   "day": 20
 },
 {
   "letterID": 888,
   "topic": "Bed",
   "title": "Skip The Bouncy Bed; Buy A Trampoline",
   "text": "my wife and i and our teenage son came home from a family get-together, and after he went to bed, my wife told me she wants to get a new, \"bouncier\" bed. we don't want to wake up our son with the noise of our enjoying it. what kind of bed do you recommend? -- mr. romance in oregon",
   "year": 2013,
   "month": 4,
   "day": 1
 },
 {
   "letterID": 783,
   "topic": "Spouse Death",
   "title": "Woman Who Rejects Present Is Not Worth Gifting Again",
   "text": "i found out my high school sweetheart has cancer and only a short time to live. i would like to send her flowers and a message -- but without the knowledge of my wife of 43 years. is this a bad idea? -- old flame in illinois",
   "year": 2011,
   "month": 4,
   "day": 18
 },
 {
   "letterID": 896,
   "topic": "Spouse Death",
   "title": "Woman Undergoes Change In Circumstances, Outlook",
   "text": "i was a busy wife, mother and grandmother who had always been active and involved in my church and community. when my beloved husband died three years ago, everything changed. i became so consumed by grief, all my regular activities suddenly meant nothing to me.\nmy children and grandchildren were busy with their own families and careers. i missed having someone to talk to and began feeling deeply lonely, even in a crowd.\nthen something remarkable happened: i learned i have an incurable cancer. i was so scared and worried, i couldn't eat or sleep. one of my sons took me to a world-famous cancer center. everyone i met there was loving and kind, and radiated positive feelings. once again, i felt surrounded by love -- and it changed my outlook.\ni was able to return to my hometown for further treatment in a cancer center here, and i return to the larger center for follow-ups. now i have the best of two worlds -- a world-famous cancer center a plane ride away, and the ability to sleep in my own bed at night. i also have people in two centers who treat me with love and respect. community and church members are rallying around me to show their support. i feel blessed and content, and the best part is i am no longer afraid.\nabby, what do you think about my change in attitude? am i in denial or experiencing some new stage of grief? i don't want to have cancer. i don't want to leave everyone behind. but i am not afraid to die. -- loving every day without fear",
   "year": 2013,
   "month": 1,
   "day": 20
 },
 {
   "letterID": 20,
   "topic": "Spouse Death",
   "title": "Dear Abby: Recalling a Message Worth Repeating",
   "text": "i lost my beloved wife three'months ago to cancer. she was 65. i am 66. we had been married for 45 years and loved each other very much.  during her illness i became reacquainted with a girl i knew in high school. ( we became roacquainted at the  hospital while visiting our spouses.) her husband died  of cancer five days after my wife. our friendship quickly blossomed into love. and we  want to marry. my question: out of respect to our deceased mates, how long must we wait before  marrying again? -life is short dear life: the time to show respect is while your spouse is living. and if you have done so, you need not be concerned about how long you should wait before remarrying. however. you would both be wise to give yourselves  sufficient time to work through your respective grief. having just been through an emotionally draining experience. it's easy to confuse consolation. comfort,  understanding and even relief with \"love.\" give yourselves a little more time before making a legal  commitment.  el  ",
   "year": 1985,
   "month": 7,
   "day": 14
 },
 {
   "letterID": 774,
   "topic": "Spouse Death",
   "title": "Church Teacher Dodging Dates Should Say 'Never on Sunday'",
   "text": "my wife is a cancer survivor who is doing well. when a friend or relative learns she had cancer, a common response is, \"yeah, i knew someone who had the same kind of cancer. it was awful. it came back six months later and he/she died an agonizing, terrible death.\"\nabby, it's hard to remain polite around such thoughtless, moronic individuals when they blurt out something like this in my wife's presence. i can't imagine the fear she must experience hearing such remarks. can you offer an effective retort? -- baffled by the ignorance",
   "year": 2011,
   "month": 6,
   "day": 8
 },
 {
   "letterID": 10,
   "topic": "Spouse Death",
   "title": "ATHEIST VOWS SHE'LL PUT NEW RELIGION TO PRACTICE",
   "text": "i lost my beloved wife three months ago to cancer. she was 65, i am 66. we had been married for 45 years and loved each other very much. during her illness i became reacquainted with a girl i knew in high school. (we became reacquainted at the hospital while visiting our spouses.) her husband died of cancer five days after my wife.\nour friendship quickly blossomed into love, and we want to marry. my question: out of respect to our deceased mates, how long must we wait before marrying again?\nlife is short",
   "year": 1985,
   "month": 7,
   "day": 14
 },
 {
   "letterID": 1053,
   "topic": "Spouse Death",
   "title": "Lonely Widower Is Ready to Reach Out to Woman at Church",
   "text": "my wife of 55 years passed away five months ago and i am lonely. how long should i wait before establishing a relationship with another woman?\na certain lady and i go to church together, so we are well acquainted. i never thought about being with her until my wife died. she and my wife were friendly acquaintances.\nwhat is the right time to wait? six months? a year? i never thought i could be lonely. well, think again! -- ready for the future",
   "year": 2017,
   "month": 8,
   "day": 8
 },
 {
   "letterID": 448,
   "topic": "Spouse Death",
   "title": "Wife's Sudden Death Leaves Man Struggling With His Grief",
   "text": "after more than 49 years of a wonderful and happy marriage, my wife became ill and died within five days. i was overcome with grief. it has been four months, and i am still depressed and heartbroken. how long will it take for the heartache to go away?\nfrom your experience, do you think it would be better to sell my home that we lived in 49 years with all the memories -- or wait a while? i live out in the country, and my small town and church offer very little social activity.\nabby, i can't seem to think clearly and would appreciate your advice. -- robert in new york state",
   "year": 2002,
   "month": 10,
   "day": 5
 }
]